{
  "https://cmu.joinhandshake.com/events/476377": {
    "name": "Diversity & Inclusion Webinar Series",
    "dates": [
      {
        "start_date": "2020-04-06",
        "end_date": "2020-08-26",
        "start_time": "24:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "The McKinsey Black Network and Hispanic &amp; Latino Network are hosting a series of webinars to provide virtual opportunities to learn more about who we are as a firm and what we do. You will have the opportunity to get to know consultants and recruiters in each of our regions and our practices. Follow the link below to register for a session!\"\n\nRegister for our upcoming webinar series here - https://www.surveys.online/jfe/form/SV_cCHsmIwtymzeSFv"
  },
  "https://cmu.joinhandshake.com/events/488170": {
    "name": "IBM Call for Code University Edition",
    "dates": [
      {
        "start_date": "2020-04-22",
        "end_date": "2020-07-31",
        "start_time": "24:00:00",
        "end_time": "23:55:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://callforcode.org/",
    "description": "Now in its third year, the Call for Code Global Challenge is a multi-year global initiative that rallies developers, visionaries, and problem solvers to create practical, effective, and high-quality applications based on cloud, data, and artificial intelligence that can have an immediate and lasting impact on humanitarian issues. Call for Code brings start-up, academic, community, and enterprise developers together and inspires them to solve the most pressing societal issues of our time.\n\nThis year’s Call for Code Challenge has been expanded to two tracks in order to tackle two life-altering world problems: COVID-19 and climate change. These issues have the power to compromise our health, our planet and our survival - and need to be addressed now. More information about this year’s challenge can be found on the Challenge homepage: https://callforcode.org/\n\nAdditionally, in partnership with the Clinton Global Initiative University (CGI U), we are launching the inaugural University Edition of the 2020 Call for Code Global Challenge. This will activate student developers, like you, to tackle these world problems. Through a series of virtual hackathons, workshops and other learning opportunities, you will be enabled with the skills necessary to work as a team and create solutions to these issues.\n\nThe 2020 Call for Code Global Challenge - University Edition will kick-off on Earth Day, April 22, with a virtual introduction by IBM’s Chief Developer Advocate and GM Willie Tejada and a special guest speaker to be revealed soon! Following the session, which will include a Q&amp;A, our developer advocates will host workshops to get you started on your projects.\n\nStay tuned in the Slack Workspace (add the #University channel) for information on upcoming virtual hackathons, enablement sessions, office hours and more!\n\nWe will be supporting you every step of the way. From helping you construct a team, to ideation sessions. From roadblocks in your project, to how to present what you’ve created. For any problem you run into, there will be an IBMer excited to work through it with you.\n\nYou are the future, and we hope you will join us by answering the call to make a brighter tomorrow for our planet. There has never been a more important time than right now to use technology for good.\n\n\nHere are some helpful links to get you started!\nApril 22 Event Registration link:\nhttps://cgiu.cgiforms.org/view.php?id=141342\n\nHelpful COVID Code Patterns\nhttps://github.ibm.com/spackows/AI-ContentOps/tree/master/COVID-19\n\nSlack info\nwww.callforcode.org/slack - Please add the #University channel\n\nCOVID Starter Kits:\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Cooperation-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Communication-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Education-2020\n\nClimate Change Starter Kits:\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Energy-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Disasters-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Water-2020\n\nProject Sample:\nhttps://github.com/Code-and-Response/Project-Sample"
  },
  "https://cmu.joinhandshake.com/events/490035": {
    "name": "Translational Biomedical Research Management M.S. - graduate program info session",
    "dates": [
      {
        "start_date": "2020-04-23",
        "end_date": "2020-05-31",
        "start_time": "18:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://hartwick.zoom.us/j/969511403",
    "description": "We are recruiting for our Master's in Translational Biomedical Research Management!\nJoin our virtual info sessions on Tue/Wed/Thu (6-7pm EST) every week between April 23rd and May 31st, 2020. Connect online through the video URL provided above or dial 1(646)558-8656 to join the event by phone; use meeting ID 969511403 when prompted.\nDon't hesitate to ask any questions about our graduate admission process at Hartwick - Let's talk!\nVisit us online anytime: www.hartwick.edu/moveintomanagement"
  },
  "https://cmu.joinhandshake.com/events/493084": {
    "name": "McKinsey & Company: Our very first EEMA Hackathon: PROHACK",
    "dates": [
      {
        "start_date": "2020-04-27",
        "end_date": "2020-06-21",
        "start_time": "24:00:00",
        "end_time": "23:55:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "McKinsey &amp; Company are excited to announce that registration is open for PROHACK, our very first online EEMA hackathon for data scientists across CIS, the Middle East, Turkey, Pakistan and Africa. Participants can work independently or in teams of up to 4 to develop efficient business solutions using data science, and the top 20 teams will share a $25,000 prize!\n \nThe task details and dataset will be available May 18, and the deadline to upload solutions is June 21. Please note that anyone can join before the last day (June 21) to PROHACK! Registrations are now open at http://prohack.org with easy sign up – no applications and no resume screenings! \n\nShare in your personal LinkedIn and social media accounts: \nLinkedIn: https://www.linkedin.com/feed/update/urn:li:activity:6661229957630476288/\nFacebook: https://www.facebook.com/reallifeatmckinsey/videos/233139794455878/"
  },
  "https://cmu.joinhandshake.com/events/474647": {
    "name": "Public Financial Management: Virtual Excel Training - REGISTRATION IS CLOSED",
    "dates": [
      {
        "start_date": "2020-05-15",
        "end_date": "2020-05-22",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://careers-pfm.icims.com/jobs/1516/pfm%3a-virtual-excel-training/job",
    "description": "Join Public Financial Management for a two-session Excel Training via webinar on Friday, May 15th and Friday, May 22nd. Each session will run from 1:00-3:00PM EST and you are encouraged to attend both, as the second session will build off of skills acquired during the first session!\n\n The first session will cover Excel navigation, keyboard shortcuts and some of the more basic Excel functions. The second session will focus on some of the essential Excel functions for financial modeling.\n\nThis is a FREE virtual training! \n\n***REGISTER ON OUR EXTERNAL WEBSITE! LINK ABOVE!***\n\nIn order to register, you must be a student who is currently enrolled in an undergraduate or graduate college program or have graduated from such programs within one year, and must demonstrate interest in the public finance/asset management industries as evidenced by academic coursework, activities, internships/work experience, and/or your statement of interest. We will notify registrants of their attendance status and with additional information no later than May 11, 2020."
  },
  "https://cmu.joinhandshake.com/events/490693": {
    "name": "*Udemy LIVE Q&A",
    "dates": [
      {
        "start_date": "2020-05-18",
        "end_date": "n/a",
        "start_time": "01:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://app.hallothere.io/Udemy/ama/302",
    "description": "Udemy is an online learning destination that helps students, companies, and governments gain the skills to compete in today's economy."
  },
  "https://cmu.joinhandshake.com/events/501634": {
    "name": "Career Info Session | Oliver Wyman - Careers in Consulting",
    "dates": [
      {
        "start_date": "2020-05-19",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "+03"
      }
    ],
    "location": "https://cmu.zoom.us/j/93695182590",
    "description": "Learn about careers in consulting with Oliver Wyman, who recently set up a new office here in Qatar.\nA major consulting firm trusted by some of the largest companies in the world, who are poised to grow their operations in Qatar, over the coming year."
  },
  "https://cmu.joinhandshake.com/events/498808": {
    "name": "KLA Virtual Career Fair - May 19th!",
    "dates": [
      {
        "start_date": "2020-05-19",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:05:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://www.kla-tencor.com/company/events/virtual-career-fair-2020-05",
    "description": "Register to Discover How You Can Advance Humanity Forward\n\nAspiring students and professionals will have a chance to hear from KLA’s CEO Rick Wallace about the company’s role in the most significant technological breakthroughs.\n\nVirtually no laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. At our virtual Career Fair, you'll have a chance to connect with our hiring managers and learn about our job opportunities, culture, offer and vision. Listen in as they cover why this is one of the most attractive times to join KLA."
  },
  "https://cmu.joinhandshake.com/events/500536": {
    "name": "Conquering Client Conversations",
    "dates": [
      {
        "start_date": "2020-05-19",
        "end_date": "2020-05-21",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://www.cvent.com/events/pnc-campus-conquering-client-conversation-webinar-series/event-summary-4b3ab4e62f8b42c798c42dd7567aef42.aspx",
    "description": "Please join us for a series of virtual sessions to learn more about PNC Financial Services Group and how we use award winning culture to provide a tailored banking experience for our clients. Over the course of 3 sessions, we will be exploring how analysts provide real world solutions for our clients. Come prepared to engage with us!\n\nSessions will be held from 2:00-3:00pm EST on the following days:\n\n•Tuesday, May 19th Phase 1: Meeting the Client's Asset Management Needs\n• Wednesday, May 20th Phase 2: Leveraging Lines of Credit \n• Thursday, May 21st Phase 3: Tech Talk\n\nQualifications:\n• Currently a freshman, sophomore, or junior\n• 3.0 GPA or Higher\n• Interest in the Financial Services industry\n\nInterested? Please be sure to register for your session(s) of interest using the link below at least 48 hours before the scheduled session.\n\n**You MUST register for the event via the link below.**\nhttp://www.cvent.com/events/pnc-campus-conquering-client-conversation-webinar-series/event-summary-4b3ab4e62f8b42c798c42dd7567aef42.aspx"
  },
  "https://cmu.joinhandshake.com/events/486084": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-05-19",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/"
  },
  "https://cmu.joinhandshake.com/events/495107": {
    "name": "Veritas Prep Virtual Info Session for Educators (Round 2!)",
    "dates": [
      {
        "start_date": "2020-05-19",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Interested in teaching next year? Find out why you should teach at Veritas Prep! Join school leaders and teachers from our middle schools in Springfield and Holyoke, MA, to learn more about us.  Register at https://forms.gle/LoxoHem8SZAN4CLx9 to get the Zoom link!\n\nCan't make it? Check out our Careers Page at https://www.veritasprepcharterschool.org/careers for a full list of open positions for SY21 or email recruitment@vpcs.org to set up an informational call."
  },
  "https://cmu.joinhandshake.com/events/478131": {
    "name": "*Webinar* HubSpot Presents: Empowering Equity and Leading with Inclusion",
    "dates": [
      {
        "start_date": "2020-05-19",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "17:15:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "A more equitable world can create a more equal world. Join us for a webinar panel discussion celebrating International Women's Day. We'll discuss empowering equity in the boardroom, in leadership, closing the wage gap and how to empower ourselves and others in the workplace and beyond."
  },
  "https://cmu.joinhandshake.com/events/497213": {
    "name": "The Virtual Job Search: How to stand out while staying in",
    "dates": [
      {
        "start_date": "2020-05-20",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Have you been trying to navigate the virtual job search? Are you unsure how to handle virtual interviews instead of in-person interviews? Are you questioning if you should even be looking for a job/internship?\n\nRecruiters from Fast Enterprises will give their top tips on how to navigate through this uncertain time when searching for a job. We will cover changes to the job search process and provide tips on virtual interviews and networking. This presentation will help whether you are soon to be graduating and looking for a job or wondering what the job search will look like in the fall and want to start preparing now.\n\nFAST is an industry leader in the development and installation of software for government agencies. We are looking for problem solvers (from a variety of majors: Computer Science, Engineering, Mathematics, among others) to join our growing company in entry-level, full-time positions.  \n\nFast Enterprises was recognized as a Great Place to Work® for Millennials, Technology, and Diversity in 2019! Check out our employee reviews on Glassdoor!"
  },
  "https://cmu.joinhandshake.com/events/493243": {
    "name": "Emerging Leaders Summit: Sparking Fire within Young Professionals",
    "dates": [
      {
        "start_date": "2020-05-21",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "If you are a college student or recent graduate whose classes and internships have been disrupted by COVID19, you've almost certainly thought about the uncertain future in regards to what you may do and where you may go.\n\nWith social distancing guidelines and lock-down parameters in place, you may need new solutions, insights, and perspectives on how to navigate the COVID19 professional landscape. How can we use this as an opportunity to hone our skills? How can we prepare ourselves to excel and grow from this experience instead of feeling stuck and unproductive?\n\nEven before COVID19, professional development, long-term thinking, and career mapping has always been hard. Join us as we share our insights on the uncertain future.\n\nDiscuss how to be engaging in change to promote a growth mindset that helps you adapt. With our Ignite NextGen leaders leading the conversation, this will be a powerful way for all participants to connect and find new allies, friendship, and community.\n\nNow officially offering the Emerging Leaders Summit for FREE, thanks to a generous donor who helped fund this event!\n\nThis event is hosted as a partnership between the Council of Korean Americans and the Korean American Coalition of Los Angeles."
  },
  "https://cmu.joinhandshake.com/events/490981": {
    "name": "Data Jamming Session 1 - Participate and Win exciting Prizes",
    "dates": [
      {
        "start_date": "2020-05-22",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "24:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "As a follow up to the session on Analytics and Insights with focus on data, we are coming back to host a Data Jamming Session. \n\nThis will be our first session in our Data Jamming series! Data enthusiasts, come join us to learn about this contest involving data collection! We will introduce the data collection topic which will focus on \"Correcting Design Defects in Economic and Corporate Models\" from a students perspective in current times."
  },
  "https://cmu.joinhandshake.com/events/501864": {
    "name": "*PhD Industry Job Search",
    "dates": [
      {
        "start_date": "2020-05-22",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJwqdOqgrzkuG9EVwwy3eb85VGE50jO6AMvr",
    "description": "Career Consultant Marcie Foy will lead a presentation and Q&amp;A session for PhD Students focused on conducting a successful industry job search. This session will provide strategies and tools to leverage as you conduct your search. Topics include: creating an industry resume, conducting an efficient job search, job search process and timing, networking and interviewing.\n\nRegistration is required, to register for the Workshop in Zoom use the link below- PLEASE USE YOUR CMU ANDREW EMAIL: https://cmu.zoom.us/meeting/register/tJwqdOqgrzkuG9EVwwy3eb85VGE50jO6AMvr\n\nAfter registering, you will receive a confirmation email containing information about joining the workshop. To log in to the session on the day of the event, follow this link: https://cmu.zoom.us/j/98733812415"
  },
  "https://cmu.joinhandshake.com/events/493368": {
    "name": "*How to Make the Most of your Summer: Build Skills and Experiences Employers Want",
    "dates": [
      {
        "start_date": "2020-05-22",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJ0ucu6spj4tE9Qfe320O9oJ8SVc9tiZOOJG",
    "description": "Is your summer turning out to look different than you had imagined? There are still opportunities to have professional experiences and there are areas that you can focus on and develop this summer that will help you standout in your full-time job search. Your Career Consultants will discuss things to keep in mind, opportunities to take advantage of, and how we can support to you this summer.\n\nRegistration is required, to register for the Workshop in Zoom use the link below- PLEASE USE YOUR CMU ANDREW EMAIL:\nhttps://cmu.zoom.us/meeting/register/tJ0ucu6spj4tE9Qfe320O9oJ8SVc9tiZOOJG\n\nAfter registering, you will receive a confirmation email containing information about joining the workshop. To log in to the session on the day of the event, follow this link: https://cmu.zoom.us/j/99357485790"
  },
  "https://cmu.joinhandshake.com/events/490640": {
    "name": "Virtual HireUp Career Fair Hosted by the Pittsburgh Technology Council",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://www.careereco.com/Fair/EventDetails?fairId=e8776210-422b-4dc8-907e-aba0013a3df1",
    "description": "Hire Up Virtual Career Fair\nWhat is the Hire UP Virtual Career Fair?\nThe Hire UP Virtual Career Fair provides an opportunity for employers and job seekers to connect and network online. For employers seeking to expand their pipeline of tech talent, the Hire UP event is and time efficient solution to recruitment efforts.  \n\nOur hope is to connect displaced and underemployed regional workers with local companies who are hiring technical/corporate employees. For companies who are not hiring and/or have had layoffs, this could serve as outplacement support for displaced workers. \n\nWHEN: May 27, 2020 | 11 am to 3 pm\nWHERE: Anywhere with an internet connection\n\nWhat type of candidate is invited?\nThe main purpose of the event is for employers to recruit technical talent. Non-technical talent may attend, and employers may post non-technical jobs, however the focus is on tech roles. \n• Candidates seeking Full-time, Part-time, and Internships\n• Recruit graduate and undergraduate talent\n\nCompanies currently scheduled to attend:\nAmazon\nAstrobotic\nCGI\nConnectiveRx\nDollar Bank\nFragomen\nGiant Eagle\nHighmark\nLeidos\nLucas Systems\nMaven Machines\nMethod Automation Services, Inc.\nPhilips\nPNC\nSchell Games\nSDLC Partners\nSngular\nSynergy Staffing\nTeleTracking Technologies\nUniversity of Pittsburgh\n\nRegister here:\nhttps://www.careereco.com/Fair/EventDetails?fairId=e8776210-422b-4dc8-907e-aba0013a3df1"
  },
  "https://cmu.joinhandshake.com/events/495749": {
    "name": "*Nurture Your Mental Health During Your Job Search",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "24:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/j/96335602381?pwd=Z3BSQjRhcjJUWUNibGlsd0lQR0lVZz09",
    "description": "Learn how to care for your mental health while looking for jobs in this changing career landscape with Jeff Beyer and Dareen Basma, psychotherapists from CMU’s Counseling and Psychological Services (CaPS) and Amy Tavares, the Disability Resources Intern from the Career and Professional Development Center (CPDC). \n\nHave questions related to mental health and the job search? Submit them here: https://forms.gle/Sw6LCRdGuj4WXxZd8"
  },
  "https://cmu.joinhandshake.com/events/489545": {
    "name": "2020 FUTURE NOW Media & Entertainment Conference",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-29",
        "start_time": "24:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://www.futurenowconference.com/",
    "description": "APPLY NOW: http://www.futurenowconference.com/the-conference\n\nFUTURE NOW Media &amp; Entertainment Conference is the first conference of its kind, bringing unprecedented access and opportunity for leaders on the forefront of the industry and top college and graduate students to connect, learn, and grow together!\n\nThe industry’s most influential leaders, senior executives and professionals share insights about the broadcast, cable and digital media businesses along with the latest trends and emerging technologies. Through keynotes, panel discussions, workshops and intimate mentoring sessions, media professionals share about how to succeed in the industry and the range of possible job opportunities.\n\nThis is a rare and incredible learning and networking opportunity for students to make meaningful connections that will better prepare and position them to pursue their careers upon graduation.\n\nThe application materials of those accepted to attend the conference are included in a TALENT RESOURCE PORTFOLIO that FUTURE NOW provides to sponsors and executives in attendance as a resource to help fill internship and job openings. This is not a guarantee for a job, but it is a great opportunity for students to get noticed by companies present at the conference and not get lost in an online abyss!"
  },
  "https://cmu.joinhandshake.com/events/428110": {
    "name": "Learn2Lead - Crowe Summer Leadership Program",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-28",
        "start_time": "24:00:00",
        "end_time": "16:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "No location",
    "description": "Firm Overview\nVisit Crowecareers.com and find out what it's like to work at one of the “50 Best Workplaces for New College Graduates.” Crowe ranked seventh on this 2016 Fortune list and was highly rated in survey feedback.\nCrowe LLP (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.\nCrowe Seeks Leaders | Summer Leadership Program, Learn2Lead (L2L)\nAre you currently considering career options in public accounting, consulting, or technology? Would you like to enhance your leadership &amp; team work skills while enriching your career knowledge &amp; possibly finding a future internship? Do you like meeting &amp; networking with professionals &amp; fellow students from top universities/colleges in the US? Are you interested in what a national top public accounting, consulting, &amp; technology firm can offer you? \nL2L is designed to provide leading students from select universities and colleges, the opportunity to learn more about Crowe’s core values, energizing culture, and our client services. While having fun and developing yourself professionally, programming may include team building exercises, leadership presentations, and/or professional business skill workshops. These activities are aimed at educating you on the leadership qualities needed to excel in the consulting arena.\nInternship Opportunities Following the L2L Program\nAttend L2L and you will also be considered for future opportunities with Crowe including 2021 internships. You will have the opportunity to work with clients to help determine their business needs, along with assisting companies in defining, designing, developing, and implementing business and technology solutions that provide critical value to their organization. \nL2L Key Requirements\n\n•\tSeeking a degree in one of the following preferred majors or similar background: \no\tAccounting\n-      Computer Science / Computer Engineering (or related major)\no\tInformation Systems (or related major)\no\tInformatics (or related major)\no\tSupply Chain Mgmt., Operations (or related major)\no\tFinance, Business Administration, Economics (or related major)\n\n•\tMinimum GPA of 3.2 required.  Minimum GPA of 3.4 preferred. \n•\tCurrent Freshman, Sophomore or Junior \n•\tPermanent resident and/or U.S. Citizen."
  },
  "https://cmu.joinhandshake.com/events/501525": {
    "name": "Brooke Charter Schools Associate Teacher Virtual Information Session",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "15:45:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you ready to launch your career as a teacher at one of the top-performing schools in Boston? Join us for a virtual information session about our Associate Teacher Program, a salaried, school-based teacher preparation program that empowers corps members to become successful lead teachers in just one year. You will hear from the Associate Teacher Program Manager and current Associate Teachers about school culture, the structure of the program, mentorship and professional development, compensation, and more!\n\nOnce you RSVP, we will message you a Zoom link to access the event."
  },
  "https://cmu.joinhandshake.com/events/490683": {
    "name": "City Year Virtual Info Session (East Region)",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "16:30:00",
        "end_time": "17:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you still deciding on the career path you want to take? Interested in taking a gap year before going back to school or jumping into a full-time career? Do you desire to make a difference? If so, join us to learn more about post-grad service opportunities as a City Year AmeriCorps member. You will learn more about our full-time work as Student Success Coaches in high-need schools, get clarity around the benefits package, and gain knowledge about the application process.\n\nYou will need a password to join the virtual event. Please register using the external link provided. \nOur final application deadline for the positions starting in July/August 2020 is Friday, May 29th. Please reach out with any questions you may have!\n\nCan't make this session, but want to learn more?  Contact Dawn Lastowka at dlastowka@cityyear.org to be connected with a City Year recruiter."
  },
  "https://cmu.joinhandshake.com/events/432073": {
    "name": "2020 FUTURE NOW Media & Entertainment Conference",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-29",
        "start_time": "18:30:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=3%20Spruce%20Street,%20New%20York%20City,%20New%20York%2010038,%20United%20States%20of%20America",
    "description": "APPLY NOW: http://www.futurenowconference.com/the-conference\n\nFUTURE NOW Media &amp; Entertainment Conference is the first conference of its kind, bringing unprecedented access and opportunity for leaders on the forefront of the industry and top college and graduate students to connect, learn, and grow together!\n\nThe industry’s most influential leaders, senior executives and professionals share insights about the broadcast, cable and digital media businesses along with the latest trends and emerging technologies. Through keynotes, panel discussions, workshops and intimate mentoring sessions, media professionals share about how to succeed in the industry and the range of possible job opportunities.\n\nThis is a rare and incredible learning and networking opportunity for students to make meaningful connections that will better prepare and position them to pursue their careers upon graduation.\n\nThe application materials of those accepted to attend the conference are included in a TALENT RESOURCE PORTFOLIO that FUTURE NOW provides to sponsors and executives in attendance as a resource to help fill internship and job openings. This is not a guarantee for a job, but it is a great opportunity for students to get noticed by companies present at the conference and not get lost in an online abyss!"
  },
  "https://cmu.joinhandshake.com/career_fairs/15789": {
    "name": "VIRTUAL EVENT: Carnegie Mellon University Alumni Virtual Career Fair 2020",
    "dates": [
      {
        "start_date": "2020-05-28",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=Virtual%20Career%20Fair%20Using%20Brazen",
    "description": "Are you still looking for a full-time job? Not to worry! The Carnegie Mellon University Alumni Virtual Career Fairis an opportunity to connect with employers who are hiring for all roles.  This is the first time we have held a virtual career fair for the CMU Alumni population so you will not want to miss out!Ifyouareacurrentstudentyoumayattendthisfairifyouaregraduatingin May/August2020.\nTo register for this event please visit: https://app.brazenconnect.com/a/cmu_career/e/48R1M\nThe CMU Alumni Virtual Career Fair occurs on May 28 from 1:00pm - 3:00pm EDT.  Please note the following reminders and instructions for the event. We will be using the platform Brazen for the virtual fair. https://app.brazenconnect.com/a/cmu_career/e/48R1M\n1) Before the event starts, log-in to Brazen to update your registration page if you haven’t already (top-right corner under your name). This registration page will allow you to add a resume and other key information for employers to view. To participate, you can log in with the same link to begin. https://app.brazenconnect.com/a/cmu_career/e/48R1M\n2) Chats with employers have been set to 12 minutes. This time goes quickly, so I recommend brainstorming a few main takeaways that you would hope to capture/share before the time expires (i.e., contact information, job titles, next-step instructions, etc.) These are text-based chats – not video chats.\n4) Click hereand scroll down to watch a video on what to expect."
  },
  "https://cmu.joinhandshake.com/events/501850": {
    "name": "Data Jamming Session 2",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "As a follow up to the session on Analytics and Insights with focus on data, we are coming back to host a Data Jamming Session. \n\nThis is the second session in our Data jamming series! We will be going over the data collections from students from our first session and discussing insights and predictions!"
  },
  "https://cmu.joinhandshake.com/events/486086": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-06-08",
        "end_date": "n/a",
        "start_time": "09:00:00",
        "end_time": "10:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/"
  },
  "https://cmu.joinhandshake.com/events/496155": {
    "name": "Quantitative Investment Careers at Fidelity",
    "dates": [
      {
        "start_date": "2020-06-18",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "17:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "NOTE: Please register through the external link, not just Handshake.  If you do not register through the external link, you will not receive the webinar link.\nhttps://www.applytracking.com/tp/rj6-HrUym-I_K\n\nThis event will give students the opportunity to learn about our Quantitative Research and Data Analytics divisions within our Asset Management business.  \n\nBy joining this event, you will get a chance to learn more about Fidelity, Asset Management, and a deep-dive into Quant careers.  Representatives from each of our main Quant and Data Analytics groups will be joining for a moderated career panel discussion.  You will have the opportunity to ask questions, hear about their career paths, gain insights about getting into the field, and discover how Quant Research works at Fidelity!\n\nThe event will feature members of the following teams: \n• Advanced Data Analytics\n• Equity Quantitative Research\n• Fixed Income Quantitative Research\n• Global Asset Allocation Quantitative Research\n• Strategic Advisers Quantitative Research\n\nThe last 30 minutes of the session will be dedicated to discussing full-time and internship opportunities for 2021.\n\nNote: we have finalized recruiting for our Summer 2020 season and will not be discussing opportunities for this summer."
  },
  "https://cmu.joinhandshake.com/events/445930": {
    "name": "BCG Full-Time Opportunities Coffee Chats [Screened Event]",
    "dates": [
      {
        "start_date": "2020-06-19",
        "end_date": "n/a",
        "start_time": "09:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "CPDC - Interview Center (Cohon Center, LL), CPDC Conference Room, Cohon Center - Lower Level, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "Note: this is a screened event - we will require an updated CV. Once selected, you will be provided with additional information to sign up for a specific time slot. \n\nChat with a BCG consultant in a small group setting to learn more about consulting. Bring questions and submit your resume upon registration. Note that office hours are a non-evaluative opportunity to get to know BCG - a great way to explore if consulting is a good fit for you. Prior to office hours, you will receive an email confirming your time slot and sharing meeting location details. Please note this event is targeted at PhD, MD, JD, and postdoctoral candidates. Separate recruiting events are held for undergraduate and masters students."
  },
  "https://cmu.joinhandshake.com/events/497648": {
    "name": "NNSA Graduate Fellowship Program (NGFP)",
    "dates": [
      {
        "start_date": "2020-06-24",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "https://pnnl.zoom.us/webinar/register/WN_AUPVfZS2TYewdeaFki8XiQ",
    "description": "Register in advance for this webinar: https://pnnl.zoom.us/webinar/register/WN_AUPVfZS2TYewdeaFki8XiQ  \nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer: \n• Hands-on experience in national security and nonproliferation; \n• Career development, professional networking, and specialized training events; and \n• Extensive interaction and collaboration with leading national security technology and policy experts.\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021."
  },
  "https://cmu.joinhandshake.com/events/486087": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-07-15",
        "end_date": "n/a",
        "start_time": "24:30:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/"
  },
  "https://cmu.joinhandshake.com/events/492348": {
    "name": "MTR Virtual Visit",
    "dates": [
      {
        "start_date": "2020-07-30",
        "end_date": "n/a",
        "start_time": "14:15:00",
        "end_time": "15:15:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "- A one-hour webinar-style virtual visit for prospective residency applicants.\n - Explore MTR’s mission of equal education and residency model of teacher training\n - Hear from MTR  leadership and current participants\n - Ask questions"
  }
}