{
  "https://cmu.joinhandshake.com/events/529909?ref=events-search": {
    "name": "JPMC Commercial Banking Deep Dive Information Session",
    "dates": [
      {
        "start_date": "2020-08-14",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "JPMorgan Chase &amp; Co.'s Commercial Bank will be hosting a Virtual Information Session on August 14th!  This event is targeted towards students who are interested in opportunities in the Commercial Bank. \n\nOn Friday, August 14th, JPMorgan Chase &amp; Co.’s Commercial Banking Sector will be hosting a Deep Dive for students interested in 2021 summer internship opportunities! \n\nAt the Commercial Banking Deep Dive you will, \n-Virtually “meet” and talk with JPMorgan Chase &amp; Co. employees and leaders about their experiences \n-Hear about Corporate Client Banking, Middle Market Banking and Commercial Real Estate\n-Discover what it’s like to work with us\n-Learn about the 2021 summer application process through a Q&amp;A Session with Commercial Banking Campus Recruiters\n\nEvent: JPMC Commercial Banking Deep Dive Session\nDate: August 14, 2020\nTime: 12:00pm-3:00pm ET\nRegistration: http://tinyurl.com/yyec8jl5\n\n*In order to be considered, you must register using the link above*",
    "type": "1",
    "event_id": "n/a"
  },
  "https://cmu.joinhandshake.com/career_fairs/17781?ref=events-search": {
    "name": "Heinz College Public Service Fair 2020",
    "dates": [
      {
        "start_date": "2020-09-2",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Heinz College Public Service Fair\nThe Public Service Fair is an opportunity for Heinz students to find local non-profit and government organizations to find remote intern, work study, or volunteer positions during the fall and spring semesters. Many organizations in attendance hire through the paid Federal Community Service Work Study program. Others provide excellent volunteer opportunities. This is a great opportunity to find meaningful practical experience that you can add to your resume.\n*Federal Community Service Work Study program is only open to US Citizens*\nA representative from each organization will be available to discuss internship and volunteer opportunities with their organization. It is possible to find a position, or at the very least network with organizations you find interesting. Even though all these organizations are in the non-profit/government sectors, they need a wide range of Heinz talent including: project management, marketing, outreach, development, IT and policy analysts.\nPlease note the following reminders and instructions for the event.We will be using Handshake for the virtual fair and it will allow you to browse 1:1 and group meetings with over ​numerous employers. \nHere are some resources to help you get started:   ● How to register for virtual career fair sessions in Handshake  ● Handshake’s Guide to Success at Virtual Career Fairs \n\n\n",
    "type": "general",
    "event_id": "n/a"
  },
  "https://cmu.joinhandshake.com/career_fairs/16126?ref=events-search": {
    "name": "Technical Opportunities Conference + Encompass + Converge Virtual Career Fair 2020",
    "dates": [
      {
        "start_date": "2020-09-14",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "21:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "REGISTRATION IS AVAILABLE USING THE CAREERECO PLATFORM - SEE THE LINKS BELOW\nThe Technical Opportunities Conference + Encompass + Converge Virtual Career Fair 2020 will take place from Monday, September 14th through Wednesday, September 16th from 1:00 pm - 9:00pm EDT.  \nThe fall 2020 virtual career fair is open to all Carnegie Mellon University undergraduate and graduate students of all majors and locations, who are pursuing full-time opportunities and internships. The virtual fair will also be open to recent alumni who have graduated from December 2019-August 2020. \nThe Virtual Career Fair will be hosted on the platform, \"CareerEco\" please create an account using your Andrew email and register for each day of the virtual fair using the links below:\nRegister Here:Day 1: https://www.careereco.com/Events/CMU-Sept14\nDay 2: https://www.careereco.com/Events/CMU-Sept15\nDay 3: https://www.careereco.com/Events/CMU-Sept16\nWe understand that participating in a virtual recruiting environment will be different than participating in person, but this joint virtual career fair will also present our students with new opportunities, such as:\n● Uploading resumes into the virtual platform in advance to give employers more time to review your qualifications, which increases your opportunity to stand out.● Checking the CareerEco platform ahead of time to more efficiently and effectively identify the employers that are the best fit for you, which allows you to easily identify the most important details you need to know.● Accessing more companies than could traditionally be accommodated in-person, which means more opportunities will be available to you in a broader array of majors.● No waiting in line, which gives you the ability to talk to more employers and provides more flexibility to easily come and go.Lastly, the CPDC will be providingmoreinformationonhowtoprepforthevirtualcareerfair aswell asotherhelpful information asitgetsclosertotheevent.We are excited about this fall’s recruiting and look forward to your participation!Learn more about CareerEco (Virtual Fair Platform):Virtual Event Tutorial PDFVirtual Event Tutorial VideoQuestions?\nPittsburgh Campus Students/Recent Alumni: career@andrew.cmu.eduSilicon Valley Campus Students/Recent Alumni: lauren.schachar@sv.cmu.edu",
    "type": "general",
    "event_id": "n/a"
  },
  "https://cmu.joinhandshake.com/career_fairs/15153?ref=events-search": {
    "name": "VIRTUAL EVENT: Tepper Meetup 2020 - A Networking Event for Employers and Tepper Undergraduates",
    "dates": [
      {
        "start_date": "2020-09-21",
        "end_date": "n/a",
        "start_time": "17:30:00",
        "end_time": "19:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Tepper Meetup 2020A Virtual Networking Event for Employers and Tepper Undergraduates Tepper Meetup is open to employers who are interested in networking with business administration and economics sophomores, juniors and seniors in a virtual setting. The event will take place on September 21 from 5:30 p.m. to 7:30 p.m.",
    "type": "general",
    "event_id": "n/a"
  },
  "https://cmu.joinhandshake.com/career_fairs/15181?ref=events-search": {
    "name": "VIRTUAL EVENT:  Spark - Startups and Emerging Companies 2020",
    "dates": [
      {
        "start_date": "2020-10-21",
        "end_date": "n/a",
        "start_time": "12:30:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Virtual Event: SPARK 2020\nWednesday, October 2112:30 p.m. - 4:00 p.m.\n",
    "type": "general",
    "event_id": "n/a"
  }
}