{
  "https://cmu.joinhandshake.com/events/476377": {
    "name": "Diversity & Inclusion Webinar Series",
    "dates": [
      {
        "start_date": "2020-04-06",
        "end_date": "2020-08-26",
        "start_time": "12:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "The McKinsey Black Network and Hispanic &amp; Latino Network are hosting a series of webinars to provide virtual opportunities to learn more about who we are as a firm and what we do. You will have the opportunity to get to know consultants and recruiters in each of our regions and our practices. Follow the link below to register for a session!\"\n\nRegister for our upcoming webinar series here - https://www.surveys.online/jfe/form/SV_cCHsmIwtymzeSFv",
    "type": "2",
    "event_id": "l72apgl0o1bhud756d7gu3ckl0"
  },
  "https://cmu.joinhandshake.com/events/488170": {
    "name": "IBM Call for Code University Edition",
    "dates": [
      {
        "start_date": "2020-04-22",
        "end_date": "2020-07-31",
        "start_time": "12:00:00",
        "end_time": "23:55:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://callforcode.org/",
    "description": "Now in its third year, the Call for Code Global Challenge is a multi-year global initiative that rallies developers, visionaries, and problem solvers to create practical, effective, and high-quality applications based on cloud, data, and artificial intelligence that can have an immediate and lasting impact on humanitarian issues. Call for Code brings start-up, academic, community, and enterprise developers together and inspires them to solve the most pressing societal issues of our time.\n\nThis year’s Call for Code Challenge has been expanded to two tracks in order to tackle two life-altering world problems: COVID-19 and climate change. These issues have the power to compromise our health, our planet and our survival - and need to be addressed now. More information about this year’s challenge can be found on the Challenge homepage: https://callforcode.org/\n\nAdditionally, in partnership with the Clinton Global Initiative University (CGI U), we are launching the inaugural University Edition of the 2020 Call for Code Global Challenge. This will activate student developers, like you, to tackle these world problems. Through a series of virtual hackathons, workshops and other learning opportunities, you will be enabled with the skills necessary to work as a team and create solutions to these issues.\n\nThe 2020 Call for Code Global Challenge - University Edition will kick-off on Earth Day, April 22, with a virtual introduction by IBM’s Chief Developer Advocate and GM Willie Tejada and a special guest speaker to be revealed soon! Following the session, which will include a Q&amp;A, our developer advocates will host workshops to get you started on your projects.\n\nStay tuned in the Slack Workspace (add the #University channel) for information on upcoming virtual hackathons, enablement sessions, office hours and more!\n\nWe will be supporting you every step of the way. From helping you construct a team, to ideation sessions. From roadblocks in your project, to how to present what you’ve created. For any problem you run into, there will be an IBMer excited to work through it with you.\n\nYou are the future, and we hope you will join us by answering the call to make a brighter tomorrow for our planet. There has never been a more important time than right now to use technology for good.\n\n\nHere are some helpful links to get you started!\nApril 22 Event Registration link:\nhttps://cgiu.cgiforms.org/view.php?id=141342\n\nHelpful COVID Code Patterns\nhttps://github.ibm.com/spackows/AI-ContentOps/tree/master/COVID-19\n\nSlack info\nwww.callforcode.org/slack - Please add the #University channel\n\nCOVID Starter Kits:\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Cooperation-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Communication-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Education-2020\n\nClimate Change Starter Kits:\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Energy-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Disasters-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Water-2020\n\nProject Sample:\nhttps://github.com/Code-and-Response/Project-Sample",
    "type": "5",
    "event_id": "vvpdrrm9uo1h74urmu8kt4oo0s"
  },
  "https://cmu.joinhandshake.com/events/490035": {
    "name": "Translational Biomedical Research Management M.S. - graduate program info session",
    "dates": [
      {
        "start_date": "2020-04-23",
        "end_date": "2020-05-31",
        "start_time": "18:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://hartwick.zoom.us/j/969511403",
    "description": "We are recruiting for our Master's in Translational Biomedical Research Management!\nJoin our virtual info sessions on Tue/Wed/Thu (6-7pm EST) every week between April 23rd and May 31st, 2020. Connect online through the video URL provided above or dial 1(646)558-8656 to join the event by phone; use meeting ID 969511403 when prompted.\nDon't hesitate to ask any questions about our graduate admission process at Hartwick - Let's talk!\nVisit us online anytime: www.hartwick.edu/moveintomanagement",
    "type": "4",
    "event_id": "4v0u7amqdqamp54ok80fdiet18"
  },
  "https://cmu.joinhandshake.com/events/493084": {
    "name": "McKinsey & Company: Our very first EEMA Hackathon: PROHACK",
    "dates": [
      {
        "start_date": "2020-04-27",
        "end_date": "2020-06-21",
        "start_time": "12:00:00",
        "end_time": "23:55:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "McKinsey &amp; Company are excited to announce that registration is open for PROHACK, our very first online EEMA hackathon for data scientists across CIS, the Middle East, Turkey, Pakistan and Africa. Participants can work independently or in teams of up to 4 to develop efficient business solutions using data science, and the top 20 teams will share a $25,000 prize!\n \nThe task details and dataset will be available May 18, and the deadline to upload solutions is June 21. Please note that anyone can join before the last day (June 21) to PROHACK! Registrations are now open at http://prohack.org with easy sign up – no applications and no resume screenings! \n\nShare in your personal LinkedIn and social media accounts: \nLinkedIn: https://www.linkedin.com/feed/update/urn:li:activity:6661229957630476288/\nFacebook: https://www.facebook.com/reallifeatmckinsey/videos/233139794455878/",
    "type": "5",
    "event_id": "qfq9rheo6ru5f7ld9chaq2kd5g"
  },
  "https://cmu.joinhandshake.com/events/505570": {
    "name": "Yelping From Home: The Tech Talk Series",
    "dates": [
      {
        "start_date": "2020-05-26",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "***RSVP via Eventbrite (https://bit.ly/2LOQtdw)***\n\nYelp’s mission is to connect people with great local businesses, and one of the teams working behind the scenes to make that happen is our five star engineering and product teams.\n\nPlaying an active role in our community is a value that we have strongly prioritized over the years. Typically we would invite you to come to Yelp’s HQ to network, grab a slice of ‘za, and learn about the technology and culture behind Yelp. With stay-at-home orders across the globe, Yelp (like many of you) has had no choice but to adapt to these changes. We understand that this is a strange and challenging time for many, so we’d like to invite you to join us as we navigate this new normal for the tech community together. \n\nTo stay connected, create space for folks to collaborate and share some of the things Yelp has been working on, we are launching our very own virtual tech talk series. This series of talks will feature Yelpers from engineering and product and will focus on themes such as career development, technical skills, workplace challenges and Yelp’s response to COVID-19.\n\nJoin us to hear \"Code Review Etiquette\" by Surashree Kulkarni and \"5 Things We Wish We Knew When We Started Working as SWEs\" by Banafsheh Derayat and Vanessa Gutierrez.",
    "type": "5",
    "event_id": "hnfafhp3aohdd1l77586p44888"
  },
  "https://cmu.joinhandshake.com/events/490640": {
    "name": "Virtual HireUp Career Fair Hosted by the Pittsburgh Technology Council",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://www.careereco.com/Fair/EventDetails?fairId=e8776210-422b-4dc8-907e-aba0013a3df1",
    "description": "Hire Up Virtual Career Fair\nWhat is the Hire UP Virtual Career Fair?\nThe Hire UP Virtual Career Fair provides an opportunity for employers and job seekers to connect and network online. For employers seeking to expand their pipeline of tech talent, the Hire UP event is and time efficient solution to recruitment efforts.  \n\nOur hope is to connect displaced and underemployed regional workers with local companies who are hiring technical/corporate employees. For companies who are not hiring and/or have had layoffs, this could serve as outplacement support for displaced workers. \n\nWHEN: May 27, 2020 | 11 am to 3 pm\nWHERE: Anywhere with an internet connection\n\nWhat type of candidate is invited?\nThe main purpose of the event is for employers to recruit technical talent. Non-technical talent may attend, and employers may post non-technical jobs, however the focus is on tech roles. \n• Candidates seeking Full-time, Part-time, and Internships\n• Recruit graduate and undergraduate talent\n\nCompanies currently scheduled to attend:\nAmazon\nAstrobotic\nCGI\nConnectiveRx\nDollar Bank\nFragomen\nGiant Eagle\nHighmark\nLeidos\nLucas Systems\nMaven Machines\nMethod Automation Services, Inc.\nPhilips\nPNC\nSchell Games\nSDLC Partners\nSngular\nSynergy Staffing\nTeleTracking Technologies\nUniversity of Pittsburgh\n\nRegister here:\nhttps://www.careereco.com/Fair/EventDetails?fairId=e8776210-422b-4dc8-907e-aba0013a3df1",
    "type": "1",
    "event_id": "7icr4e68mp61lgbrhgc5dr43vc"
  },
  "https://cmu.joinhandshake.com/events/495749": {
    "name": "*Nurture Your Mental Health During Your Job Search",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/j/96335602381?pwd=Z3BSQjRhcjJUWUNibGlsd0lQR0lVZz09",
    "description": "Learn how to care for your mental health while looking for jobs in this changing career landscape with Jeff Beyer and Dareen Basma, psychotherapists from CMU’s Counseling and Psychological Services (CaPS) and Amy Tavares, the Disability Resources Intern from the Career and Professional Development Center (CPDC). \n\nHave questions related to mental health and the job search? Submit them here: https://forms.gle/Sw6LCRdGuj4WXxZd8",
    "type": "1",
    "event_id": "c0prfj186d51lm5tb94hnsik4o"
  },
  "https://cmu.joinhandshake.com/events/489545": {
    "name": "2020 FUTURE NOW Media & Entertainment Conference",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-29",
        "start_time": "12:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://www.futurenowconference.com/",
    "description": "APPLY NOW: http://www.futurenowconference.com/the-conference\n\nFUTURE NOW Media &amp; Entertainment Conference is the first conference of its kind, bringing unprecedented access and opportunity for leaders on the forefront of the industry and top college and graduate students to connect, learn, and grow together!\n\nThe industry’s most influential leaders, senior executives and professionals share insights about the broadcast, cable and digital media businesses along with the latest trends and emerging technologies. Through keynotes, panel discussions, workshops and intimate mentoring sessions, media professionals share about how to succeed in the industry and the range of possible job opportunities.\n\nThis is a rare and incredible learning and networking opportunity for students to make meaningful connections that will better prepare and position them to pursue their careers upon graduation.\n\nThe application materials of those accepted to attend the conference are included in a TALENT RESOURCE PORTFOLIO that FUTURE NOW provides to sponsors and executives in attendance as a resource to help fill internship and job openings. This is not a guarantee for a job, but it is a great opportunity for students to get noticed by companies present at the conference and not get lost in an online abyss!",
    "type": "1",
    "event_id": "eko5ttkstk685414d6lic0n5vg"
  },
  "https://cmu.joinhandshake.com/events/428110": {
    "name": "Learn2Lead - Crowe Summer Leadership Program",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-28",
        "start_time": "12:00:00",
        "end_time": "16:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "No location",
    "description": "Firm Overview\nVisit Crowecareers.com and find out what it's like to work at one of the “50 Best Workplaces for New College Graduates.” Crowe ranked seventh on this 2016 Fortune list and was highly rated in survey feedback.\nCrowe LLP (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.\nCrowe Seeks Leaders | Summer Leadership Program, Learn2Lead (L2L)\nAre you currently considering career options in public accounting, consulting, or technology? Would you like to enhance your leadership &amp; team work skills while enriching your career knowledge &amp; possibly finding a future internship? Do you like meeting &amp; networking with professionals &amp; fellow students from top universities/colleges in the US? Are you interested in what a national top public accounting, consulting, &amp; technology firm can offer you? \nL2L is designed to provide leading students from select universities and colleges, the opportunity to learn more about Crowe’s core values, energizing culture, and our client services. While having fun and developing yourself professionally, programming may include team building exercises, leadership presentations, and/or professional business skill workshops. These activities are aimed at educating you on the leadership qualities needed to excel in the consulting arena.\nInternship Opportunities Following the L2L Program\nAttend L2L and you will also be considered for future opportunities with Crowe including 2021 internships. You will have the opportunity to work with clients to help determine their business needs, along with assisting companies in defining, designing, developing, and implementing business and technology solutions that provide critical value to their organization. \nL2L Key Requirements\n\n•\tSeeking a degree in one of the following preferred majors or similar background: \no\tAccounting\n-      Computer Science / Computer Engineering (or related major)\no\tInformation Systems (or related major)\no\tInformatics (or related major)\no\tSupply Chain Mgmt., Operations (or related major)\no\tFinance, Business Administration, Economics (or related major)\n\n•\tMinimum GPA of 3.2 required.  Minimum GPA of 3.4 preferred. \n•\tCurrent Freshman, Sophomore or Junior \n•\tPermanent resident and/or U.S. Citizen.",
    "type": "2",
    "event_id": "viool6klsib5aq671rr2ud83lg"
  },
  "https://cmu.joinhandshake.com/events/501525": {
    "name": "Brooke Charter Schools Associate Teacher Virtual Information Session",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "15:45:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you ready to launch your career as a teacher at one of the top-performing schools in Boston? Join us for a virtual information session about our Associate Teacher Program, a salaried, school-based teacher preparation program that empowers corps members to become successful lead teachers in just one year. You will hear from the Associate Teacher Program Manager and current Associate Teachers about school culture, the structure of the program, mentorship and professional development, compensation, and more!\n\nOnce you RSVP, we will message you a Zoom link to access the event.",
    "type": "1",
    "event_id": "aokbimdqhri611oendlipbcpvc"
  },
  "https://cmu.joinhandshake.com/events/490683": {
    "name": "City Year Virtual Info Session (East Region)",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "16:30:00",
        "end_time": "17:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you still deciding on the career path you want to take? Interested in taking a gap year before going back to school or jumping into a full-time career? Do you desire to make a difference? If so, join us to learn more about post-grad service opportunities as a City Year AmeriCorps member. You will learn more about our full-time work as Student Success Coaches in high-need schools, get clarity around the benefits package, and gain knowledge about the application process.\n\nYou will need a password to join the virtual event. Please register using the external link provided. \nOur final application deadline for the positions starting in July/August 2020 is Friday, May 29th. Please reach out with any questions you may have!\n\nCan't make this session, but want to learn more?  Contact Dawn Lastowka at dlastowka@cityyear.org to be connected with a City Year recruiter.",
    "type": "1",
    "event_id": "gbreikfthf2clgu27kbpmhnb6k"
  },
  "https://cmu.joinhandshake.com/events/503505": {
    "name": "Capital Teaching Residency Webinar",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "17:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Join our webinar to learn more about our teacher certification and preparation program!",
    "type": "1",
    "event_id": "au7634df5jibcr7ob0k4fv8q38"
  },
  "https://cmu.joinhandshake.com/events/432073": {
    "name": "2020 FUTURE NOW Media & Entertainment Conference",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-29",
        "start_time": "18:30:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=3%20Spruce%20Street,%20New%20York%20City,%20New%20York%2010038,%20United%20States%20of%20America",
    "description": "APPLY NOW: http://www.futurenowconference.com/the-conference\n\nFUTURE NOW Media &amp; Entertainment Conference is the first conference of its kind, bringing unprecedented access and opportunity for leaders on the forefront of the industry and top college and graduate students to connect, learn, and grow together!\n\nThe industry’s most influential leaders, senior executives and professionals share insights about the broadcast, cable and digital media businesses along with the latest trends and emerging technologies. Through keynotes, panel discussions, workshops and intimate mentoring sessions, media professionals share about how to succeed in the industry and the range of possible job opportunities.\n\nThis is a rare and incredible learning and networking opportunity for students to make meaningful connections that will better prepare and position them to pursue their careers upon graduation.\n\nThe application materials of those accepted to attend the conference are included in a TALENT RESOURCE PORTFOLIO that FUTURE NOW provides to sponsors and executives in attendance as a resource to help fill internship and job openings. This is not a guarantee for a job, but it is a great opportunity for students to get noticed by companies present at the conference and not get lost in an online abyss!",
    "type": "1",
    "event_id": "41t9v1o7oc39f4e0ocig8r0p2k"
  },
  "https://cmu.joinhandshake.com/career_fairs/15789": {
    "name": "VIRTUAL EVENT: Carnegie Mellon University Alumni Virtual Career Fair 2020",
    "dates": [
      {
        "start_date": "2020-05-28",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=Virtual%20Career%20Fair%20Using%20Brazen",
    "description": "Are you still looking for a full-time job? Not to worry! The Carnegie Mellon University Alumni Virtual Career Fairis an opportunity to connect with employers who are hiring for all roles.  This is the first time we have held a virtual career fair for the CMU Alumni population so you will not want to miss out!Ifyouareacurrentstudentyoumayattendthisfairifyouaregraduatingin May/August2020.\nTo register for this event please visit: https://app.brazenconnect.com/a/cmu_career/e/48R1M\nThe CMU Alumni Virtual Career Fair occurs on May 28 from 1:00pm - 3:00pm EDT.  Please note the following reminders and instructions for the event. We will be using the platform Brazen for the virtual fair. https://app.brazenconnect.com/a/cmu_career/e/48R1M\n1) Before the event starts, log-in to Brazen to update your registration page if you haven’t already (top-right corner under your name). This registration page will allow you to add a resume and other key information for employers to view. To participate, you can log in with the same link to begin. https://app.brazenconnect.com/a/cmu_career/e/48R1M\n2) Chats with employers have been set to 12 minutes. This time goes quickly, so I recommend brainstorming a few main takeaways that you would hope to capture/share before the time expires (i.e., contact information, job titles, next-step instructions, etc.) These are text-based chats – not video chats.\n4) Click hereand scroll down to watch a video on what to expect.",
    "type": "1",
    "event_id": "u3ktkia119r8014k2fr7jthooo"
  },
  "https://cmu.joinhandshake.com/events/503512": {
    "name": "Annapurna Partners(Real estate private equity)- Virtual Info Session with Principal Michael Mogull",
    "dates": [
      {
        "start_date": "2020-05-28",
        "end_date": "n/a",
        "start_time": "17:05:00",
        "end_time": "17:45:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us04web.zoom.us/j/571840640?pwd=SjhWdFovM2V2WFFhYzEwbGEvbnpWUT09",
    "description": "You will Learn:\n\n-How Mr. Mogull initially got into the real estate business and his background in the space over the last two decades.\n-What Mr. Mogull's role is as Managing Principal of a real estate PE firm.\n-What makes Annapurna different in their approach to the real estate private equity space.\n-How to leverage the mentorship offered through our internship academy to compress time frames for career growth as a business leader and real estate professional.\n-You will learn about the various employment opportunities available within our rapidly growing team. Current job opportunities include Acquisitions (Business Development) roles and Annapurna Academy, a 24-month internship/apprenticeship training program.\n-What intrinsic character traits Annapurna looks for when he is recruiting future leaders for the firm.\n-The pros and cons of working for a larger company versus a smaller company at the beginning of your career, and what Mr. Mogull wishes he did differently himself.\n-Why the covid 19 pandemic is not something we see as a long term impediment to our growth.\n\n\n\nAbout US:\nAnnapurna Partners is a private real estate investment, development and management firm. We identify commercial real estate opportunities by taking an entrepreneurial approach to create stakeholder value. Our strategies are opportunistic, focusing on building value and mitigating risk, while leveraging relationships with our large network of strategic sponsors and advisors throughout the United States. This team identifies, analyzes, develops, and operates investments from start to finish. Based in Fort Lauderdale, Annapurna Partners employs a strong team of corporate, financial, and operational and construction professionals.\n\nTo learn more please visit www.annapurnapartners.com",
    "type": "2",
    "event_id": "7idfblkbgiq81a89nncmtfui28"
  },
  "https://cmu.joinhandshake.com/events/501850": {
    "name": "TCS Analytics & Insights ‘data brew & data jam’ session 2",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "As a follow up to the session on Analytics and Insights with focus on data, we are coming back to host a Data Jamming Session. \n\nThis is the second session in our Data jamming series! We will be going over the data collections from students from our first session and discussing insights and predictions!",
    "type": "5",
    "event_id": "mibr3daiocuiqptpbm7cvbe40s"
  },
  "https://cmu.joinhandshake.com/events/502224": {
    "name": "City Year Philly Ask-Me-Anything with Dominique Medler",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://bit.ly/CYPMayteams",
    "description": "Philly! Philly! Drop in and chat with me! Ask the questions you need answered to help you submit a strong application and prepare for your candidacy.  Everything is on the table from the challenges you'll face as a City Year AmeriCorps member to the impact you'll have on students' lives, and the lifelong friendships you'll make serving alongside your peers. And for those that don't live in Philly, we can chat about what it's like to live in Philly.\n\nPlease use the external registration link to ensure communication leading up to and after the event.",
    "type": "1",
    "event_id": "vjqlvbejcqei1jfhdn5dph659o"
  },
  "https://cmu.joinhandshake.com/events/501941": {
    "name": "Day in the Life of a Habitat AmeriCorps Member",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Join our virtual event – “A day in the life of an AmeriCorps member” – where you can learn more about Habitat AmeriCorps service opportunities, benefits to service and how to apply.",
    "type": "1",
    "event_id": "rfsr4bj3073vo5kjtdkr6bogbo"
  },
  "https://cmu.joinhandshake.com/events/502169": {
    "name": "2020 Morgan Stanley Asia Webinar Series: Introduction to Sales & Trading",
    "dates": [
      {
        "start_date": "2020-06-01",
        "end_date": "n/a",
        "start_time": "19:00:00",
        "end_time": "21:00:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "In this webinar, you will learn about:\n- Introduction to Morgan Stanley Asia and the work we do\n- Discuss the advantages and unique career opportunities the banking industry presents\n- Gain insight into the day-to-day life of our business representatives and their roles at the firm\n- Learn more about our 2021 internship opportunities across various business units\n- Live Q&amp;A with our business representatives and campus recruiters\n- Learn about our upcoming virtual events",
    "type": "2",
    "event_id": "oig7c72kg3i1tbgg0k42qdl1ro"
  },
  "https://cmu.joinhandshake.com/events/503602": {
    "name": "NNSA Graduate Fellowship Program Virtual Information Session June 2, 2020",
    "dates": [
      {
        "start_date": "2020-06-02",
        "end_date": "n/a",
        "start_time": "16:30:00",
        "end_time": "17:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "https://pnnl.zoom.us/webinar/register/WN_4Sehe2IYSqqNilUOa18iAg",
    "description": "Register in advance for this webinar:\nhttps://pnnl.zoom.us/webinar/register/WN_4Sehe2IYSqqNilUOa18iAg \n\nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer:\n• Hands-on experience in national security and nonproliferation;\n• Career development, professional networking, and specialized training events; and\n• Extensive interaction and collaboration with leading national security technology and policy experts.\n\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021.",
    "type": "4",
    "event_id": "ov7dnuiaes8jmh3tqo9cjn0l68"
  },
  "https://cmu.joinhandshake.com/events/504362": {
    "name": "Adapt and Rise: Building resilience for businesses & people in times of uncertainty",
    "dates": [
      {
        "start_date": "2020-06-03",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "In these extraordinary times, companies across the globe are facing unexpected challenges. To tackle these challenges, while also building resilience and protecting business continuity, governments and companies must make big decisions – and make them fast!\n\nJoin us for an interactive session on how Genpact is combining human intelligence and data-driven augmented intelligence to help businesses adapt and rise today!",
    "type": "2",
    "event_id": "63193v687973j11qejfkftv6go"
  },
  "https://cmu.joinhandshake.com/events/486086": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-06-08",
        "end_date": "n/a",
        "start_time": "09:00:00",
        "end_time": "10:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/",
    "type": "1",
    "event_id": "6jhqf00vk6cahar1gi370nq5hs"
  },
  "https://cmu.joinhandshake.com/events/503707": {
    "name": "PDT Partners | Demystifying Tech Careers in Quantitative Finance",
    "dates": [
      {
        "start_date": "2020-06-17",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Thinking about a career in tech, but never considered a path in quantitative finance?  \n\nDuring our 1-hour Zoom webinar, a panel of current PDT Partners technologists will talk about their career paths that led them to our firm, projects they’re currently working on, and commonly asked questions they've received from people outside the quantitative finance industry. We’ll also be giving a brief overview of the different groups within our technology organization. \n\nA career in quant finance shouldn’t feel out of reach. Our engineers come from a wide variety of backgrounds, ranging from startups and big tech, to well-known financial institutions.  We’re always looking for growth-minded individuals from any industry who love digging into data-driven problems. \n\nWe’ll have the chat open during the webinar for you to ask our panelists questions, but we kindly ask you to submit questions when you register about specific topics you’re curious about.  \n\nSpeakers:\nRob Morse - Head of Data Strategy and Sourcing\nIslay Symonette - Software Engineer\nDhrupad Bhardwaj - Software Engineer\nAndy Lei - Software Engineer\nJingyuan Wang - Intern 2019, incoming Software Engineer 2020\n\nPlease register using the Non-Handshake Registration URL to receive the Zoom link.\n\nWe look forward to seeing you virtually on June 17th. Please feel free to invite friends!",
    "type": "5",
    "event_id": "ebmnnii0c13l8d9mf8g46i5q4c"
  },
  "https://cmu.joinhandshake.com/events/496155": {
    "name": "Quantitative Investment Careers at Fidelity",
    "dates": [
      {
        "start_date": "2020-06-18",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "17:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "NOTE: Please register through the external link, not just Handshake.  If you do not register through the external link, you will not receive the webinar link.\nhttps://www.applytracking.com/tp/rj6-HrUym-I_K\n\nThis event will give students the opportunity to learn about our Quantitative Research and Data Analytics divisions within our Asset Management business.  \n\nBy joining this event, you will get a chance to learn more about Fidelity, Asset Management, and a deep-dive into Quant careers.  Representatives from each of our main Quant and Data Analytics groups will be joining for a moderated career panel discussion.  You will have the opportunity to ask questions, hear about their career paths, gain insights about getting into the field, and discover how Quant Research works at Fidelity!\n\nThe event will feature members of the following teams: \n• Advanced Data Analytics\n• Equity Quantitative Research\n• Fixed Income Quantitative Research\n• Global Asset Allocation Quantitative Research\n• Strategic Advisers Quantitative Research\n\nThe last 30 minutes of the session will be dedicated to discussing full-time and internship opportunities for 2021.\n\nNote: we have finalized recruiting for our Summer 2020 season and will not be discussing opportunities for this summer.",
    "type": "2",
    "event_id": "66kd1r83ie2kqfpmp1tsgrstn4"
  },
  "https://cmu.joinhandshake.com/events/503607": {
    "name": "Meet McKinsey Middle East office",
    "dates": [
      {
        "start_date": "2020-06-21",
        "end_date": "n/a",
        "start_time": "11:30:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Meet McKinsey Middle East office\nThree colleagues sharing their journeys from one office. Join us on 21 June 2020 at 11:30 EST for a 1 hour presentation inspired by the impact our practices are having in the region.\nMaybe you will discover McKinsey is a place for you, too.\n\nThe session is open to candidates currently based in North America graduating in 2021 with a Masters or PhD.\nRegister by 14 June using the following link:\nhttp://www.mckinsey.com/MEOAPDWebinar2020\n\n#McKCareers #McKMiddleEast",
    "type": "2",
    "event_id": "cminmadq6g0a2p1mkfjd89capo"
  },
  "https://cmu.joinhandshake.com/events/497648": {
    "name": "NNSA Graduate Fellowship Program (NGFP) Virtual Information Session June 24, 2020",
    "dates": [
      {
        "start_date": "2020-06-24",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://pnnl.zoom.us/webinar/register/WN_AUPVfZS2TYewdeaFki8XiQ",
    "description": "Register in advance for this webinar: https://pnnl.zoom.us/webinar/register/WN_AUPVfZS2TYewdeaFki8XiQ  \nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer: \n• Hands-on experience in national security and nonproliferation; \n• Career development, professional networking, and specialized training events; and \n• Extensive interaction and collaboration with leading national security technology and policy experts.\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021.",
    "type": "4",
    "event_id": "udpmsjeq88fbuce8p8l5usiu94"
  },
  "https://cmu.joinhandshake.com/events/486087": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-07-15",
        "end_date": "n/a",
        "start_time": "12:30:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/",
    "type": "1",
    "event_id": "rjc6tjnls3r06pi8v1ten2cbso"
  },
  "https://cmu.joinhandshake.com/events/504712": {
    "name": "*Considering Applying to Graduate School for a PhD?",
    "dates": [
      {
        "start_date": "2020-07-22",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJUkd-ihpjwtGN1yogVMDR7E6J5xLY1nfU-U",
    "description": "Have you been thinking of continuing your education further?\nLearn how to research PhD programs, network with alumni and advisors to explore programs and find the right ones for you.\nLearn how to appropriately tailor your Statement of Purpose (SoP), receive an overview of how faculty read these documents and how to tailor your documents for each program.\nReceive an introduction and demo to the OLI course “Statement of Purpose.”\nLearn how to schedule appointments with a GCC advisor, a CPDC advisor, and learn where helpful resources are located on the GCC and CPDC websites.\n\nRegistration is required, to register for the Workshop in Zoom use the link below- PLEASE USE YOUR CMU ANDREW EMAIL:\nhttps://cmu.zoom.us/meeting/register/tJUkd-ihpjwtGN1yogVMDR7E6J5xLY1nfU-U\n\nAfter registering, you will receive a confirmation email containing information about joining the workshop. To log in to the session on the day of the event, follow this link: https://cmu.zoom.us/j/91901987729",
    "type": "1",
    "event_id": "eqsa5kocj6a6jph6c9lmr21k7k"
  },
  "https://cmu.joinhandshake.com/events/492348": {
    "name": "MTR Virtual Visit",
    "dates": [
      {
        "start_date": "2020-07-30",
        "end_date": "n/a",
        "start_time": "14:15:00",
        "end_time": "15:15:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "- A one-hour webinar-style virtual visit for prospective residency applicants.\n - Explore MTR’s mission of equal education and residency model of teacher training\n - Hear from MTR  leadership and current participants\n - Ask questions",
    "type": "1",
    "event_id": "o7etet66i4lgv0h8uj5pbi1858"
  }
}