{
  "https://cmu.joinhandshake.com/events/476377": {
    "name": "Diversity & Inclusion Webinar Series",
    "dates": [
      {
        "start_date": "2020-04-06",
        "end_date": "2020-08-26",
        "start_time": "12:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "The McKinsey Black Network and Hispanic &amp; Latino Network are hosting a series of webinars to provide virtual opportunities to learn more about who we are as a firm and what we do. You will have the opportunity to get to know consultants and recruiters in each of our regions and our practices. Follow the link below to register for a session!\"\n\nRegister for our upcoming webinar series here - https://www.surveys.online/jfe/form/SV_cCHsmIwtymzeSFv",
    "type": "2",
    "event_id": "l72apgl0o1bhud756d7gu3ckl0"
  },
  "https://cmu.joinhandshake.com/events/488170": {
    "name": "IBM Call for Code University Edition",
    "dates": [
      {
        "start_date": "2020-04-22",
        "end_date": "2020-07-31",
        "start_time": "12:00:00",
        "end_time": "23:55:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://callforcode.org/",
    "description": "Now in its third year, the Call for Code Global Challenge is a multi-year global initiative that rallies developers, visionaries, and problem solvers to create practical, effective, and high-quality applications based on cloud, data, and artificial intelligence that can have an immediate and lasting impact on humanitarian issues. Call for Code brings start-up, academic, community, and enterprise developers together and inspires them to solve the most pressing societal issues of our time.\n\nThis year’s Call for Code Challenge has been expanded to two tracks in order to tackle two life-altering world problems: COVID-19 and climate change. These issues have the power to compromise our health, our planet and our survival - and need to be addressed now. More information about this year’s challenge can be found on the Challenge homepage: https://callforcode.org/\n\nAdditionally, in partnership with the Clinton Global Initiative University (CGI U), we are launching the inaugural University Edition of the 2020 Call for Code Global Challenge. This will activate student developers, like you, to tackle these world problems. Through a series of virtual hackathons, workshops and other learning opportunities, you will be enabled with the skills necessary to work as a team and create solutions to these issues.\n\nThe 2020 Call for Code Global Challenge - University Edition will kick-off on Earth Day, April 22, with a virtual introduction by IBM’s Chief Developer Advocate and GM Willie Tejada and a special guest speaker to be revealed soon! Following the session, which will include a Q&amp;A, our developer advocates will host workshops to get you started on your projects.\n\nStay tuned in the Slack Workspace (add the #University channel) for information on upcoming virtual hackathons, enablement sessions, office hours and more!\n\nWe will be supporting you every step of the way. From helping you construct a team, to ideation sessions. From roadblocks in your project, to how to present what you’ve created. For any problem you run into, there will be an IBMer excited to work through it with you.\n\nYou are the future, and we hope you will join us by answering the call to make a brighter tomorrow for our planet. There has never been a more important time than right now to use technology for good.\n\n\nHere are some helpful links to get you started!\nApril 22 Event Registration link:\nhttps://cgiu.cgiforms.org/view.php?id=141342\n\nHelpful COVID Code Patterns\nhttps://github.ibm.com/spackows/AI-ContentOps/tree/master/COVID-19\n\nSlack info\nwww.callforcode.org/slack - Please add the #University channel\n\nCOVID Starter Kits:\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Cooperation-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Communication-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Education-2020\n\nClimate Change Starter Kits:\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Energy-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Disasters-2020\nhttps://github.com/Call-for-Code/Solution-Starter-Kit-Water-2020\n\nProject Sample:\nhttps://github.com/Code-and-Response/Project-Sample",
    "type": "5",
    "event_id": "vvpdrrm9uo1h74urmu8kt4oo0s"
  },
  "https://cmu.joinhandshake.com/events/490035": {
    "name": "Translational Biomedical Research Management M.S. - graduate program info session",
    "dates": [
      {
        "start_date": "2020-04-23",
        "end_date": "2020-05-31",
        "start_time": "18:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://hartwick.zoom.us/j/969511403",
    "description": "We are recruiting for our Master's in Translational Biomedical Research Management!\nJoin our virtual info sessions on Tue/Wed/Thu (6-7pm EST) every week between April 23rd and May 31st, 2020. Connect online through the video URL provided above or dial 1(646)558-8656 to join the event by phone; use meeting ID 969511403 when prompted.\nDon't hesitate to ask any questions about our graduate admission process at Hartwick - Let's talk!\nVisit us online anytime: www.hartwick.edu/moveintomanagement",
    "type": "4",
    "event_id": "4v0u7amqdqamp54ok80fdiet18"
  },
  "https://cmu.joinhandshake.com/events/493084": {
    "name": "McKinsey & Company: Our very first EEMA Hackathon: PROHACK",
    "dates": [
      {
        "start_date": "2020-04-27",
        "end_date": "2020-06-21",
        "start_time": "12:00:00",
        "end_time": "23:55:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "McKinsey &amp; Company are excited to announce that registration is open for PROHACK, our very first online EEMA hackathon for data scientists across CIS, the Middle East, Turkey, Pakistan and Africa. Participants can work independently or in teams of up to 4 to develop efficient business solutions using data science, and the top 20 teams will share a $25,000 prize!\n \nThe task details and dataset will be available May 18, and the deadline to upload solutions is June 21. Please note that anyone can join before the last day (June 21) to PROHACK! Registrations are now open at http://prohack.org with easy sign up – no applications and no resume screenings! \n\nShare in your personal LinkedIn and social media accounts: \nLinkedIn: https://www.linkedin.com/feed/update/urn:li:activity:6661229957630476288/\nFacebook: https://www.facebook.com/reallifeatmckinsey/videos/233139794455878/",
    "type": "5",
    "event_id": "qfq9rheo6ru5f7ld9chaq2kd5g"
  },
  "https://cmu.joinhandshake.com/events/505570": {
    "name": "Yelping From Home: The Tech Talk Series",
    "dates": [
      {
        "start_date": "2020-05-26",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "***RSVP via Eventbrite (https://bit.ly/2LOQtdw)***\n\nYelp’s mission is to connect people with great local businesses, and one of the teams working behind the scenes to make that happen is our five star engineering and product teams.\n\nPlaying an active role in our community is a value that we have strongly prioritized over the years. Typically we would invite you to come to Yelp’s HQ to network, grab a slice of ‘za, and learn about the technology and culture behind Yelp. With stay-at-home orders across the globe, Yelp (like many of you) has had no choice but to adapt to these changes. We understand that this is a strange and challenging time for many, so we’d like to invite you to join us as we navigate this new normal for the tech community together. \n\nTo stay connected, create space for folks to collaborate and share some of the things Yelp has been working on, we are launching our very own virtual tech talk series. This series of talks will feature Yelpers from engineering and product and will focus on themes such as career development, technical skills, workplace challenges and Yelp’s response to COVID-19.\n\nJoin us to hear \"Code Review Etiquette\" by Surashree Kulkarni and \"5 Things We Wish We Knew When We Started Working as SWEs\" by Banafsheh Derayat and Vanessa Gutierrez.",
    "type": "5",
    "event_id": "hnfafhp3aohdd1l77586p44888"
  },
  "https://cmu.joinhandshake.com/events/490640": {
    "name": "Virtual HireUp Career Fair Hosted by the Pittsburgh Technology Council",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://www.careereco.com/Fair/EventDetails?fairId=e8776210-422b-4dc8-907e-aba0013a3df1",
    "description": "Hire Up Virtual Career Fair\nWhat is the Hire UP Virtual Career Fair?\nThe Hire UP Virtual Career Fair provides an opportunity for employers and job seekers to connect and network online. For employers seeking to expand their pipeline of tech talent, the Hire UP event is and time efficient solution to recruitment efforts.  \n\nOur hope is to connect displaced and underemployed regional workers with local companies who are hiring technical/corporate employees. For companies who are not hiring and/or have had layoffs, this could serve as outplacement support for displaced workers. \n\nWHEN: May 27, 2020 | 11 am to 3 pm\nWHERE: Anywhere with an internet connection\n\nWhat type of candidate is invited?\nThe main purpose of the event is for employers to recruit technical talent. Non-technical talent may attend, and employers may post non-technical jobs, however the focus is on tech roles. \n• Candidates seeking Full-time, Part-time, and Internships\n• Recruit graduate and undergraduate talent\n\nCompanies currently scheduled to attend:\nAmazon\nAstrobotic\nCGI\nConnectiveRx\nDollar Bank\nFragomen\nGiant Eagle\nHighmark\nLeidos\nLucas Systems\nMaven Machines\nMethod Automation Services, Inc.\nPhilips\nPNC\nSchell Games\nSDLC Partners\nSngular\nSynergy Staffing\nTeleTracking Technologies\nUniversity of Pittsburgh\n\nRegister here:\nhttps://www.careereco.com/Fair/EventDetails?fairId=e8776210-422b-4dc8-907e-aba0013a3df1",
    "type": "1",
    "event_id": "7icr4e68mp61lgbrhgc5dr43vc"
  },
  "https://cmu.joinhandshake.com/events/495749": {
    "name": "*Nurture Your Mental Health During Your Job Search",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/j/96335602381?pwd=Z3BSQjRhcjJUWUNibGlsd0lQR0lVZz09",
    "description": "Learn how to care for your mental health while looking for jobs in this changing career landscape with Jeff Beyer and Dareen Basma, psychotherapists from CMU’s Counseling and Psychological Services (CaPS) and Amy Tavares, the Disability Resources Intern from the Career and Professional Development Center (CPDC). \n\nHave questions related to mental health and the job search? Submit them here: https://forms.gle/Sw6LCRdGuj4WXxZd8",
    "type": "1",
    "event_id": "c0prfj186d51lm5tb94hnsik4o"
  },
  "https://cmu.joinhandshake.com/events/489545": {
    "name": "2020 FUTURE NOW Media & Entertainment Conference",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-29",
        "start_time": "12:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://www.futurenowconference.com/",
    "description": "APPLY NOW: http://www.futurenowconference.com/the-conference\n\nFUTURE NOW Media &amp; Entertainment Conference is the first conference of its kind, bringing unprecedented access and opportunity for leaders on the forefront of the industry and top college and graduate students to connect, learn, and grow together!\n\nThe industry’s most influential leaders, senior executives and professionals share insights about the broadcast, cable and digital media businesses along with the latest trends and emerging technologies. Through keynotes, panel discussions, workshops and intimate mentoring sessions, media professionals share about how to succeed in the industry and the range of possible job opportunities.\n\nThis is a rare and incredible learning and networking opportunity for students to make meaningful connections that will better prepare and position them to pursue their careers upon graduation.\n\nThe application materials of those accepted to attend the conference are included in a TALENT RESOURCE PORTFOLIO that FUTURE NOW provides to sponsors and executives in attendance as a resource to help fill internship and job openings. This is not a guarantee for a job, but it is a great opportunity for students to get noticed by companies present at the conference and not get lost in an online abyss!",
    "type": "1",
    "event_id": "eko5ttkstk685414d6lic0n5vg"
  },
  "https://cmu.joinhandshake.com/events/428110": {
    "name": "Learn2Lead - Crowe Summer Leadership Program",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-28",
        "start_time": "12:00:00",
        "end_time": "16:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "No location",
    "description": "Firm Overview\nVisit Crowecareers.com and find out what it's like to work at one of the “50 Best Workplaces for New College Graduates.” Crowe ranked seventh on this 2016 Fortune list and was highly rated in survey feedback.\nCrowe LLP (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.\nCrowe Seeks Leaders | Summer Leadership Program, Learn2Lead (L2L)\nAre you currently considering career options in public accounting, consulting, or technology? Would you like to enhance your leadership &amp; team work skills while enriching your career knowledge &amp; possibly finding a future internship? Do you like meeting &amp; networking with professionals &amp; fellow students from top universities/colleges in the US? Are you interested in what a national top public accounting, consulting, &amp; technology firm can offer you? \nL2L is designed to provide leading students from select universities and colleges, the opportunity to learn more about Crowe’s core values, energizing culture, and our client services. While having fun and developing yourself professionally, programming may include team building exercises, leadership presentations, and/or professional business skill workshops. These activities are aimed at educating you on the leadership qualities needed to excel in the consulting arena.\nInternship Opportunities Following the L2L Program\nAttend L2L and you will also be considered for future opportunities with Crowe including 2021 internships. You will have the opportunity to work with clients to help determine their business needs, along with assisting companies in defining, designing, developing, and implementing business and technology solutions that provide critical value to their organization. \nL2L Key Requirements\n\n•\tSeeking a degree in one of the following preferred majors or similar background: \no\tAccounting\n-      Computer Science / Computer Engineering (or related major)\no\tInformation Systems (or related major)\no\tInformatics (or related major)\no\tSupply Chain Mgmt., Operations (or related major)\no\tFinance, Business Administration, Economics (or related major)\n\n•\tMinimum GPA of 3.2 required.  Minimum GPA of 3.4 preferred. \n•\tCurrent Freshman, Sophomore or Junior \n•\tPermanent resident and/or U.S. Citizen.",
    "type": "2",
    "event_id": "viool6klsib5aq671rr2ud83lg"
  },
  "https://cmu.joinhandshake.com/events/501525": {
    "name": "Brooke Charter Schools Associate Teacher Virtual Information Session",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "15:45:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you ready to launch your career as a teacher at one of the top-performing schools in Boston? Join us for a virtual information session about our Associate Teacher Program, a salaried, school-based teacher preparation program that empowers corps members to become successful lead teachers in just one year. You will hear from the Associate Teacher Program Manager and current Associate Teachers about school culture, the structure of the program, mentorship and professional development, compensation, and more!\n\nOnce you RSVP, we will message you a Zoom link to access the event.",
    "type": "1",
    "event_id": "aokbimdqhri611oendlipbcpvc"
  },
  "https://cmu.joinhandshake.com/events/490683": {
    "name": "City Year Virtual Info Session (East Region)",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "16:30:00",
        "end_time": "17:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you still deciding on the career path you want to take? Interested in taking a gap year before going back to school or jumping into a full-time career? Do you desire to make a difference? If so, join us to learn more about post-grad service opportunities as a City Year AmeriCorps member. You will learn more about our full-time work as Student Success Coaches in high-need schools, get clarity around the benefits package, and gain knowledge about the application process.\n\nYou will need a password to join the virtual event. Please register using the external link provided. \nOur final application deadline for the positions starting in July/August 2020 is Friday, May 29th. Please reach out with any questions you may have!\n\nCan't make this session, but want to learn more?  Contact Dawn Lastowka at dlastowka@cityyear.org to be connected with a City Year recruiter.",
    "type": "1",
    "event_id": "gbreikfthf2clgu27kbpmhnb6k"
  },
  "https://cmu.joinhandshake.com/events/503505": {
    "name": "Capital Teaching Residency Webinar",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "n/a",
        "start_time": "17:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Join our webinar to learn more about our teacher certification and preparation program!",
    "type": "1",
    "event_id": "au7634df5jibcr7ob0k4fv8q38"
  },
  "https://cmu.joinhandshake.com/events/432073": {
    "name": "2020 FUTURE NOW Media & Entertainment Conference",
    "dates": [
      {
        "start_date": "2020-05-27",
        "end_date": "2020-05-29",
        "start_time": "18:30:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=3%20Spruce%20Street,%20New%20York%20City,%20New%20York%2010038,%20United%20States%20of%20America",
    "description": "APPLY NOW: http://www.futurenowconference.com/the-conference\n\nFUTURE NOW Media &amp; Entertainment Conference is the first conference of its kind, bringing unprecedented access and opportunity for leaders on the forefront of the industry and top college and graduate students to connect, learn, and grow together!\n\nThe industry’s most influential leaders, senior executives and professionals share insights about the broadcast, cable and digital media businesses along with the latest trends and emerging technologies. Through keynotes, panel discussions, workshops and intimate mentoring sessions, media professionals share about how to succeed in the industry and the range of possible job opportunities.\n\nThis is a rare and incredible learning and networking opportunity for students to make meaningful connections that will better prepare and position them to pursue their careers upon graduation.\n\nThe application materials of those accepted to attend the conference are included in a TALENT RESOURCE PORTFOLIO that FUTURE NOW provides to sponsors and executives in attendance as a resource to help fill internship and job openings. This is not a guarantee for a job, but it is a great opportunity for students to get noticed by companies present at the conference and not get lost in an online abyss!",
    "type": "1",
    "event_id": "41t9v1o7oc39f4e0ocig8r0p2k"
  },
  "https://cmu.joinhandshake.com/career_fairs/15789": {
    "name": "VIRTUAL EVENT: Carnegie Mellon University Alumni Virtual Career Fair 2020",
    "dates": [
      {
        "start_date": "2020-05-28",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=Virtual%20Career%20Fair%20Using%20Brazen",
    "description": "Are you still looking for a full-time job? Not to worry! The Carnegie Mellon University Alumni Virtual Career Fairis an opportunity to connect with employers who are hiring for all roles.  This is the first time we have held a virtual career fair for the CMU Alumni population so you will not want to miss out!Ifyouareacurrentstudentyoumayattendthisfairifyouaregraduatingin May/August2020.\nTo register for this event please visit: https://app.brazenconnect.com/a/cmu_career/e/48R1M\nThe CMU Alumni Virtual Career Fair occurs on May 28 from 1:00pm - 3:00pm EDT.  Please note the following reminders and instructions for the event. We will be using the platform Brazen for the virtual fair. https://app.brazenconnect.com/a/cmu_career/e/48R1M\n1) Before the event starts, log-in to Brazen to update your registration page if you haven’t already (top-right corner under your name). This registration page will allow you to add a resume and other key information for employers to view. To participate, you can log in with the same link to begin. https://app.brazenconnect.com/a/cmu_career/e/48R1M\n2) Chats with employers have been set to 12 minutes. This time goes quickly, so I recommend brainstorming a few main takeaways that you would hope to capture/share before the time expires (i.e., contact information, job titles, next-step instructions, etc.) These are text-based chats – not video chats.\n4) Click hereand scroll down to watch a video on what to expect.",
    "type": "1",
    "event_id": "u3ktkia119r8014k2fr7jthooo"
  },
  "https://cmu.joinhandshake.com/events/503512": {
    "name": "Annapurna Partners(Real estate private equity)- Virtual Info Session with Principal Michael Mogull",
    "dates": [
      {
        "start_date": "2020-05-28",
        "end_date": "n/a",
        "start_time": "17:05:00",
        "end_time": "17:45:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us04web.zoom.us/j/571840640?pwd=SjhWdFovM2V2WFFhYzEwbGEvbnpWUT09",
    "description": "You will Learn:\n\n-How Mr. Mogull initially got into the real estate business and his background in the space over the last two decades.\n-What Mr. Mogull's role is as Managing Principal of a real estate PE firm.\n-What makes Annapurna different in their approach to the real estate private equity space.\n-How to leverage the mentorship offered through our internship academy to compress time frames for career growth as a business leader and real estate professional.\n-You will learn about the various employment opportunities available within our rapidly growing team. Current job opportunities include Acquisitions (Business Development) roles and Annapurna Academy, a 24-month internship/apprenticeship training program.\n-What intrinsic character traits Annapurna looks for when he is recruiting future leaders for the firm.\n-The pros and cons of working for a larger company versus a smaller company at the beginning of your career, and what Mr. Mogull wishes he did differently himself.\n-Why the covid 19 pandemic is not something we see as a long term impediment to our growth.\n\n\n\nAbout US:\nAnnapurna Partners is a private real estate investment, development and management firm. We identify commercial real estate opportunities by taking an entrepreneurial approach to create stakeholder value. Our strategies are opportunistic, focusing on building value and mitigating risk, while leveraging relationships with our large network of strategic sponsors and advisors throughout the United States. This team identifies, analyzes, develops, and operates investments from start to finish. Based in Fort Lauderdale, Annapurna Partners employs a strong team of corporate, financial, and operational and construction professionals.\n\nTo learn more please visit www.annapurnapartners.com",
    "type": "2",
    "event_id": "7idfblkbgiq81a89nncmtfui28"
  },
  "https://cmu.joinhandshake.com/events/501850": {
    "name": "TCS Analytics & Insights ‘data brew & data jam’ session 2",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "As a follow up to the session on Analytics and Insights with focus on data, we are coming back to host a Data Jamming Session. \n\nThis is the second session in our Data jamming series! We will be going over the data collections from students from our first session and discussing insights and predictions!",
    "type": "5",
    "event_id": "mibr3daiocuiqptpbm7cvbe40s"
  },
  "https://cmu.joinhandshake.com/events/502224": {
    "name": "City Year Philly Ask-Me-Anything with Dominique Medler",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://bit.ly/CYPMayteams",
    "description": "Philly! Philly! Drop in and chat with me! Ask the questions you need answered to help you submit a strong application and prepare for your candidacy.  Everything is on the table from the challenges you'll face as a City Year AmeriCorps member to the impact you'll have on students' lives, and the lifelong friendships you'll make serving alongside your peers. And for those that don't live in Philly, we can chat about what it's like to live in Philly.\n\nPlease use the external registration link to ensure communication leading up to and after the event.",
    "type": "1",
    "event_id": "vjqlvbejcqei1jfhdn5dph659o"
  },
  "https://cmu.joinhandshake.com/events/501941": {
    "name": "Day in the Life of a Habitat AmeriCorps Member",
    "dates": [
      {
        "start_date": "2020-05-29",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Join our virtual event – “A day in the life of an AmeriCorps member” – where you can learn more about Habitat AmeriCorps service opportunities, benefits to service and how to apply.",
    "type": "1",
    "event_id": "rfsr4bj3073vo5kjtdkr6bogbo"
  },
  "https://cmu.joinhandshake.com/events/502169": {
    "name": "2020 Morgan Stanley Asia Webinar Series: Introduction to Sales & Trading",
    "dates": [
      {
        "start_date": "2020-06-01",
        "end_date": "n/a",
        "start_time": "19:00:00",
        "end_time": "21:00:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "In this webinar, you will learn about:\n- Introduction to Morgan Stanley Asia and the work we do\n- Discuss the advantages and unique career opportunities the banking industry presents\n- Gain insight into the day-to-day life of our business representatives and their roles at the firm\n- Learn more about our 2021 internship opportunities across various business units\n- Live Q&amp;A with our business representatives and campus recruiters\n- Learn about our upcoming virtual events",
    "type": "2",
    "event_id": "oig7c72kg3i1tbgg0k42qdl1ro"
  },
  "https://cmu.joinhandshake.com/events/503602": {
    "name": "NNSA Graduate Fellowship Program Virtual Information Session June 2, 2020",
    "dates": [
      {
        "start_date": "2020-06-02",
        "end_date": "n/a",
        "start_time": "16:30:00",
        "end_time": "17:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "https://pnnl.zoom.us/webinar/register/WN_4Sehe2IYSqqNilUOa18iAg",
    "description": "Register in advance for this webinar:\nhttps://pnnl.zoom.us/webinar/register/WN_4Sehe2IYSqqNilUOa18iAg \n\nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer:\n• Hands-on experience in national security and nonproliferation;\n• Career development, professional networking, and specialized training events; and\n• Extensive interaction and collaboration with leading national security technology and policy experts.\n\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021.",
    "type": "4",
    "event_id": "ov7dnuiaes8jmh3tqo9cjn0l68"
  },
  "https://cmu.joinhandshake.com/events/504362": {
    "name": "Adapt and Rise: Building resilience for businesses & people in times of uncertainty",
    "dates": [
      {
        "start_date": "2020-06-03",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "In these extraordinary times, companies across the globe are facing unexpected challenges. To tackle these challenges, while also building resilience and protecting business continuity, governments and companies must make big decisions – and make them fast!\n\nJoin us for an interactive session on how Genpact is combining human intelligence and data-driven augmented intelligence to help businesses adapt and rise today!",
    "type": "2",
    "event_id": "63193v687973j11qejfkftv6go"
  },
  "https://cmu.joinhandshake.com/events/486086": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-06-08",
        "end_date": "n/a",
        "start_time": "09:00:00",
        "end_time": "10:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session and is below: https://cmu.zoom.us/j/98631223018\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/",
    "type": "1",
    "event_id": "lufo70qbqf9rkmc4pqu1m6m3v8"
  },
  "https://cmu.joinhandshake.com/events/503707": {
    "name": "PDT Partners | Demystifying Tech Careers in Quantitative Finance",
    "dates": [
      {
        "start_date": "2020-06-17",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Thinking about a career in tech, but never considered a path in quantitative finance?  \n\nDuring our 1-hour Zoom webinar, a panel of current PDT Partners technologists will talk about their career paths that led them to our firm, projects they’re currently working on, and commonly asked questions they've received from people outside the quantitative finance industry. We’ll also be giving a brief overview of the different groups within our technology organization. \n\nA career in quant finance shouldn’t feel out of reach. Our engineers come from a wide variety of backgrounds, ranging from startups and big tech, to well-known financial institutions.  We’re always looking for growth-minded individuals from any industry who love digging into data-driven problems. \n\nWe’ll have the chat open during the webinar for you to ask our panelists questions, but we kindly ask you to submit questions when you register about specific topics you’re curious about.  \n\nSpeakers:\nRob Morse - Head of Data Strategy and Sourcing\nIslay Symonette - Software Engineer\nDhrupad Bhardwaj - Software Engineer\nAndy Lei - Software Engineer\nJingyuan Wang - Intern 2019, incoming Software Engineer 2020\n\nPlease register using the Non-Handshake Registration URL to receive the Zoom link.\n\nWe look forward to seeing you virtually on June 17th. Please feel free to invite friends!",
    "type": "5",
    "event_id": "ebmnnii0c13l8d9mf8g46i5q4c"
  },
  "https://cmu.joinhandshake.com/events/496155": {
    "name": "Quantitative Investment Careers at Fidelity",
    "dates": [
      {
        "start_date": "2020-06-18",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "17:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "NOTE: Please register through the external link, not just Handshake.  If you do not register through the external link, you will not receive the webinar link.\nhttps://www.applytracking.com/tp/rj6-HrUym-I_K\n\nThis event will give students the opportunity to learn about our Quantitative Research and Data Analytics divisions within our Asset Management business.  \n\nBy joining this event, you will get a chance to learn more about Fidelity, Asset Management, and a deep-dive into Quant careers.  Representatives from each of our main Quant and Data Analytics groups will be joining for a moderated career panel discussion.  You will have the opportunity to ask questions, hear about their career paths, gain insights about getting into the field, and discover how Quant Research works at Fidelity!\n\nThe event will feature members of the following teams: \n• Advanced Data Analytics\n• Equity Quantitative Research\n• Fixed Income Quantitative Research\n• Global Asset Allocation Quantitative Research\n• Strategic Advisers Quantitative Research\n\nThe last 30 minutes of the session will be dedicated to discussing full-time and internship opportunities for 2021.\n\nNote: we have finalized recruiting for our Summer 2020 season and will not be discussing opportunities for this summer.",
    "type": "2",
    "event_id": "66kd1r83ie2kqfpmp1tsgrstn4"
  },
  "https://cmu.joinhandshake.com/events/503607": {
    "name": "Meet McKinsey Middle East office",
    "dates": [
      {
        "start_date": "2020-06-21",
        "end_date": "n/a",
        "start_time": "11:30:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Meet McKinsey Middle East office\nThree colleagues sharing their journeys from one office. Join us on 21 June 2020 at 11:30 EST for a 1 hour presentation inspired by the impact our practices are having in the region.\nMaybe you will discover McKinsey is a place for you, too.\n\nThe session is open to candidates currently based in North America graduating in 2021 with a Masters or PhD.\nRegister by 14 June using the following link:\nhttp://www.mckinsey.com/MEOAPDWebinar2020\n\n#McKCareers #McKMiddleEast",
    "type": "2",
    "event_id": "cminmadq6g0a2p1mkfjd89capo"
  },
  "https://cmu.joinhandshake.com/events/497648": {
    "name": "NNSA Graduate Fellowship Program (NGFP) Virtual Information Session June 24, 2020",
    "dates": [
      {
        "start_date": "2020-06-24",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://pnnl.zoom.us/webinar/register/WN_AUPVfZS2TYewdeaFki8XiQ",
    "description": "Register in advance for this webinar: https://pnnl.zoom.us/webinar/register/WN_AUPVfZS2TYewdeaFki8XiQ  \nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer: \n• Hands-on experience in national security and nonproliferation; \n• Career development, professional networking, and specialized training events; and \n• Extensive interaction and collaboration with leading national security technology and policy experts.\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021.",
    "type": "4",
    "event_id": "udpmsjeq88fbuce8p8l5usiu94"
  },
  "https://cmu.joinhandshake.com/events/486087": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-07-15",
        "end_date": "n/a",
        "start_time": "12:30:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/",
    "type": "1",
    "event_id": "rjc6tjnls3r06pi8v1ten2cbso"
  },
  "https://cmu.joinhandshake.com/events/504712": {
    "name": "*Considering Applying to Graduate School for a PhD?",
    "dates": [
      {
        "start_date": "2020-07-22",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJUkd-ihpjwtGN1yogVMDR7E6J5xLY1nfU-U",
    "description": "Have you been thinking of continuing your education further?\nLearn how to research PhD programs, network with alumni and advisors to explore programs and find the right ones for you.\nLearn how to appropriately tailor your Statement of Purpose (SoP), receive an overview of how faculty read these documents and how to tailor your documents for each program.\nReceive an introduction and demo to the OLI course “Statement of Purpose.”\nLearn how to schedule appointments with a GCC advisor, a CPDC advisor, and learn where helpful resources are located on the GCC and CPDC websites.\n\nRegistration is required, to register for the Workshop in Zoom use the link below- PLEASE USE YOUR CMU ANDREW EMAIL:\nhttps://cmu.zoom.us/meeting/register/tJUkd-ihpjwtGN1yogVMDR7E6J5xLY1nfU-U\n\nAfter registering, you will receive a confirmation email containing information about joining the workshop. To log in to the session on the day of the event, follow this link: https://cmu.zoom.us/j/91901987729",
    "type": "1",
    "event_id": "eqsa5kocj6a6jph6c9lmr21k7k"
  },
  "https://cmu.joinhandshake.com/events/492348": {
    "name": "MTR Virtual Visit",
    "dates": [
      {
        "start_date": "2020-07-30",
        "end_date": "n/a",
        "start_time": "14:15:00",
        "end_time": "15:15:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "- A one-hour webinar-style virtual visit for prospective residency applicants.\n - Explore MTR’s mission of equal education and residency model of teacher training\n - Hear from MTR  leadership and current participants\n - Ask questions",
    "type": "1",
    "event_id": "o7etet66i4lgv0h8uj5pbi1858"
  },
  "https://cmu.joinhandshake.com/events/507877": {
    "name": "BASIS.ed Teacher Career Webinar",
    "dates": [
      {
        "start_date": "2020-06-04",
        "end_date": "n/a",
        "start_time": "16:30:00",
        "end_time": "18:30:00",
        "timezone": "MDT"
      }
    ],
    "location": "n/a",
    "description": "Interested in learning more about teaching opportunities with BASIS charter schools for the 2020-2021 school year? If so, please join us for our BASIS.ed Webinar!\n\nWe would like to share our story regarding our team and our spirit by inviting you to join us for a live discussion about our community and how you can join our team for the 2020/21 school year.  We will hold a live Career Opportunity Webinar on Thursday, June 4, 2020 at 4:30 PM Arizona and 7:30 PM EST via GoToWebinar. Please register here. \n\nWebinar Details: The webinar will be hosted by Peter Bezanson, Chief Executive Officer of BASIS Educational Ventures; he'll be joined by our Chief Academic Officer, Julia Toews, BASIS Goodyear Head of School, Vee Moyo, and several BASIS Charter School teachers. The webinar will share our mission, school culture, curriculum and what it's like to teach at BASIS Charter Schools.\n\nIf you have experience teaching, have thought about teaching, or have just always wanted to work in a school setting, please attend!  A Bachelor’s degree is required for any teaching positions however, we do NOT REQUIRE TEACHING CERTIFICATION.\n\nNew graduate or a new teacher? Our Teaching Fellow program allows you to gain valuable classroom experience while working alongside some of the top teachers in the industry.\n\nWe look forward to seeing you there!",
    "type": "1",
    "event_id": "scbga1mgqbnlho2avrq2bu0vo4"
  },
  "https://cmu.joinhandshake.com/events/507950": {
    "name": "Gartner Summer Webinar Series",
    "dates": [
      {
        "start_date": "2020-06-09",
        "end_date": "2020-07-30",
        "start_time": "11:00:00",
        "end_time": "12:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Gartner is excited to formally invite you to participate in our Gartner Summer Webinar Series. This virtual series will provide you an opportunity to attend professional development workshops, hear from Gartner’s senior leaders, and participate in workshops led by business unit leaders and associates. Use the link provided to gain more insight into all of the sessions we are offering.\n\nWe are also pleased to announce that as part of our Summer Webinar Series, there will be an opportunity to receive a certificate of completion. This certificate may be listed on your resume or LinkedIn profile and can serve as a verification of your participation in Gartner’s Summer Webinar Series.  To receive the certificate you must attend at least 5 (five) of our sessions throughout the summer.",
    "type": "2",
    "event_id": "ijb22nkoi203bon2efftvi3blk"
  },
  "https://cmu.joinhandshake.com/events/509389": {
    "name": "Life at TCS and our Banking and Financial Services Group",
    "dates": [
      {
        "start_date": "2020-06-09",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://tcs.webex.com/tcs/j.php?MTID=mcdb83929a00935469967c818ab2dd2bb",
    "description": "Madhuri Gadkari - our Campus Recruiter will present about Life in TCS, and discuss experiences for a recent college graduate, the company business model, and more information to introduce TCS. She will be joined by Priyan, from our Banking and Financial services group to discuss more about life at TCS.",
    "type": "2",
    "event_id": "808ikn1t04gras0svrgd2jjrsk"
  },
  "https://cmu.joinhandshake.com/events/509787": {
    "name": "Virtual Session:  Education Pioneers",
    "dates": [
      {
        "start_date": "2020-06-09",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJIufu-uqT4vGNNTsHBbbWTdBlcJ__yYO1-1",
    "description": "Maximize your IMPACT for the moment that matters in Education Pioneers’ 10-month Impact Fellowship!\n\nLourdes Laguna (CMU, Heinz-DC ’09) will share more about the EP Impact Fellowship and ways in which the experience will build your capacity to lead, learn, and connect within our nation’s education system, especially in this most critical time of need in the aftermath of COVID-19. Our current Impact Fellows are pivoting with purpose and we hope you get the opportunity to join.\n\nFellows are placed in education organizations or school districts nationwide and participate in cohort-based programming throughout the 10-months. Other Benefits: adaptive, inclusive leadership development, like-minded individuals, career opportunities beyond the fellowship, networking with 4500+ cohort of EP alums, etc. \n\nDo you have data analysis, strategy, and/or project management skills? Do you want to make an impact in education? Are you interested in pivoting your career towards social impact?\nIf so, please join us on 6/9 @ 12pm EST to learn more. \n\nApply to the EP Impact Fellowship Here:  https://cmu.joinhandshake.com/jobs/3774011",
    "type": "1",
    "event_id": "8hepgh25ipec8gtk6sgh2b9enc"
  },
  "https://cmu.joinhandshake.com/events/509994": {
    "name": "Virtual Session:  Office of the Secretary of Defense now hiring analysts",
    "dates": [
      {
        "start_date": "2020-06-10",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJ0kd-GprDoiGtYGL-QmDyM66wTzF_L-3yoi",
    "description": "Nat Horner (CMU EPP PhD '16) will describe hiring opportunities for analysts in Cost Assessment and Program Evaluation (CAPE) in the Office of the Secretary of Defense.\n\nCAPE traces its lineage to Secretary McNamara's \"Whiz Kids\" -- an effort to bring objective, quantitative analysis to Pentagon decision making. The office is part think tank, part consulting firm, and part investigative agency, with the mission of providing its sole client—the Secretary of Defense—with timely, insightful, and unbiased analysis to aid strategic decisions. CAPE analysts have impact: our work informs decision makers at the highest levels of the Department and directly affects a $700B budget.\n\nRequirements: Graduate education in quantitative fields; demonstrated analytical ability; a desire to make sense of the strategic picture; curiosity to learn about new topics; and an ability to lead cross-organizational teams.\n\nBenefits: Exposure to the highest levels of the Department; the ability to see direct outcomes from your analysis; a cadre of smart, dedicated colleagues; the opportunity to network across DoD; streamlined hiring and promotion.\n\nNat has experience in other government agencies, think tanks, and research centers. He thinks CAPE is an awesome place to work, but is also happy to answer general questions about government and government-adjacent employment, as well as available fellowship programs. Stop by and say hi!",
    "type": "1",
    "event_id": "numko9qs9djhv1q2q4us31lvhk"
  },
  "https://cmu.joinhandshake.com/events/507184": {
    "name": "Peace Corps Info Session: Pittsburgh & Western PA",
    "dates": [
      {
        "start_date": "2020-06-10",
        "end_date": "n/a",
        "start_time": "13:30:00",
        "end_time": "14:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://peacecorps.zoomgov.com/meeting/register/vJIscu6hpjMjHF0fsmbzyybmStakUeci-xc",
    "description": "Serving in the Peace Corps is a great way to immerse yourself in a new culture, learn a new language, and have the experience of a lifetime. Join us at this information session to learn about Volunteer experiences, ask questions about service, and gain tips to guide you through the application process. Note: We will be holding this event on a virtual platform instead of in-person. Please register to ensure that you receive access to join the event.",
    "type": "1",
    "event_id": "6k2sh5t7b3m23i271utf2l0p6c"
  },
  "https://cmu.joinhandshake.com/events/509807": {
    "name": "Virtual Session:  American Enterprise Institute",
    "dates": [
      {
        "start_date": "2020-06-11",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJArf-6sqzMiHtQUNTufPaqon2wOWYc4Zf9U",
    "description": "American Enterprise Institute at Carnegie Mellon University\n\nAre you interested in public policy research? Have you ever wondered what it is like to work at a think tank in Washington, DC? If so, please join Natalie Runkle of the American Enterprise Institute (AEI) for a conversation about the history of the think tank world, AEI’s work in the policymaking sphere, and ways to get involved at AEI. AEI is seeking entry- to mid-level research assistants and staff members to begin this summer. We hope you will join and bring your questions!\n\nAEI is currently recruiting for the following positions:\n•\tAl Qaeda Analyst, Critical Threats Project\n•\tAssistant, Development Events\n•\tData Analyst, Education Policy Studies\n•\tEditorial Assistant/Associate\n•\tResearch Assistant, Foreign and Defense Policy Middle East Studies\n•\tResearch Assistant/Associate, Technology Policy Studies\n•\tWriter and Editor, Fundraising\n\nFull position descriptions for each of these roles can be found at www.aei.org/jobs",
    "type": "1",
    "event_id": "2vopulfsfh1l8vaks919cjpi90"
  },
  "https://cmu.joinhandshake.com/events/507782": {
    "name": "A Day in the Life of a MATR Software Engineer!",
    "dates": [
      {
        "start_date": "2020-06-11",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://moodys.zoom.us/j/98049652901",
    "description": "Moody's is an essential component of the global capital markets, providing credit ratings, research, tools and analysis that contribute to transparent and integrated financial markets. Moody's Corporation is the parent company of Moody's Investors Service, which provides credit ratings and research covering debt instruments and securities, and Moody's Analytics, which offers leading-edge software, advisory services and research for credit and economic analysis and financial risk management.\n\nAre you interested in joining a community of developers at the intersection of finance and technology? Do you seek to collaborate with others to build risk analytics products and solutions that make an impact around the world using current and emerging technologies? If so, then the Moody’s Analytics Technology Rotation (MATR) program is for you! Join this event to learn more about this 2-year program that offers recent graduates the experiential benefits of job-hopping among start-ups with the stability and financial backing of a well-established company. As you rotate offices in the US, your curiosity will be met with a variety of challenging projects while receiving ongoing training and mentoring.\n\nJoin us on Zoom on June 11 at 1:00pm EST / 10:00am PST to learn about the MATR program from Moody’s representatives including recent grads who are current participants in the program. If interested in attending, please register for the event via Handshake!\n\nFor more details about the MATR program – go to our website at https://careers.moodys.com/students-and-graduates/moodys-analytics-technology-rotation-program/.",
    "type": "5",
    "event_id": "fo7oap5g7bhn5oi1286ihsohgg"
  },
  "https://cmu.joinhandshake.com/events/509687": {
    "name": "JPMorgan Asset & Wealth Management Virtual Info Sessions",
    "dates": [
      {
        "start_date": "2020-06-15",
        "end_date": "2020-06-30",
        "start_time": "09:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "The Asset &amp; Wealth Management campus recruiting team will be hosting a series of info sessions. These sessions are designed to help you gain a deeper understanding of a career in Asset &amp; Wealth Management and help you gain a deep understanding of JPMorgan  internship opportunities, ultimately preparing you for a career that best matches your skills and interests. \n     \nPlease note that our team is hosting various info sessions, and the date of the session may differ from the date stated above. Using the \"register\" button on the link attached, please complete the form in order for our team to gain a better understanding of your interests. Once completed, our team will be in touch with next steps. \n\nhttps://jpmc.recsolu.com/external/events/ZhP4NdKLXp0DjHrUvnkbIQ",
    "type": "2",
    "event_id": "ptbpv01173oiu9ltmvockvfn30"
  },
  "https://cmu.joinhandshake.com/events/508644": {
    "name": "Aspiring Laboratory Leaders: CDC Laboratory Leadership Fellowship Webinar",
    "dates": [
      {
        "start_date": "2020-06-15",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you a PhD scientist yearning to make an impact in the lab and beyond? LLS is accepting applications now through June 28 for assignments beginning in July 2021. This webinar will help prepare you to apply and answer your questions.\n\nCDC’s Laboratory Leadership Service (LLS) invites interested candidates to attend an information session to learn about this unique fellowship, offering unparalleled opportunities for career progression in public health.\n\nPlease share this invitation with colleagues, specifically early career lab scientists with a PhD and two years of post-graduate experience.\n\nThis webinar will provide an overview of the two-year experiential service fellowship, cover the application process and timeline, and include time for questions and answers. The application period is open now through June 28, 2020. This is the last webinar that will be offered to help prepare fellowship applicants prior to the application deadline.\n\nWhen joining the event: Audio Bridgeline: 877.931.3262, Participant code: 48580179",
    "type": "4",
    "event_id": "9q05ouq9illitirtmrtbf54m70"
  },
  "https://cmu.joinhandshake.com/events/507339": {
    "name": "Office Hours: Pittsburgh and Western PA",
    "dates": [
      {
        "start_date": "2020-06-18",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://peacecorps.zoomgov.com/meeting/register/vJIsf-uhrDIqGMOwKbKf8kIRs7oVJKTJWaU",
    "description": "Peace Corps service is the opportunity of a lifetime. Schedule time with a local recruiter who can answer your questions about what it's like to live, learn, and work with a community overseas. Plus, you can gain tips to guide you through the application process.\n\nPlease e-mail Ryan Stannard at rstannard@peacecorps.gov to schedule an appointment. Note: We will be holding this event on a virtual platform instead of in-person. Please register to ensure that you receive access to join the event.",
    "type": "1",
    "event_id": "d5apr1uu8n6cs8haq2n9hjlvv4"
  },
  "https://cmu.joinhandshake.com/events/506486": {
    "name": "AT&T Summer Learning Academy Externship",
    "dates": [
      {
        "start_date": "2020-06-22",
        "end_date": "2020-07-20",
        "start_time": "12:00:00",
        "end_time": "12:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "The AT&amp;T Summer Learning Academy is a free, unpaid self-paced online learning “externship” certificate program, powered by award winning AT&amp;T University curriculum and designed to support college students looking for something to fill the void.\n\nThis program is open to all college students and consists of 80 hours of virtual, on-demand 24x7 content. Registration is open now for college students through June 12 and the program runs from June 22-July 20. \n\nUpon registration, you will receive an email from AT&amp;T Summer Learning Academy to complete a college validation form which must be completed to receive the AT&amp;T Summer Learning Academy certificate of completion.\n\nFor a preview of the curriculum, FAQs, and more, please visit the registration link. We look forward to welcoming you to the AT&amp;T Summer Learning Academy!\n\n***Registration deadline is June 12***",
    "type": "1",
    "event_id": "0ie9q2ihkjsi3bed276g5kiddc"
  },
  "https://cmu.joinhandshake.com/events/509844": {
    "name": "Live Webinar: Open Source: The Future is Female",
    "dates": [
      {
        "start_date": "2020-07-14",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Did you know that only 6% of total Open Source contributions have come from female technologists/engineers? That changes now!\n\nJoin us on July 14th as we bring together a panel of passionate Intuit technologists who want to inspire change in Open Source contributions. We’ll talk about why it's important to have a diverse, inclusive, and innovative Open Source Community and our technologists will share their Open Source projects, contributions and their recommendations on how you can encourage open source involvement in your own engineering communities. We’ll also take questions from the audience for a special Q&amp;A session.",
    "type": "5",
    "event_id": "bjcuuu9fp9im8b744hp6h5fkf8"
  },
  "https://cmu.joinhandshake.com/events/508219": {
    "name": "Application Workshop: Pittsburgh & Western PA",
    "dates": [
      {
        "start_date": "2020-06-24",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://peacecorps.zoomgov.com/meeting/register/vJIsceqvrTwpE5zf7n6iQx0OaKarbabz5Qw",
    "description": "Make your application stand out from the rest. Attend this workshop to learn how to browse Volunteer openings, find the right program, and strengthen your application. You will have an opportunity to ask questions about service, learn steps you can take to improve your chances, and gain valuable tips to guide you through the application process. Note: We will be holding this event on a virtual platform instead of in-person. Please register to ensure that you receive access to join the event.",
    "type": "1",
    "event_id": "54qmqbqmnc0go4jo4g4mmu4ufs"
  },
  "https://cmu.joinhandshake.com/events/486089": {
    "name": "*OPT Information Session - ONLY THROUGH ZOOM! WILL NOT BE IN-PERSON!",
    "dates": [
      {
        "start_date": "2020-08-03",
        "end_date": "n/a",
        "start_time": "10:00:00",
        "end_time": "11:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor , Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "NOTE: For this session, you CAN ONLY attend via Zoom. The Zoom meeting information will be emailed to the students who have registered for this event the day before the OPT Session.\n\nThis OPT Session will NO longer be held in-person. So if you want to attend this session, you MUST attend via Zoom. \n\nThe Office of International Education (OIE) will offer OPT information and application sessions for F-1 students who will be completing their programs in 2020 \n\nIf you are planning to apply for OPT, it is mandatory that you attend an OPT session. We cannot schedule individual advising appointments to provide this information, so plan ahead! Normal processing time for USCIS to process OPT is 3 to 5 months.\n\nYOU MUST BE ON TIME and attend the entire session!\n\nWe will start promptly ON TIME!\n\nIf you are late, you will have to register for another session.  \n\nYou can also find helpful information on the OIE website.\n\nBest, \nOIE Staff\nCarnegie Mellon University\nOffice of International Education\nCyert Hall, 1st Floor/Ste. 101\n412-268-5231\nhttp://www.cmu.edu/oie/",
    "type": "1",
    "event_id": "j96trb1883783bhc8eisiflud4"
  },
  "https://cmu.joinhandshake.com/events/506465": {
    "name": "McKinsey's Freshman Diversity Leadership Academy 2020",
    "dates": [
      {
        "start_date": "2020-08-06",
        "end_date": "2020-08-08",
        "start_time": "09:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://www.mckinsey.com/FDLA",
    "description": "McKinsey’s Freshman Diversity Leadership Academy: Apply by June 30, 2020\n\nThe McKinsey Freshman Diversity Leadership Academy (FDLA) aims to support talented Black, African American, Hispanic, Latino, and/or Native American college freshmen in their professional growth. Through a 2-day program, participants will build leadership, team problem-solving, and case preparation skills. In addition, participants will learn more about the management consulting industry, careers at McKinsey, and our application process for the Sophomore Diversity Leaders Internship for summer 2021. FDLA participants will benefit from activities including (but not limited to): \n•\tTED-style talks about leadership and communication skills\n•\tTeam problem-solving activities with top students from across the U.S.\n•\tNetworking with McKinsey consultants and recruiters\n•\tEarly preparation for the McKinsey case interview process\n•\tA couple days of fun and learning\n\nFDLA will be held virtually August 6-8, 2020.  Please submit your resume and a short essay by June 30, 2020.  Start your application at mckinsey.com/FDLA.\n\nSelected applicants will be notified by July 8, 2020.",
    "type": "2",
    "event_id": "4v7q7825hjfgbalfgi24mb1vho"
  },
  "https://cmu.joinhandshake.com/events/510215": {
    "name": "*CPDC Summer Seminars: Boost Your Skills Today for Your Career Tomorrow",
    "dates": [
      {
        "start_date": "2020-06-04",
        "end_date": "2020-07-31",
        "start_time": "08:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view?usp=sharing",
    "description": "The Career &amp; Professional Development Center (CPDC) invites you to participate in \"CPDC Summer Seminars: Boost Your Skills Today for Your Career Tomorrow\".   In order to support students whose internships and/or summer plans were impacted by COVID-19, the CPDC has coordinated 10 virtual seminars to help you develop practical skills for the workplace, such as project management, design thinking, data storytelling, and more.  These sessions are primarily led by employers, thus providing you an opportunity to network and learn.\n\nView the following link for a full schedule of details, which will be updated weekly as new seminars are confirmed:\n\nhttps://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view?usp=sharing",
    "type": "1",
    "event_id": "nl5b9b4jbs8c91pi805lqkhric"
  },
  "https://cmu.joinhandshake.com/events/510469": {
    "name": "**CMU-Q Alumni Networking Circles",
    "dates": [
      {
        "start_date": "2020-06-07",
        "end_date": "n/a",
        "start_time": "17:30:00",
        "end_time": "19:30:00",
        "timezone": "EAT"
      }
    ],
    "location": "https://cmu.zoom.us/j/92669401108",
    "description": "An opportunity to network with CMUQ alumni and hear how they transitioned from CMU to the world of work.\n\nThis virtual event will give you the opportunity to interact with approx 20 alumni.\nDiscussions will take place in rotating breakout rooms.\nLearn how your fellow tartans transitioned from CMUQ to the world of work. \nHear what advice and tips they have for you in this current time.\n\nList of alumni attendees:\n\nAya Abujarbu \n\nHessa Al Thani \n\nBilal Anwar \n\nBatoul Hasnah \n\nZehni Khairullah \n\nAlaa Shoudy \n\nAsma Al Kuwari \n\nAhmed Hashim \n\nSana Britto \n\nFatima Souj \n\nDema Abou Samhadeneh \n\nKhalid Al Naemi \n\nSama Kanbour \n\nSalma Moustafa \n\nMaryam Aghadi \n\nHaris Syed",
    "type": "1",
    "event_id": "6hb9hjb9huj36edipgoqqj375k"
  },
  "https://cmu.joinhandshake.com/events/495375": {
    "name": "*Get Your Foot in the Door: Reach Out to Professionals",
    "dates": [
      {
        "start_date": "2020-06-08",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJUqcuiprzMsGdS-jndtaNAWB9D8D9z2wenV",
    "description": "Have you wondered how to reach out to alums and professionals regarding your job search and your applications? Are you tired of sending out resumes and getting no response? \n\nJoin us for a discussion on how to maximize your chances of successfully landing an interview.  In this interactive session, we’ll talk about effective networking using tools such as LinkedIn and CareerShift, and share insider tips for developing professional connections that could lead to your next job. \n\nRegistration is required, to register for the Workshop in Zoom use the link below- PLEASE USE YOUR CMU ANDREW EMAIL:  \nhttps://cmu.zoom.us/meeting/register/tJUqcuiprzMsGdS-jndtaNAWB9D8D9z2wenV\n\nAfter registering, you will receive a confirmation email containing information about joining the workshop.  To log in to the session on the day of the event, follow this link:  https://cmu.zoom.us/j/91751118630",
    "type": "1",
    "event_id": "mcq4jlimkd5ai7u6fbaai0041g"
  },
  "https://cmu.joinhandshake.com/events/509983": {
    "name": "Virtual Session: AT&T Advanced Analytics",
    "dates": [
      {
        "start_date": "2020-06-12",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.joinhandshake.com/events/509983",
    "description": "AT&amp;T Advanced Analytics:\n\nAlison Hu, AVP Advanced Analytics will talk through an analytics use case.  The topic will be how the team is analyzing the impacts of COVID-19 on the business, and how these findings are being used to drive marketing decisions.  \n\nApply to Full-Time Advanced Analytics Role Here:  https://cmu.joinhandshake.com/jobs/3798491\n\nRSVP on Handshake to receive the link to join this virtual webinar.  We will share the video-conferencing link as soon as it's available.",
    "type": "5",
    "event_id": "bdl99s26p1p4419d0k5m0dm5mc"
  },
  "https://cmu.joinhandshake.com/events/511593": {
    "name": "*Start-Up Thinking, presented by Philips",
    "dates": [
      {
        "start_date": "2020-06-16",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJIrdeGgrT0rHNKMZ9aB1HVoOLa4d958_MVX",
    "description": "Attend this virtual seminar to learn best practices for approaching your work with an entrepreneurial/start-up mindset.\n\nRegistration is required: https://cmu.zoom.us/meeting/register/tJIrdeGgrT0rHNKMZ9aB1HVoOLa4d958_MVX\n\nBio on the Presenter\nBill Gaussa is currently the Head of Advanced Innovation at Philips.   As the Head of Advanced Innovation, Bill leads a diverse team of researchers, engineers, and marketers to transform new ideas into new ventures that delight our customers.    Immediately prior to that, Bill served in multiple leadership roles within Philips including leading Strategic Marketing, Advance Research, Clinical and Global Product Management.\nBill has experience across multiple industries with positions at McKesson (healthcare automation), Timesys (embedded software development), Inrange Technologies (IT), and Westinghouse (control systems).  Throughout his career, Bill has built upon his skills in Product Management, Healthcare Information Technology, Innovation Management, and Engineering to redefine how corporations can innovate in like agile startups.\nBill holds a Masters in Business Administration from Carnegie Mellon University and a Bachelor’s Degree in Electrical and Electronics Engineering from the University of Pittsburgh.\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "1",
    "event_id": "7foddik7rdgouc3fi1putfrsd0"
  },
  "https://cmu.joinhandshake.com/events/510892": {
    "name": "Virtual Session: Charles River Associates International",
    "dates": [
      {
        "start_date": "2020-06-18",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJIocuqqpjgtHNEq5bFw8IQ2u2zOj_I7PUlR",
    "description": "Charles River Associates International at Carnegie Mellon University\n\nCharles River Associates is a multi-practice management consulting firm servicing global clients with a robust footprint across North America and Europe. Please join Jake Arakal as he provides an overview of the Life Sciences practice, key service offerings, project experiences, and the exciting opportunities available at CRA.\n\nPosition openings and full descriptions are available at: http://www.crai.com/careers/offices",
    "type": "2",
    "event_id": "litbhpl7r4mf73ikfj0p443t8c"
  },
  "https://cmu.joinhandshake.com/events/511595": {
    "name": "*Design Thinking, presented by Ford Motor Company",
    "dates": [
      {
        "start_date": "2020-06-23",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJwsdeqrpjgpGNAc59PDKcPGbeLqbpyJ0crm",
    "description": "Attend this seminar to learn design thinking methodology for solving complex problems and developing solutions.\n\nRegistration required: https://cmu.zoom.us/meeting/register/tJwsdeqrpjgpGNAc59PDKcPGbeLqbpyJ0crm\n\nDesign Thinking has shaped the modern world by revolutionizing how we interact with products &amp; processes, but the value is not simply limited to physical or mechanical considerations. In this session, we will answer several key questions about Design Thinking, including: \n•\tWhat is Design Thinking?\n•\tWhere has Design Thinking been used?\n•\tWho can benefit from Design Thinking?\n•\tHow can you get started with Design Thinking?\n\nBilly F. Dunn is a Talent Specialist at Ford Motor Company, working on the University Relations team supporting the company’s mission to attract, onboard, and engage the best &amp; brightest talent to advance the spirit of innovation at Ford. Before starting at Ford, Billy spent nearly 15 years working in Government &amp; Higher Education. Billy has graduate degrees from University of Connecticut and the Ohio State University, competes in Strongman &amp; Olympic Weightlifting competitions in his personal time, and has a rescue dog named Bear who may find her way into the presentation.\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "4",
    "event_id": "rqkvj10rnv7uovgvu5q9amqurk"
  },
  "https://cmu.joinhandshake.com/events/510871": {
    "name": "Citadel & Citadel Securities | Summer Invitational Datathon 2020",
    "dates": [
      {
        "start_date": "2020-07-13",
        "end_date": "2020-07-20",
        "start_time": "12:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Datathons are a competition for data-driven, analytically minded students. This competition challenges students from the world's best universities to tackle real-world social challenges in topics like urban traffic, renewable energy, education, and more - all while competing to win $25,000 in cash prizes and interviews for internship and full-time positions at Citadel. The winning team of the competition will also receive the chance to represent their school against other top-tier universities in the Data Open Championship, a grand finale Datathon event in the Spring of 2021, and win a $100,000 cash prize.\n\nIf you are curious to see what a Datathon looks like, we encourage you to check out these videos from our past events:\nDublin Datathon: https://www.youtube.com/watch?v=F0nQJcB8rhI&amp;\n2017 Datathon series finale held at the New York Stock Exchange: https://www.youtube.com/watch?v=LPZ-bbAdwJE&amp;\n\nThe Summer Invitational Datathon is hosted by Citadel LLC &amp; Citadel Securities in partnership with Correlation One. Participants will be able to work remotely on their submissions during the week of July 13, on their own schedule. The winners will be announced on Monday, July 20th in the Awards Ceremony Webinar.\n\nSign up at www.thedataopen.com to complete the registration questionnaire and assessment before the deadline on Thursday, July 9th!",
    "type": "5",
    "event_id": "60l3ah9lqogtnom4lpa5qifcqo"
  },
  "https://cmu.joinhandshake.com/events/512269": {
    "name": "Why Work for KEYENCE?",
    "dates": [
      {
        "start_date": "2020-06-16",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "14:30:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "This session is for Graduated or Graduating Seniors interested in Full-Time Sales opportunities!\n\nPlease join us for this virtual session to find out more about KEYENCE: the biggest company you've never heard of. We'll introduce the company, our Technical Sales opportunities, and why you should apply to join KEYENCE today!\n\nMeeting ID: 812 9577 2620\nMeeting Password: 5eAji1",
    "type": "2",
    "event_id": "i9s76v7b0ui18n3vfvgo2i0034"
  },
  "https://cmu.joinhandshake.com/events/514482": {
    "name": "Virtual Session: Highmark Health",
    "dates": [
      {
        "start_date": "2020-06-17",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJAkcO6pqDgiHdAe3c9lHJ0ZZbhwYsJyCLU6",
    "description": "Highmark Health at Carnegie Mellon University\n\nHighmark Health is joining our Summer Spotlight on Recruitment series on Wednesday, June 17th at 12pm ET. \nRegister now, more details to come.",
    "type": "1",
    "event_id": "gg98vo74rod0n7be2utplusi34"
  },
  "https://cmu.joinhandshake.com/events/514492": {
    "name": "Explore a Gap Year of Service with City Year",
    "dates": [
      {
        "start_date": "2020-06-23",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Considering a gap year? Why not spend it serving in schools helping students reach their potential? Join representatives from City Year to explore the unique experience and benefits.",
    "type": "1",
    "event_id": "fc0m4shv37f8d5nqlgm4nr2lso"
  },
  "https://cmu.joinhandshake.com/events/512623": {
    "name": "CLA Careers - Summer Experience",
    "dates": [
      {
        "start_date": "2020-06-24",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:15:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://www.claconnect.com/events/2020/cla-careers-summer-experience-june-24",
    "description": "It’s a pivotal and exciting time in your life as you prepare to make big decisions on what’s next. CLA is here to share more information about who we are and the opportunities we offer so you can make a decision that’s right for you. Our Summer Experience Program allows you to learn more about the work we do and the diverse career opportunities available.  CLA delivers integrated wealth advisory, outsourcing, audit, tax, and consulting services to help clients succeed professionally and personally.  Join us on June 24 to learn more about the topics listed below. \nWhat it means to be a part of the CLA Family\nThe opportunity to create a customized and inspired career\nHow you can help drive our purpose of “creating opportunities – for our people, our clients, and our communities”\nWho should attend:\nThese sessions are designed for students eager to take a step forward in their inspired career\nSpeakers:\nExecutive team \nYoung Executive Team (YET) \nSummer Experience alumni\nDirector of Campus \nAdditional CLA career professionals\nPlease register by June 22, 2020.\nCan’t make the event?\nFill out the registration and you will receive an email with the recording and slides following the event. Stay informed on local office programs available to you on our event calendar.",
    "type": "2",
    "event_id": "ecibrc6bnvu1jt3pvh9am7j878"
  },
  "https://cmu.joinhandshake.com/events/514565": {
    "name": "Pride at AT&T - Everyone is Part of the Story",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "12:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "http://work.att.jobs/PrideAtATTWebinar",
    "description": "Our focus on equality and human rights have always been part of who we are. In 1975, AT&amp;T became one of the first major American corporations to adopt a policy prohibiting discrimination against employees based on sexual orientation. This #PRIDE month, we reflect on how far we've come, but remain focused on the goals of true equality that still lie ahead.\n\nThis month we are proud to host a panel discussion with some of AT&amp;T’s amazing employees regarding their experiences and involvement in the LGBTQ+ community. At the conclusion of the panel discussion we will have a live Q&amp;A so be sure to bring your questions!",
    "type": "1",
    "event_id": "k68kaq70r650leu097go12gneo"
  },
  "https://cmu.joinhandshake.com/events/511830": {
    "name": "Mobomo: June Digital Career Fair",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://register.gotowebinar.com/register/2341385129930507019",
    "description": "Join Mobomo on Thursday, June 25 from 6 - 7 pm EST for our Digital Career Fair. You'll learn more about our company and our various departments, including Engineering, Project Management, and UX Design.\n\nFollowing the information session, we will announce open positions and hold a brief Q&amp;A session to answer any questions.\n\nIf interested in Mobomo and the tech industry, please register to attend.",
    "type": "1",
    "event_id": "vfjk0l25ni168p72182cqls444"
  },
  "https://cmu.joinhandshake.com/events/514380": {
    "name": "Wealth Management Banking Specialist Virtual Career Event",
    "dates": [
      {
        "start_date": "2020-07-01",
        "end_date": "n/a",
        "start_time": "19:00:00",
        "end_time": "20:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Please join us on Wednesday, July 1st at 7:00p.m. Eastern Time, for our Wealth Management Banking Specialist Virtual Career Event.\n\nAre you interested in launching a career with Bank of America/Merrill Lynch? Do you want to be at the forefront of the future of banking, with the ability to make financial lives better and the power to make a difference?\n\nIf so, we invite you to join us for this interactive event to hear firsthand from some of our leaders and top talent, and learn how you can build a successful career within Wealth Management Banking.\n\nWealth Management Banking Specialists partner with our Merrill Financial Advisors to provide banking solutions to individual wealth management clients with assets generally in the range of $1-10 million.  This includes providing consistent, thorough and transparent experiences that give clients knowledge of banking, digital and credit solutions. Wealth Management Banking Specialists have access to industry leading financial solutions and a team of dedicated product specialists – all designed to meet the unique life priorities of clients – priorities like managing operating expense, building wealth, financing, managing debt, buying a home, saving for college or planning for unexpected life events.  \n\nTraining is provided by our award-winning Academy at Bank of America. This program delivers hands-on practice, personalized coaching and classes that will help Wealth Management Banking Specialists become the specialists they want to be. With demonstrated success, there is career growth and the opportunity to advance in many roles within our company.\n\nIn this interactive webcast our team will:\n\n•\tShare Bank of America benefits\n•\tOffer candid insight on personal career experience\n•\tShow the extensive opportunities available with Bank of America/Merrill Lynch \n\nEvent Times:\n•\t7:00pm-8:00pm ET\n•\t6:00pm-7:00pm CST\n•\t4:00 pm–5:00 pm PT\n\nRegistration for this event is required. After registration, and up to 24 hours prior to the event, email reminders will be sent to include dial-in information for the webinar.",
    "type": "2",
    "event_id": "0ovi6dq009h0d29uvfl7qgk4e8"
  },
  "https://cmu.joinhandshake.com/events/513077": {
    "name": "Hack Asia - Shaping Hong Kong's Tomorrow",
    "dates": [
      {
        "start_date": "2020-07-06",
        "end_date": "2020-07-08",
        "start_time": "00:00:00",
        "end_time": "00:00:00",
        "timezone": "HKT"
      }
    ],
    "location": "https://www.hack.asia/",
    "description": "Jardines has partnered up with some great companies and we are launching Hack Asia 2020 – an online Hackathon to inspire the next generation of innovators and business leaders!\n\nWe’d like to invite you (of any year or subject) to sign up as individuals or teams (or Start-Ups) by 20th June and compete to win internships, up to HK$50,000 cash prizes, and/or the chance to advance a Proof of Concept of their innovative solutions.\nAll winning teams will present their works at the showdown hosted on the main stage of the Start-up Impact Summit 2020.\n\nOn 6-8th July, the 36H Challenges include:\n1.\tAccenture Ready for Take-off\n2.\tDairy Farm Retail Reboot\n3.\tGammon Building Robust Data Foundations\n4.\tHactl Smooth Operators\n5.\tHongkong Land Leveraging Consumer Insights for Tenant Selection\n6.\tHSBC Financial Partner and Operator – Future Financial Solutions\n7.\tJardine Restaurant Group &amp; Microsoft Cooking With AI and Big Data\n8.\tJardine International Motors Creating Exceptional Mobility &amp; Lifestyle Experiences\n9.\tJLL Building a Better World\n10.\tMandarin Oriental Hotel Group Bespoke Experiences for Bespoke Guests\n\nThe participants will get to know, compete and network with the brilliant young minds and innovative start-up teams from all over the world, and to have senior business reps from the partner companies as their mentors and judges!\nMore information can be found at https://www.hack.asia/",
    "type": "5",
    "event_id": "kb18k4d4r53j7e6ffeuaqme9gk"
  },
  "https://cmu.joinhandshake.com/events/514105": {
    "name": "*Storytelling Fundamentals-Establishing Meaningful and Memorable Communication, presented by Accenture",
    "dates": [
      {
        "start_date": "2020-07-17",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJEqc-mqrzkuGtSUZ4cmJCobttPVwWrE9HV9",
    "description": "Registration required: https://cmu.zoom.us/meeting/register/tJEqc-mqrzkuGtSUZ4cmJCobttPVwWrE9HV9\n\nJoin Accenture Leadership in a discussion answering the question: “How can we make our presentations more meaningful and memorable through Storytelling”? We will discuss what challenges with communication occur today and deep dive into the essence of Storytelling including what myths exist and what frameworks and structure can be used to create the best presentation. This will be an engaging event – come ready to learn and provide input!\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "2",
    "event_id": "ff5f31fva75e1enfn268lo4mng"
  },
  "https://cmu.joinhandshake.com/events/516861": {
    "name": "WSJ+ Live: Reporting on Young People During the Pandemic",
    "dates": [
      {
        "start_date": "2020-06-23",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "How well prepared were younger generations to confront a global pandemic? The Wall Street Journal's new team of reporters, WSJ Noted, spent the last few months interviewing more than 100 young people who have been affected by COVID-19. We'll sit down with the Noted team to learn what their reporting revealed.",
    "type": "1",
    "event_id": "ks8pc7n9sdtncd0pkknt6mfc6c"
  },
  "https://cmu.joinhandshake.com/events/517181": {
    "name": "Shopee Design Webinar - Powering Multi-Market Localisation with Systematic Design Processes",
    "dates": [
      {
        "start_date": "2020-06-24",
        "end_date": "n/a",
        "start_time": "04:00:00",
        "end_time": "05:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "Calling all UI/UX designers!\n\nShopee will be organising a webinar session featuring the Design Team’s Senior UI/UX Designer, as she shares with you how Shopee powers Multi-Market Localisation from Systemic Design Processes.\n\nThis webinar will take place on 24 June, and will shed light on the workings of Shopee’s Design Team plus the high-impact user-centered work they do. If you’re interested in learning more about us and how we apply systemic design processes, do join us at our webinar.\n\nGet the opportunity to ask our speaker questions via our registration form, or even during the live Q&amp;A session. Also, stand a chance to hear more about Design career opportunities with Shopee.\n\nRegister here now: https://techatshopee.formstack.com/forms/designwebinar",
    "type": "1",
    "event_id": "ed9ja4m388f0jhb4ag58tcrgc8"
  },
  "https://cmu.joinhandshake.com/events/517190": {
    "name": "Schlumberger Insights - Re-Visioning the Future",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "https://schlumberger.zoom.us/webinar/register/1715923231171/WN_iNaeze3jRU63TcYB-L63og",
    "description": "Come explore our New Product Development side of the company with some of our employees who are pushing the boundaries of what is possible while seeing what a career in Engineering can look like!\nSponsored by: SLB Recruiting Team",
    "type": "1",
    "event_id": "ak7m36skr68nt8d9ovts64s9mc"
  },
  "https://cmu.joinhandshake.com/events/517191": {
    "name": "Schlumberger Pay It Forward Series",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "https://sisevents.webex.com/mw3300/mywebex/default.do?nomenu=true&siteurl=sisevents&service=6&rnd=0.34125762753906075&main_url=https%3A%2F%2Fsisevents.webex.com%2Fec3300%2Feventcenter%2Fevent%2FeventAction.do%3FtheAction%3Ddetail%26%26%26EMK%3D4832534b00000004b99938f871f743cc15d13f1eaae03d7b9880af62b33af1dc2108ff6f330231a1%26siteurl%3Dsisevents%26confViewID%3D164129816109416369%26encryptTicket%3DSDJTSwAAAATs25eFMdP7BNRjG5Ajo38bbNr4dhZGKA9VrZHsOybkow2%26",
    "description": ": See how sustainability efforts effect business performance for ourselves and our clients\nSponsored by: SLB North America Sales Team",
    "type": "1",
    "event_id": "19sss3u62r48i8mg88vg4jihi8"
  },
  "https://cmu.joinhandshake.com/events/515340": {
    "name": "Virtual Job Fair for Teachers - June 25, 2020",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://aaee.org/virtual-career-fair",
    "description": "A great opportunity to build employment connections and prepare for your career in education!\n\nEmployers are eager to share information with you about their districts and their employment opportunities. During this event, you'll be able to connect with PK-12 employers from throughout the U.S., ask your questions, and learn about their culture.  Enjoy all the benefits of attending a career fair from wherever you are located!\n\nYou must pre-register (for FREE) to attend this virtual event.",
    "type": "1",
    "event_id": "h2hi37dhgi148mvf2rcm5buu2c"
  },
  "https://cmu.joinhandshake.com/events/516004": {
    "name": "Cesium Presents: Rendering the World in 3D",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us02web.zoom.us/j/84510674597",
    "description": "Cesium is solving unique problems in both the 3D and geospatial industries and there are problems yet to be solved.\n\nTopics Include:\n- Streaming massive datasets over the web\n- How geospatial rendering differs from traditional game engine rendering\n- Overview of Cesium's 3D tech stack to bring the 3D globe to life",
    "type": "1",
    "event_id": "ap7del93m3g1h43vig39dirtn4"
  },
  "https://cmu.joinhandshake.com/events/517145": {
    "name": "Yelping From Home: The Tech Talk Series",
    "dates": [
      {
        "start_date": "2020-06-25",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "12:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "***Please RSVP via Eventbrite***\n\nYelp’s mission is to connect people with great local businesses, and one of the teams working behind the scenes to make that happen is our five star engineering and product teams.\n\nPlaying an active role in our community is a value that we have strongly prioritized over the years. Typically we would invite you to come to Yelp’s HQ to network, grab a slice of ‘za, and learn about the technology and culture behind Yelp. With stay-at-home orders across the globe, Yelp (like many of you) has had no choice but to adapt to these changes. We understand that this is a strange and challenging time for many, so we’d like to invite you to join us as we navigate this new normal for the tech community together.\n\nTo stay connected, create space for folks to collaborate and share some of the things Yelp has been working on, we are launching our very own virtual tech talk series. This series of talks will feature Yelpers from engineering and product and will focus on themes such as career development, technical skills, workplace challenges and Yelp’s response to COVID-19.\n\nEmil Hessel, Product Manager\nTalk: Good Products in Tough Times\n\n2020 has fundamentally transformed the landscape for local businesses and the customers they serve. For many of us, where and how we get food, shop, and even exercise are dramatically different than they were four months ago. With this, the need to stay up-to-date and connected with the businesses in our communities is more universal than ever. One of Yelp's newest products, Yelp Connect, is designed to fill this need. Join us as we talk about how we built an idea into a product used by thousands of businesses to help in their fight for survival. We'll explain what Yelp Connect is, how it's helping businesses and consumers in today's environment, and some key product insights we picked up along the way.",
    "type": "1",
    "event_id": "ke3p7ublqbuo4m269ro8fvfo54"
  },
  "https://cmu.joinhandshake.com/events/517172": {
    "name": "Post-Covid-19: Business Opportunities, Challenges and Trends in E-Commerce",
    "dates": [
      {
        "start_date": "2020-06-26",
        "end_date": "n/a",
        "start_time": "03:00:00",
        "end_time": "04:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "Calling all students and graduates across the region! Are you curious to understand how Shopee operates in different markets?\n\nTune in to our live panel discussion happening on 26 June, 6.00pm (GMT+8) to learn more!\n\nRepresenting Shopee Philippines, Thailand and Vietnam, our speakers from the Business Development team will be sharing how their teams are propelling the business as well as how our partners can grow with us during this pandemic situation.\n\nAdditionally, we will also highlight some tips for students and graduates who are keen to be a part of our vibrant and fast-growing team, followed by a live Q&amp;A.\n\nRegister at: https://bit.ly/ShopeeJoint-Webinar by 25 June, 11.59pm to secure your spot!",
    "type": "1",
    "event_id": "gin7oisgiglojfgjj74126i66o"
  },
  "https://cmu.joinhandshake.com/events/515644": {
    "name": "Getting career-ready whilst making a difference; globally, domestically or virtually.",
    "dates": [
      {
        "start_date": "2020-06-29",
        "end_date": "n/a",
        "start_time": "19:30:00",
        "end_time": "20:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us02web.zoom.us/j/86462274775",
    "description": "Secure practical skills and industry experience that put you ahead of the graduate pack, whilst achieving a sustainable social impact with an internship that you can do internationally, in rural Australia, or from the comfort of your home! \n\nAt Project Everest Ventures, we believe that tackling global challenges won't be achieved by doing what's always been done before. With three  unique Impact Programs, this is your chance to tailor your own personal and professional growth, gain skills that top recruiters crave, and do work experience that’s not only good...but good for the world.\n\nJoin recent graduates, Abbey and Alice, as they discuss their own experiences of working in international development in a variety of roles with Project Everest, and how they’ve used these skills to cement a successful and fulfilling career path. They’ll be covering topics such as:\n· The UN’s Sustainable Development Goals as collective targetsfor the next 10 years\n· The current state of the world and the importance of these goals for the future of mankind\n· The issues with charity and government when addressing these challenges\n· The concept of of social enterprise and how business can change the world \n· The nature of the working world for grads and how you can effectively prepare during uni.\n· Specifics on how Project Everest  operates in this space; our impact projects and opportunities for students\n· Live Q&amp;A\n\nToo many young people report feelings of helplessness when facing the issues of our time; feeling excluded, helpless or incapable of making a real difference. \n\nHear genuine stories and advice from new STEM graduates, who utilised the available opportunities during their studies to build out their skills, networks and confidence, and ultimately securing graduate employment with a leading social enterprise. \n\nYou’ll leave this session having a better understanding of how business has a core role to play in tackling the today’s biggest challenges, the potential for young minds to greatly contribute and get stuck into making their mark on the world, and the work Project Everest is currently doing: globally and online.",
    "type": "1",
    "event_id": "co6s0tqk09umm2jnl90kr5f19g"
  },
  "https://cmu.joinhandshake.com/events/517163": {
    "name": "Shopee Engineering Webinar - Introduction to Shopee Platform Product Cloud",
    "dates": [
      {
        "start_date": "2020-06-30",
        "end_date": "n/a",
        "start_time": "04:30:00",
        "end_time": "05:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "Attention to all Software Engineers, and Computing &amp; Engineering students!\n\nTech@Shopee will be organising a live webinar on 30 June, featuring @Shopee’s very own software engineer as he introduces more about Shopee Platform Product (SPP) Cloud.\n\nWith the transition from monolithic applications to microservices and containers, there is increasing demand for highly available and scalable middlewares. Join us in this webinar to find out how the SPP team manages to satisfy various user requirements by Shopee Platform Product Cloud.\n\nWhat to expect:\n- Introduction of Shopee Platform Product Cloud\n- How do we design the platform to support various cloud products\n- How do we support hybrid orchestration with containers and virtual machines\n\nSign up here to register your interest for the webinar, and learn more about our platform engineering openings in Singapore!\n\n#TechatShopee",
    "type": "1",
    "event_id": "c0032lm7sn3km0di7hsur2b4gg"
  },
  "https://cmu.joinhandshake.com/events/517070": {
    "name": "*Introduction to Project Management, presented by Gartner",
    "dates": [
      {
        "start_date": "2020-07-13",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJAsdeqopzgvHN0eod50wXm_ScyUA5jziex5",
    "description": "Gartner is excited to be discussing how to approach problems while project managing. Learn what it is like to be a business associate working on Gartner’s toughest problems day to day. \n\nRegistration is REQUIRED here: https://cmu.zoom.us/meeting/register/tJAsdeqopzgvHN0eod50wXm_ScyUA5jziex5\n\nSean Kim is a 2017 Carnegie Mellon Alumnus. He graduated with a degree in Business and Information Systems. Sean joined Gartner straight out of Carnegie Mellon into the Services Leadership Program. He is currently a Senior Business Associate with Gartner’s Premium Services Team. The majority of his work involves process optimizations and change management through technology. \n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "1",
    "event_id": "ljg0iliin3mpbcv2gn7t7flpc8"
  },
  "https://cmu.joinhandshake.com/events/499567": {
    "name": "STPF Live Chat: Let’s Talk About the Program Areas",
    "dates": [
      {
        "start_date": "2020-07-16",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Join us on July 16 at 2-3 p.m. ET for the third of a six-part live chat series with fellows. Get answers to your questions from current fellows and staff! Hear what it's like to be a fellow in all three branches of the federal government.\n\nThe AAAS Science &amp; Technology Policy Fellowships is a paid, yearlong opportunity for professional development and public service for outstanding scientists, social scientists and engineers. Fellows come from a wide range of disciplines, sectors and career stages. Fellows are postdocs, faculty on sabbatical, and other scientists and engineers looking to develop new skills as they grow in their careers.\n\nThe AAAS S&amp;T Policy Fellowships (STPF) are open to U.S. citizens who hold doctoral-level degrees in any of the following:\n\n• Biological, Physical or Earth Sciences.\n• Medical and Health Sciences.\n• Social and Behavioral Sciences.\n• Computational, Information &amp; Data Sciences.\n• Mathematics &amp; Statistics.\n\nIndividuals with a MS in Engineering plus three years of professional experience are also eligible for this program.",
    "type": "1",
    "event_id": "smlpbdqmoogvt3fuort3mscnik"
  },
  "https://cmu.joinhandshake.com/events/516546": {
    "name": "Annapurna Partners (Real Estate Private Equity) - Virtual Info Session with Principal Michael Mogull&nbsp;&nbsp;",
    "dates": [
      {
        "start_date": "2020-07-16",
        "end_date": "n/a",
        "start_time": "17:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us04web.zoom.us/j/571840640?pwd=SjhWdFovM2V2WFFhYzEwbGEvbnpWUT09",
    "description": "You will Learn:\n-How Mr. Mogull initially got into the real estate business and his background in the space over the last two decades.\n-What Mr. Mogull's role is as Managing Principal of a real estate PE firm.\n-What makes Annapurna different in their approach to the real estate private equity space.\n-How to leverage the mentorship offered through our internship academy to compress time frames for career growth as a business leader and real estate professional.\n-You will learn about the various employment opportunities available within our rapidly growing team. Current job opportunities include Acquisitions (Business Development) roles and Annapurna Academy, a 24-month internship/apprenticeship training program.\n-What intrinsic character traits Annapurna looks for when he is recruiting future leaders for the firm.\n-The pros and cons of working for a larger company versus a smaller company at the beginning of your career, and what Mr. Mogull wishes he did differently himself.\n-Why the COVID 19 pandemic is not something we see as a long term impediment to our growth.\n\n\n\nABOUT US:\nAnnapurna Partners is a private real estate investment, development, and management firm. We identify commercial real estate opportunities by taking an entrepreneurial approach to creating stakeholder value. Our strategies are opportunistic, focusing on building value and mitigating risk while leveraging relationships with our large network of strategic sponsors and advisors throughout the United States. This team identifies, analyzes, develops, and operates investments from start to finish. Based in Fort Lauderdale, Annapurna Partners employs a strong team of corporate, financial, and operational and construction professionals.\n\nTo learn more, please visitwww.annapurnapartners.com",
    "type": "1",
    "event_id": "pm392asbqnf1945ib7kjjvsl88"
  },
  "https://cmu.joinhandshake.com/events/515187": {
    "name": "2020 Virtual Hispanic/Latinx Possibilities Summit",
    "dates": [
      {
        "start_date": "2020-07-20",
        "end_date": "2020-09-30",
        "start_time": "00:00:00",
        "end_time": "00:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Goldman Sachs is committed to supporting students who identify as Hispanic/Latinx\n \nThis year, through our Virtual Hispanic/Latinx Possibilities Summit, we are excited to offer new and innovative content designed to provide students with tangible, resume-enhancing skills, networking opportunities with members of our Firmwide Hispanic/Latinx network, and interactive workshops and coaching designed to navigate the Goldman Sachs interview process. Accepted students will have the opportunity to participate in a first-round interview for either a 2021 summer or full-time analyst position for the division(s) they are selected for. \n\nVirtual Hispanic/Latinx Possibilities Summit: \nDates: July - September 2020\nEligibility Requirements: Undergraduate students who identify as Hispanic/Latinx graduating between December 2020 and May 2022.\n\nApplication Deadline: \n\nJuly 12th at 11:59 PM ET\n\nAfter registering for this event, please complete the following steps to ensure that your application is reviewed:\n1. As soon as you register, you will be asked to complete an inbox task. We encourage you to complete this questionnaire immediately. \n2. Following review, finalists will be notified and asked to submit a formal application for either a 2021 Summer or New (Full-Time) Analyst role within the division(s) they are selected for.\n\nIf you do not submit your inbox task your application will be marked incomplete, and you will not be considered to attend the event. \n\nGot a question? Feel free to reach out to us at diversityrecruiting@gs.com.",
    "type": "1",
    "event_id": "daghp6i7vc50pvghejoih9song"
  },
  "https://cmu.joinhandshake.com/events/515693": {
    "name": "Day in the Life of AmeriCorps Service",
    "dates": [
      {
        "start_date": "2020-07-23",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you interested in learning more about Habitat for Humanity’s AmeriCorps Program? Join us to explore the AmeriCorps Program through a Day in the Life, an interactive webinar featuring staff and current AmeriCorps members.",
    "type": "1",
    "event_id": "s50jptom6ufpf5midikf7tmvmc"
  },
  "https://cmu.joinhandshake.com/events/516275": {
    "name": "CBP Women in LEO Webinar/Talk Live to USBP/CBP OFFICER/Trade/OIT/Air and Marine Agent",
    "dates": [
      {
        "start_date": "2020-07-28",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "ARE YOU READY FOR YOUR NEXT CHALLENGE?\n\nATTEND A WEBINAR WITH US CUSTOMS AND BORDER PROTECTION AND LEARN FROM OTHER WOMEN ABOUT JOINING THE LARGEST LAW ENFORCMENT AGENCY.  WOMEN FROM US BORDER PATROL, OFFICE OF FIELD OPERATION-CBP OFFICER, OFFICE OF AIR AND MARINE - AIR AND MARINE AGENT, OFFICE OF TRADE, OFFICE OF INFORMATION AND TECHNOLOGY.\n\nhttps://bit.ly/3cvUwGC",
    "type": "1",
    "event_id": "dq1pona2lvda2vk0i8tk45emi8"
  },
  "https://cmu.joinhandshake.com/events/521591": {
    "name": "GSA Artificial Intelligence and Machine Learning End-User License Agreement Challenge 2020",
    "dates": [
      {
        "start_date": "2020-07-06",
        "end_date": "2020-08-20",
        "start_time": "10:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "No location",
    "description": "GSA Artificial Intelligence and Machine Learning End-User License Agreement Challenge 2020\n\n\n TOTAL CASH PRIZES OFFERED: $20,000\n TYPE OF CHALLENGE: Software and apps\n SUBMISSION START: 07/06/2020 10:00 AM ET\n SUBMISSION END: 08/20/2020 05:00 PM ET\n\nDescription\n\nThe goal of this challenge is to develop an artificial intelligence (AI), or machine learning (ML) solution that will review end-user license agreements (EULA) for terms and conditions that are unacceptable to the government. On average it takes all parties involved approximately 7-14 days to review an EULA and ensure that all unacceptable terms and conditions are identified.\n\nA EULA details the rights and restrictions which apply to the use of software or services. It can also be known as a software license agreement or acceptable use policy. As part of the acquisition process of software or services, GSA reviews the associated EULAs. This review must be completed prior to awarding new contracts or modifying existing contracts. A GSA contracting officer (CO) reviews applicable EULAs for terms and conditions that are not in accordance with Federal law and regulations. The CO may also coordinate a legal review with the Office of General Counsel if they feel it is warranted. Should EULAs contain language that would conflict with Federal law and regulations, the CO must negotiate changes to the EULA to remove the problematic language.\n\nWe are looking for a solution that will use AI and/or ML to improve this manual process. The solution will include a user interface that GSA will use to process the documents and identify unacceptable clauses/terms in the EULAs. Watch our AI / ML challenge video to learn more about the desired solution.\n\nThis solution will decrease the time spent manually reviewing EULAs and free resources to focus on other aspects of the acquisition process. It will also improve the accuracy and consistency of the review process.\n\n\nYoutube video announcing GSA ML/AI Challenge - https://youtu.be/uOBFIqoOJ8k\n\nWebsite with complete details - https://www.challenge.gov/challenge/GSA-artificial-intelligence-AI-machine-learning-ML-challenge/\n\nKey Facts:\n·      Registration begins: 10 a.m. ET, July 6, 2020\n·      Submit solutions before: 5 p.m. ET, August 20, 2020\n·      Semi-finalists announced: 10 a.m. ET, September 4, 2020\n·      Winner announced: 10 a.m. ET, September 11, 2020\n·      Each challenge solver (individual, team, or legal entity) is required to register by sending an email to challenge2020@gsa.gov with the subject line stating ‘Challenge 2020 Registration’.\n\n·      Cash prizes for winning teams:\no  1st place team: $15,000.00\no  2nd place team: $2,500.00\no  3rd place team: $2,500.00\n\n·      Questions? emailchallenge2020@gsa.gov for more information.",
    "type": "1",
    "event_id": "1u0vcs7rd660pnnk1gj2mpe58c"
  },
  "https://cmu.joinhandshake.com/events/519730": {
    "name": "HubSpot Women in Sales Webinar Series: Growing Your Career in Sales",
    "dates": [
      {
        "start_date": "2020-07-07",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Studies by Deloitte and PWC show that the leading benefit working professionals want in a job is the opportunity for career growth and development.\n\nAt HubSpot, we encourage employees to think about career growth not just in terms of advancing to that next level but investing in your long term development too.\n\nWe've gathered some of our top reps and sales managers across our Bogota, Dublin, and Cambridge sales teams to discuss growing your sales careers in a way that makes sense for you, whether that means a path into management, or expanding your impact as an individual contributor on a team. Expect to hear each panelists’ personal career growth story, top tips for growing in a sales role, and how to accelerate growth with critical feedback.",
    "type": "1",
    "event_id": "nhfiidlt9pqkpen7jmv2s5d94k"
  },
  "https://cmu.joinhandshake.com/events/521090": {
    "name": "Entry Level Business Data Analysts",
    "dates": [
      {
        "start_date": "2020-07-07",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us02web.zoom.us/j/94174885010",
    "description": "",
    "type": "1",
    "event_id": "fp3i5f3hbu1k1vuratg1cknpjg"
  },
  "https://cmu.joinhandshake.com/events/515999": {
    "name": "Cesium Presents: Rendering the World in 3D",
    "dates": [
      {
        "start_date": "2020-07-09",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://us02web.zoom.us/j/84510674597",
    "description": "Cesium is solving unique problems in both the 3D and geospatial industries and there are problems yet to be solved.\n\nTopics Include:\n- Streaming massive datasets over the web\n- How geospatial rendering differs from traditional game engine rendering\n- Overview of Cesium's 3D tech stack to bring the 3D globe to life",
    "type": "1",
    "event_id": "hh5qtju4u0r813g93fhk17hpdk"
  },
  "https://cmu.joinhandshake.com/events/521479": {
    "name": "Yelping From Home: The Tech Talk Series",
    "dates": [
      {
        "start_date": "2020-07-09",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "To stay connected, create space for folks to collaborate and share some of the things Yelp has been working on, we are launching our very own virtual tech talk series. This series of talks will feature Yelpers from engineering and product and will focus on themes such as career development, technical skills, workplace challenges and Yelp’s response to COVID-19.\n\nTalk: Creating Meaningful Data Through Rich Contextual Logging Across Microservice\n\nAs engineers, we need data to support our decisions. However, it is a huge step from “we have data” to “we have meaningful data”. At Yelp, we use contextual logging to allow data consumers to connect any data sources. In this talk, Kangni will talk about how contextual logging is adopted across Yelp’s microservices via context propagation, and the challenges we encountered.\n\nKangni Wang\nBio: Kangni has been a software engineer on the experimentation team at Yelp for the last 2.5 years. Prior to Yelp, she completed her Bachelor's degree in Computer Science at Harvey Mudd College.\n\nTalk: Fuelling Your Career With Coffee Chats\n\nOne of the best ways to meet people and launch your career is to set up short chats over coffee. But, there are no guidelines and it can be daunting to start. We'll go over the individual stages of a coffee chat, from asking someone to transforming it into a mentorship. You’ll pick up tools to have meaningful conversations and walk away with a game plan to get started!\n\nSherry Yuan\nBio: Sherry is an Android engineer at Yelp working on the Yelp for Business Owners Android app. Prior to starting at Yelp, she studied computer science at the University of British Columbia, where she started a coffee chat program with Daphne. She is passionate about Android development, diversity in tech, and creative and technical writing.\n\nDaphne Liu\nBio: Daphne is an Android engineer who enjoys meeting new people and branching out outside her team. She shares her interests in tech, mentorship and diversity by speaking at conferences, writing blogs, and being involved with the Women in CS club she founded at her university. She is currently finishing up her last year of school at the University of British Columbia.",
    "type": "1",
    "event_id": "4ub519vak18hp5947sspmgk7rg"
  },
  "https://cmu.joinhandshake.com/events/518048": {
    "name": "Intro to Bain Webinar (2 of 2)",
    "dates": [
      {
        "start_date": "2020-07-09",
        "end_date": "n/a",
        "start_time": "20:00:00",
        "end_time": "21:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://careers.bain.com/recruits/EventDetail?folderId=34186",
    "description": "Join Bain &amp; Company at 8PM EDT to learn more about their Associate Consultant and Associate Consultant Intern roles! They will be hosting two webinars. Each webinar will cover the same material; please register for the best date/time that works for you.",
    "type": "1",
    "event_id": "ptuus4cg4d94bmqg43sgg30eq8"
  },
  "https://cmu.joinhandshake.com/events/513352": {
    "name": "Acelero Learning Virtual Info Session: Learn how your degree could help close the achievement gap.",
    "dates": [
      {
        "start_date": "2020-07-15",
        "end_date": "n/a",
        "start_time": "10:00:00",
        "end_time": "11:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "We are hosting a virtual information session to learn how your education could help to close the achievement gap. We have locations in Las Vegas NV, Philadelphia PA, Camden NJ, and Wisconsin. Perhaps like many students, you are unsure what to do after graduation. You will learn about our organizational culture, our competitive benefits and understand our passion to achieve stellar academic outcomes for children of all abilities.\n\nAt Acelero Learning, we believe all children can achieve and succeed, and we work to empower families to advocate for their children and themselves. Our mission is to bring a relentless focus on positive family and child outcomes to close the achievement gap and build a better future for children, families, and communities served by the Head Start program.",
    "type": "1",
    "event_id": "kpmdm8ieo80err56o4pq5d7e8o"
  },
  "https://cmu.joinhandshake.com/events/519776": {
    "name": "*Communicate to Connect: Brand Storytelling , presented by Merck",
    "dates": [
      {
        "start_date": "2020-07-21",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJYpc-uvpzktE9CKFrVpkbd2dPOoc2QddmhJ",
    "description": "Learn how to inform and inspire audiences, regardless of venue or medium. At the end of this presentation, you will have developed the basic skills to raise your external profile through dynamic delivery, inspire engagement with persuasive presentation, and increase awareness through compelling content.\n\nRegistration is required: https://cmu.zoom.us/meeting/register/tJYpc-uvpzktE9CKFrVpkbd2dPOoc2QddmhJ\n\nPresenter: Craig Thomason is Head of Creative Engagement and co-founder of imagine@Merck, a safe, unapologetic platform for new ideas that challenge the status quo.  For over two years he has been instrumental in forming a global community of Storytellers whose purpose is to give voice to new ideas that challenge the status quo.  A two-time TEDx speaker and speaker coach, Craig is responsible for creating the imagine Speaker Experience, a 12-week immersion program designed to help speakers deliver powerful presentations in the style of TED.  Craig has also created Communicate to Connect for Leaders and Communicate to Connect for Organizations, workshops that assist individuals and teams in learn and employing the art and science of human centered communication.  Craig has studied digital video production, has a Bachelor’s in Writing and has spent nearly a decade at Merck.\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "1",
    "event_id": "2m2o89ku3sucem2g2b4jgfu7uc"
  },
  "https://cmu.joinhandshake.com/events/517792": {
    "name": "*VIRTUAL Evaluating and Negotiating Your Return Internship Offer for Engineering and SCS Graduate Students",
    "dates": [
      {
        "start_date": "2020-07-24",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJwvcuioqTwpHddn79DNfkPgSYI2jBX_n2rt",
    "description": "Register on Zoom  USING YOUR ANDREW EMAIL ADDRESS: https://cmu.zoom.us/meeting/register/tJwvcuioqTwpHddn79DNfkPgSYI2jBX_n2rt\n\nThis presentation is led by the Engineering / SCS Graduate Career Consultants to help you learn how to negotiate and effectively evaluate your return internship offer. \n\nTopics covered:\n-How to negotiate, when to negotiate, and the best way to interact with your future employer\n-Appropriate questions to ask during the offer process\n-How to turn down an offer while maintaining a professional relationship with the employer\n-What to say and write when responding to an offer\n-Ethical expectations and deadlines when considering a returning internship job offer\n\nAfter registering, you will receive a confirmation email containing information about joining the workshop. To log in to Zoom for the workshop use this link: https://cmu.zoom.us/j/98251077373?pwd=WTVUclQrSzR0ai9Ra0dIWDZhNmFVZz09",
    "type": "1",
    "event_id": "ip87rj4dm787rmjpj8facqbc6o"
  },
  "https://cmu.joinhandshake.com/events/521732": {
    "name": "*The New Normal – Virtual Collaboration for All, presented by AEO Inc.",
    "dates": [
      {
        "start_date": "2020-07-29",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJIsf-uorT0vEtJFkKHAg8pgTBrnN3MBn2eQ",
    "description": "The impacts of COVID-19 created a virtual world for companies and individuals overnight! Learn how the AEO Inc. Technology team quickly pivoted to provide our associates with the ability to complete business critical functions remotely, and how you can use these best practices with your team in the future. \n\nRegistration required: https://cmu.zoom.us/meeting/register/tJIsf-uorT0vEtJFkKHAg8pgTBrnN3MBn2eQ\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "1",
    "event_id": "nhn7p1tih57i6va1rn00v6mnjg"
  },
  "https://cmu.joinhandshake.com/events/503195": {
    "name": "NNSA Graduate Fellowship Program Virtual Information Session August 24, 2020",
    "dates": [
      {
        "start_date": "2020-08-24",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://pnnl.zoomgov.com/webinar/register/WN_5imX7_-3T4mLzo00jBONTw",
    "description": "Register in advance for this webinar: (UPDATED LINK BELOW)\nhttps://pnnl.zoomgov.com/webinar/register/WN_5imX7_-3T4mLzo00jBONTw \n\nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer: \n• Hands-on experience in national security and nonproliferation; \n• Career development, professional networking, and specialized training events; and \n• Extensive interaction and collaboration with leading national security technology and policy experts.\n\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021.",
    "type": "1",
    "event_id": "6ju3ma7bts5tar81072fpvc8lo"
  },
  "https://cmu.joinhandshake.com/events/518215": {
    "name": "DRW Virtual Information Session",
    "dates": [
      {
        "start_date": "2020-09-02",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "No location",
    "description": "DRW will be hosting a virtual information session where students will hear from our traders, software developers, and researchers on their roles within the company. Students will also be able to learn more about job opportunities, both full-time and internships, and discuss the hiring process with recruiters.",
    "type": "1",
    "event_id": "b3r4ebmmu2b1ld6fvnvnq6qack"
  },
  "https://cmu.joinhandshake.com/events/503199": {
    "name": "NNSA Graduate Fellowship Program Virtual Information Session September 10, 2020",
    "dates": [
      {
        "start_date": "2020-09-10",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://pnnl.zoomgov.com/webinar/register/WN_5oeM99QNSFOCoBLB8-FujA",
    "description": "Register in advance for this webinar: (UPDATED LINK BELOW)\nhttps://pnnl.zoomgov.com/webinar/register/WN_5oeM99QNSFOCoBLB8-FujA \n\nFellowships Available: Protect our nation’s security as a Department of Energy NNSA Graduate Fellow. NGFP is seeking highly motivated graduate-level students to grow as the next generation of national security leaders. The one-year, salaried (with benefits) fellowships offer:\n• Hands-on experience in national security and nonproliferation;\n• Career development, professional networking, and specialized training events; and\n• Extensive interaction and collaboration with leading national security technology and policy experts.\n\nThese positions are open to students actively pursuing their master’s or doctoral degree as well as students who have achieved their graduate degree within the past 18 months. Details about the program can be found on at https://www.pnnl.gov/projects/ngfp The current application deadline is October 2, 2020 for positions that will begin in June 2021.",
    "type": "1",
    "event_id": "goiqhsj0ruph9f4oggtekikn94"
  },
  "https://cmu.joinhandshake.com/events/499516": {
    "name": "Accenture Strategy Coffee Chats",
    "dates": [
      {
        "start_date": "2020-09-18",
        "end_date": "n/a",
        "start_time": "10:00:00",
        "end_time": "12:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "CPDC - Interview Center (Cohon Center, LL), CPDC Conference Room, Cohon Center - Lower Level, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA",
    "description": "Accenture Strategy is hosting coffee chats! Bring your thirst for knowledge (and coffee!) to learn more about our company, culture and how we can help you take the next step in your career adventure. Some of our CMU campus team members and Strategy business representatives will be on site at this informal event to network and answer all of your questions. Feel free to drop in and out at times that work for you!",
    "type": "1",
    "event_id": "pbtkes74orp7ui0in0jfa4vlnk"
  },
  "https://cmu.joinhandshake.com/events/495869": {
    "name": "Lenovo's Virtual info session",
    "dates": [
      {
        "start_date": "2020-09-22",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://teams.microsoft.com/l/meetup-join/19%3ameeting_ZGE1YjU0N2ItOWNlNC00OGFkLWJkZjgtZDE0YTE0NzI5ZjU2%40thread.v2/0?context=%7b%22Tid%22%3a%225c7d0b28-bdf8-410c-aa93-4df372b16203%22%2c%22Oid%22%3a%229a0f28df-f1d4-4b2e-afa2-fbb687551f40%22%7d",
    "description": "Lenovo is looking for passionate, driven individuals who want to make an impact in a fast-paced global technology environment. At Lenovo, we are a community of innovative thinkers, risk-takers, and people who challenge the status quo. We are one of Interbrand’s 100 BEST global brands, BCG's 50 most innovative companies, and #212 in the Fortune 500 list. From smartphones and smart homes to PC’s and data centers, Lenovo is dedicated to transforming our customers’ experience by enhancing and elevating human capability through technology. \n\nLenovo is excited to offer: \n- Summer Internships \n- Co-op \n- Full-time positions, including 4 rotational programs. \n\nWe have positions both for TECHNICAL and BUSINESS backgrounds! \n\nApply today http://lenovocareers.com to help us define our world of tomorrow.",
    "type": "1",
    "event_id": "4fpf1eb39cvpfd36or3tc2pr4s"
  },
  "https://cmu.joinhandshake.com/events/523796": {
    "name": "LIVE at the Keyot Cafe: It's Summer and You're Unemployed",
    "dates": [
      {
        "start_date": "2020-07-14",
        "end_date": "n/a",
        "start_time": "11:30:00",
        "end_time": "13:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Summer 2020 was supposed to be one of the best economic job markets, but it has turned out to be one of the worst. Was your summer internship cancelled? Was your full-time offer rescinded? Are you on the job hunt? You are not alone. Keyot invites you to attend an upcoming virtual event LIVE from the Keyot Café on July 14, 2020 discussing how to differentiate yourself in a tough job market. Our panelists consist of a Fortune 1000 hiring manager, an experienced recruiter, and an upcoming college graduate whose experience you may relate to. They will provide tips, advice, and answer live questions from event attendees. \n\nOne of the best things you can do during this time is take control over what is in your sphere of influence – starting with attending this event. Feel free to invite your friends or network! This event is open to all recent and soon-to-be college graduates. \n\nKeyot is a women-owned management consulting company. We prepare and enables young professionals to enter corporate project delivery roles through our innovative Crew212 program. By placing these highly motivated Crew212 consultants at the right assignment at a client, and mentoring them for up to two years, close to 500 young people in 10 states are now thriving in careers to which they never would have had access.",
    "type": "2",
    "event_id": "2bcjt97rnm4kfofapubouq0lqc"
  },
  "https://cmu.joinhandshake.com/events/523495": {
    "name": "Introduction to Prototyping in Augmented Reality",
    "dates": [
      {
        "start_date": "2020-07-14",
        "end_date": "n/a",
        "start_time": "19:00:00",
        "end_time": "20:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Learn to apply interactions to a dynamic 3D object in augmented reality. Implement effective UI and UX concepts through AR best practices and the industry’s most commonly used tools – Unity 3D Engine and Vuforia.\nVuforia is a powerful Augmented Reality platform that allows you to quickly deploy interactive 3D experiences. Used by enterprise and consumer-facing products, Vuforia is a critical tool to learn for any AR creator.",
    "type": "5",
    "event_id": "fsmo79gdom6lfaf28sqpnoiurc"
  },
  "https://cmu.joinhandshake.com/events/521958": {
    "name": "Mobomo: July Digital Career Fair",
    "dates": [
      {
        "start_date": "2020-07-15",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://attendee.gotowebinar.com/register/5307436493112092427",
    "description": "Join Mobomo on Wednesday, July 15 from 6 - 7 pm EST for our Digital Career Fair. You'll learn more about our company and our various departments, including Engineering, Project Management, and UX Design.\n\nFollowing the information session, we will announce open positions and hold a brief Q&amp;A session to answer any questions.\n\nIf interested in Mobomo and the tech industry, please register to attend.",
    "type": "1",
    "event_id": "9pg0lh4i60f6viehehqs6ibjog"
  },
  "https://cmu.joinhandshake.com/events/523168": {
    "name": "Virtual Chat with the Actuaries!",
    "dates": [
      {
        "start_date": "2020-07-16",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "15:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Aon plc (NYSE:AON) is a leading global professional services firm providing a broad range of risk, retirement and health solutions. Our 50,000 colleagues in 120 countries empower results for clients by using proprietary data and analytics to deliver insights that reduce volatility and improve performance.",
    "type": "2",
    "event_id": "40kf6ufp0fo4jtmd6oaejnkdps"
  },
  "https://cmu.joinhandshake.com/events/522678": {
    "name": "SLB Insights: A Day in the Life of a Manufacturing & Sustainability Engineer",
    "dates": [
      {
        "start_date": "2020-07-21",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "https://schlumberger.zoom.us/webinar/register/2915935264030/WN_EBHGt-epTRqYGYjuYTFxOg",
    "description": "Come learn about the in's and out's of what our Manufacturing and Design Engineers' life and careers look like. You will be guided by some up and coming engineers within the company, learn what type of projects they have worked on so far, and hear their insights to culture, learning programs and career development.",
    "type": "4",
    "event_id": "biujaletnlgm2ru98hu47ajbl8"
  },
  "https://cmu.joinhandshake.com/events/523238": {
    "name": "Innovation in Technology at Moody's",
    "dates": [
      {
        "start_date": "2020-07-21",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://moodys.zoom.us/j/91710468405",
    "description": "Moody's is an essential component of the global capital markets, providing credit ratings, research, tools and analysis that contribute to transparent and integrated financial markets. Moody's Corporation is the parent company of Moody's Investors Service, which provides credit ratings and research covering debt instruments and securities, and Moody's Analytics, which offers leading-edge software, advisory services and research for credit and economic analysis and financial risk management.\n\nThe current landscape of emerging technology is driving innovation at Moody’s within the Moody’s Analytics Accelerator (MAA). During this event you will hear from our Senior Director of Machine Learning on where AI is today in technical feasibility and business impact on the financial services industry. Join us if you are interested to hear how Moody’s is leveraging AI and Machine Learning to build new solutions!\n\nIn addition, during this event we will share information on how to apply to our Moody’s Analytics Technology Rotation program, which allows for a rotation within the MAA. If interested in attending, please register for the event via Handshake!\n\nFor more details about the MATR program – go to our website at https://careers.moodys.com/students-and-graduates/moodys-analytics-technology-rotation-program/.",
    "type": "5",
    "event_id": "j6kk4okat83hresahi0nrmfdgc"
  },
  "https://cmu.joinhandshake.com/events/523496": {
    "name": "Kaiser Permanente Summer Speaker Series: Mental Health and Resilience",
    "dates": [
      {
        "start_date": "2020-07-21",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "At Kaiser Permanente, we’re committed to helping shape schools to be healthy and vibrant places of learning and development for all.\n\nJoin a discussion to learn more about what Kaiser Permanente is doing to support mental health and resilience in schools through RISE, as well as hear about our Playbook ‘Planning for the Next Normal at School’.\n\nWe will also host a Q&amp;A session to answer any questions you may have!",
    "type": "4",
    "event_id": "0u0sec91dgpm018v3ifb0khht4"
  },
  "https://cmu.joinhandshake.com/events/523464": {
    "name": "*Design Thinking, presented by PwC",
    "dates": [
      {
        "start_date": "2020-07-22",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJIucOugpzguEtCxJSoua7L6aahHdsoyNmFi",
    "description": "Attend to learn best practices in design thinking and strategies to apply the concepts to your work.\n\nRegistration is required: https://cmu.zoom.us/meeting/register/tJIucOugpzguEtCxJSoua7L6aahHdsoyNmFi\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "2",
    "event_id": "5sqple3tvqss0hpk66bgoo3ghs"
  },
  "https://cmu.joinhandshake.com/events/515022": {
    "name": "2020 Corporate & Strategy Women's Summit",
    "dates": [
      {
        "start_date": "2020-07-29",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "This event will give students with a grad range of Dec 2021 - June 2022 the opportunity to hear the stories of Women Leaders at our firm, and learn about opportunities available within Corporate &amp; Strategy: Internal Audit Analyst Program, Corporate Analyst Development Program, Global Finance &amp; Business Management Analyst Program, and the Chase Leadership Development Program. Those who self-identify as women are highly encouraged to apply. \n\nEach program hires a summer intern class, which is the leading pipeline into each program’s full-time opportunity upon graduation.\n \nStudents will need to fill out an application for this event, as well as complete a Hirevue pre-recorded video interview. Recruiters will extend invitations to students who show high interest in the financial services industry, our represented programs, and the potential to start their career with us as an intern in 2021.\n\nPlease register by Wednesday, July 15th using the following link: https://jpmc.recsolu.com/external/events/UO3fIea1PHiIXn9pNjNF8g",
    "type": "2",
    "event_id": "s3ocqblug6h9d46c92j9cbsu4k"
  },
  "https://cmu.joinhandshake.com/career_fairs/17360": {
    "name": "VIRTUAL EVENT: Carnegie Mellon University Alumni Virtual Career Fair 2020 Part 2",
    "dates": [
      {
        "start_date": "2020-08-12",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Are you still looking for a full-time job? Not to worry! Back by popular demand, The Carnegie Mellon University Alumni Virtual Career Fair2020 Part 2 is an opportunity to connect with employers who are hiring for all roles.  This is the second time we have held a virtual career fair for the CMU Alumni population so you will not want to miss out! If you are a current student you may attend this fair if you have graduating in August 2020.\nThe CMU Alumni Virtual Career Fair occurs on August 12th from 1:00pm - 3:00pm EDT.  Please note the following reminders and instructions for the event. \nWe will be using Handshake for the virtual fair and it will allow you to browse 1:1 and group meetings with over ​numerous employers:  \nWe know this is likely your first ever virtual fair experience and you might be unsure how to  prepare. Here are some resources to help you get started:   ● How to register for virtual career fair sessions in Handshake ● Handshake’s Guide to Success at Virtual Career Fairs   If you’re looking for more guidance on navigating a virtual career search, we are here for you!  The ​CMU CPDC and the Alumni Association is available to help you before, during, and after the fair.  Don’t hesitate to email us any questions. We are looking forward to seeing you virtually at the fair! \ncareer@andrew.cmu.edualumni-email@andrew.cmu.edu",
    "type": "1",
    "event_id": "55ctg02eegqh5u00ordg1e1up0"
  },
  "https://cmu.joinhandshake.com/events/525311": {
    "name": "Yelping From Home: The Tech Talk Series",
    "dates": [
      {
        "start_date": "2020-07-21",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "**Please RSVP through Eventbrite**\n\nYelp’s mission is to connect people with great local businesses, and one of the teams working behind the scenes to make that happen is our five star engineering and product teams.\n\nPlaying an active role in our community is a value that we have strongly prioritized over the years. Typically we would invite you to come to Yelp’s HQ to network, grab a slice of ‘za, and learn about the technology and culture behind Yelp. With stay-at-home orders across the globe, Yelp (like many of you) has had no choice but to adapt to these changes. We understand that this is a strange and challenging time for many, so we’d like to invite you to join us as we navigate this new normal for the tech community together.\n\nTo stay connected, create space for folks to collaborate and share some of the things Yelp has been working on, we are launching our very own virtual tech talk series. This series of talks will feature Yelpers from engineering and product and will focus on themes such as career development, technical skills, workplace challenges and Yelp’s response to COVID-19.\n\nTalk: Why you should pursue public speaking and how to get there\n\nStarting a tech career as a minority is challenging. It could mean being the only one to speak against the popular opinion, or becoming more visible to get the same level of recognition.\n\nPublic speaking helps you achieve that and more. This talk shares tips on how to overcome the fear and ways to get started. Attendees will be prepared to brace for presenting from a team meeting to a conference.Yenny Cheung",
    "type": "5",
    "event_id": "0tnngehsosoh9golo76ic4set4"
  },
  "https://cmu.joinhandshake.com/events/524680": {
    "name": "Standard Chartered 2021 Financial Markets Information Session",
    "dates": [
      {
        "start_date": "2020-07-23",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://bluejeans.com/69980574",
    "description": "Standard Chartered launched for the first time a virtual internship program  to deliver a meaningful and enriching experience to 300+ interns across the Bank’s businesses and support functions. Despite the limitation of placing its 2020 interns in physical offices due to the impact of COVID-19, Standard Chartered remains committed to our Early Career program initiatives. Our first ever virtual internship comes at a time where we are witnessing a significant shift to virtual in the workplace and is a trend that will be here to stay. This continued commitment to our internship program despite the current environment is not only the right thing to do, but also ensures our future workforce is ready to embrace a digital state of work.\nWe are already planning for the 2021 Financial Markets summer internship program.  As such we would like to invite you to join representatives from Financial Markets at a virtual information session.\n\nTarget Audience: Students entering their junior year in September\nStudents must be authorized to work in the US on a permanent basis. We do not accept OPT or F-1 visas.\nDate: Thursday, July 23\nTime: 3:00 – 4:00pm EST\nVia: BlueJeans\n\nWe do hope you can join us and learn more about Standard Chartered and more specifically the 2021 Financial Markets internship program.\n\nPlease send your resume for consideration to Carmel O’Byrne at Carmel.Obyrne@sc.com by July 17th. You will receive a confirmation of your invitation if selected.",
    "type": "2",
    "event_id": "si3binqk82r14ontqrec7rcqq4"
  },
  "https://cmu.joinhandshake.com/events/525380": {
    "name": "AlphaSights Webinar: Career in Knowledge Search, Hong Kong Opportunities",
    "dates": [
      {
        "start_date": "2020-07-24",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "17:00:00",
        "timezone": "HKT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "AlphaSights provides global investment and business professionals with on-demand access to business expertise across all industries and geographies. Through AlphaSights, decision makers from investment management, private equity, management consulting, and corporates connect with a dynamic network of industry experts that provide qualitative and quantitative market insights, industry expertise, and execution support. Leveraging cutting-edge technology and our global team of 800+ professionals in nine offices on three continents, we support our clients 24/7 around the globe. AlphaSights regularly ranks as one of the fastest-growing companies in the world. Learn more at alphasights.com.",
    "type": "2",
    "event_id": "mo1c30dnjciunvmhqegq76h4jk"
  },
  "https://cmu.joinhandshake.com/events/522677": {
    "name": "*Learn to Earn: Negotiating Your Offer During a Pandemic Webinar* CMU Silicon Valley",
    "dates": [
      {
        "start_date": "2020-07-24",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJwsc--qqzksGN1Ko8T0k86cgWNe1EE6Q_KJ",
    "description": "Learn to Earn: Negotiating Your Offer During a Pandemic Webinar facilitated by CMU-SV Assistant Director of Career Services, Leigh Mason\n\nWhen: Friday, July 24th from 1-2pm (PDT)\n\nWhere: via Zoom - Register here with your Andrew email address: https://cmu.zoom.us/meeting/register/tJwsc--qqzksGN1Ko8T0k86cgWNe1EE6Q_KJ\n\nBy the end of the webinar you will:\n-Learn crucial negotiating skills that will help you now and in the future\n-Strategize how you will discuss your salary and other benefits with your manager\n-Learn tips on leading the discussion with your internship manager, having empathy and an awareness of the circumstances happening in the world, while advocating for your total job offer package\n\nQuestions? leigh.mason@sv.cmu.edu",
    "type": "1",
    "event_id": "0572oue7gebipctra5kk0d92mo"
  },
  "https://cmu.joinhandshake.com/events/526550": {
    "name": "Career Track Series: Driving Decisions with Data",
    "dates": [
      {
        "start_date": "2020-07-27",
        "end_date": "n/a",
        "start_time": "18:30:00",
        "end_time": "20:00:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "Calling all students and fresh graduates who are keen on exploring a career in e-commerce!\n\nShopee Singapore will be hosting several webinars in the upcoming weeks under our Career Track Series. We’ll be covering topics related to Data, Engineering, Product Management and Design at Shopee.\n\nIf you are passionate about data and keen to learn more about its practical applications, tune in to our first webinar on 27 July to find out more!\n\nOur speakers from the Data team will be sharing insights into how data is being used at Shopee to drive decision-making, as well as how Shopee is developing the next generation of data talents. There will also be a live Q&amp;A session at the end, so grab your chance now to ask our speakers questions and learn more about their work in Data Science and Data Analytics!\n\nRegister via: https://bit.ly/CareerTrackSeries-1 by 26 July, 11.59pm!\n\n#CareerTrackSeries #TeamShopee",
    "type": "5",
    "event_id": "5jq9aiagt3g71sciqi9cj5dse4"
  },
  "https://cmu.joinhandshake.com/events/523467": {
    "name": "*Business Chemistry, presented by Deloitte",
    "dates": [
      {
        "start_date": "2020-07-27",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJ0ufu-vrDIqGNXb8e-sTfVAUsyuNmbuwwi3",
    "description": "During Business Chemistry Fundamentals with Deloitte Consulting, we’ll be spending some time exploring Business Chemistry. Business Chemistry is an approach to strengthening teams and enhancing business relationships. The tool identifies four different types, each characterized by a stable pattern of behaviors and preferences in the workplace. Understanding similarities and differences enables individuals and teams to flex in order to better accommodate different styles.\n\nIn advance of the session, you will have the opportunity to take the Business Chemistry assessment in order to learn your own Business Chemistry type.\n\nRegistration is required: https://cmu.zoom.us/meeting/register/tJ0ufu-vrDIqGNXb8e-sTfVAUsyuNmbuwwi3\n\nThe speakers are:\nI-Ping, a CMU Alum, is an innovation and technology evangelist, and a leader in Deloitte’s Health Care Life Sciences practice. He has over 20 years of experience in the areas of successfully delivering technology strategy, enterprise architecture, enterprise business transformations, information management and large-scale strategic information systems designs and implementations for his clients.\n\nLinda has had several roles at Deloitte, most recently as a Manager in Learning and Development for Deloitte’s consulting business. She has a passion for Deloitte’s Business Chemistry and is excited to bring a webinar to CMU!\n\nView the full summer seminar schedule here: https://drive.google.com/file/d/1i2NumYu-3AIIm7eRk1t2P5f_1nQKwit8/view",
    "type": "2",
    "event_id": "55ndqtjngjecr6s0hg5eat7dko"
  },
  "https://cmu.joinhandshake.com/events/526564": {
    "name": "Uncovering Quality Assurance (QA): Who we are and what we do?",
    "dates": [
      {
        "start_date": "2020-07-28",
        "end_date": "n/a",
        "start_time": "19:30:00",
        "end_time": "20:30:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "Attention to all Software Engineers, and Computing &amp; Engineering students!\n\nTech@Shopee will be organising a live webinar on 28 July, featuring Shopee’s very own QA engineer as he introduces more about Quality Assurance (QA) in Shopee!\n\nQA is important in ensuring that our e-commerce platform is of the highest standard. Join us in this webinar to learn more about what our Shopee QA team does behind-the-scenes to assure overall product quality in a fast-paced, fast-changing environment for the long-term.\n\nWhat to expect:\n- Our techniques to assure quality\n- How we improve quality as a process\n- What makes a good QA\n\nSign up here to register your interest for the webinar, and learn more about our software engineering openings in Singapore!",
    "type": "5",
    "event_id": "dert65absgmjrf0tp6d8vk2n6c"
  },
  "https://cmu.joinhandshake.com/events/526575": {
    "name": "Design Language System 101: From Consistency to Market Localisation",
    "dates": [
      {
        "start_date": "2020-07-29",
        "end_date": "n/a",
        "start_time": "19:30:00",
        "end_time": "20:30:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "Are you a UI/UX designer looking to improve your capabilities?\n\nShopee will be organising a webinar session on 29 July, which will feature our own Design Team’s Senior UI/UX Designer, as she shares with you how Shopee manages to bring consistency into market localisation in our Design Language System.\n\nDuring the session, you can find out more about the key Shopee design projects, and career opportunities with the Shopee Design Team. So, if you’re interested in understanding more about how you can improve your market localisation processes, and better your own design workflow, this webinar is for you!\n\nAlso, stand a chance to have your questions answered by our speaker via our registration form, or even during the live Q&amp;A session.\n\nRegister here now: https://careers.shopee.sg/event-detail/364/\n\n#TechatShopee",
    "type": "3",
    "event_id": "d4rne66tnpd446d0sg2rlorhpk"
  },
  "https://cmu.joinhandshake.com/events/524414": {
    "name": "ORISE Department of Defense Internships - Virtual Recruitment Fair",
    "dates": [
      {
        "start_date": "2020-07-29",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://orau.6connex.com/event/LIVE/bpp20q3/login?utm_campaign=BPP20Q3&utm_medium=handshake",
    "description": "Are you a college student or recent graduate looking to gain valuable experience in your STEM field?\n\nThis virtual event is for you!\n\nOn Wednesday, July 29, from 12 to 3 p.m. ET, the Oak Ridge Institute for Science and Education (ORISE) is hosting a virtual recruitment fair to highlight the variety of paid internships, fellowships and research associate appointments available within our Research Participants Program.\n\nDuring the event, you’ll have the opportunity to:\n\nCHAT with recruiters and mentors from different Department of Defense research programs.\n\nLEARN about the research conducted within those programs.\n\nEXPLORE the paid internships and research associate appointments.\n\nCONNECT with recruiters and get your questions answered.\n\nRepresentatives from the following programs will be in attendance:\n\n- Air Force Institute of Technology\n- Air Force Research Laboratory\n- Army Aeromedical Research Laboratory\n- Army Institute of Surgical Research\n- Army Corps of Engineers\n- Army Medical Research Institute of Chemical Defense\n- Army Public Health Center\n- Army Research Institute of Environmental Medicine\n- Defense Health Agency\n- Extremity Trauma and Amputation Center of Excellence\n- National Geospatial-Intelligence Agency\n- Naval Aircraft Modification Unit\n- Naval Medical Research Center\n- Naval Postgraduate School\n- Navy Experimental Diving Unit\n- Navy and Marine Corps Public Health Center\n- Walter Reed Army Institute of Research",
    "type": "4",
    "event_id": "72em1eoc5qs01k4stbpo7uele0"
  },
  "https://cmu.joinhandshake.com/events/526560": {
    "name": "Career Track Series: Fireside Chat with Shopee Engineering Leads",
    "dates": [
      {
        "start_date": "2020-08-04",
        "end_date": "n/a",
        "start_time": "18:30:00",
        "end_time": "20:00:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "Next up in Shopee Singapore’s Career Track Series, we will be hosting a Fireside Chat on 4 August to provide an insider’s view into what Software Engineering entails in E-Commerce.\n\nJoin our leads from the Engineering team to learn more about how they have navigated their tech careers in Shopee, and ask them any burning questions you may have!\n\nRegister and submit your questions now via: https://bit.ly/CareerTrackSeries-2\nPlease do so by 3 August, 11.59pm.\n\n#CareerTrackSeries #TeamShopee",
    "type": "5",
    "event_id": "8uj91lod6cakj19dlvrfjrhn28"
  },
  "https://cmu.joinhandshake.com/events/526846": {
    "name": "*Career Fair Prep and Recruiting in the Current Landscape:  Returning/Continuing students",
    "dates": [
      {
        "start_date": "2020-08-13",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://cmu.zoom.us/meeting/register/tJIkdu2vrTIvHNYya9qlo_1eBcyO1GILEEER",
    "description": "This workshop is for returning/continuing College of Engineering graduate students and will be led by the College of Engineering Graduate Student Career Consultant team.\n\nREGISTRATION IS REQUIRED: https://cmu.zoom.us/meeting/register/tJIkdu2vrTIvHNYya9qlo_1eBcyO1GILEEER\n\nLearn how to prepare for Fall virtual career fairs (TOC + Encompass) and online recruiting activities. \n\n•\tGain an in-depth understanding of the virtual career fair platform that will be used for CMU’s fall fairs. \n•\tRefresh your memory on how to introduce yourself to employers, utilize Handshake to effectively identify events and job/internship opportunities, and understand how to successfully navigate the current career landscape.\n•\tWalk away with a pre-career fair checklist to properly prepare, best practices and a strategic plan for your job/internship search, and a better understanding of CMU’s fall recruitment season.",
    "type": "1",
    "event_id": "ju5r3g51o6r7r4hq41rbrk2n7o"
  },
  "https://cmu.joinhandshake.com/events/526586": {
    "name": "Shopee Singapore Backend Virtual Recruitment Day",
    "dates": [
      {
        "start_date": "2020-08-15",
        "end_date": "2020-08-16",
        "start_time": "00:00:00",
        "end_time": "23:55:00",
        "timezone": "HKT"
      }
    ],
    "location": "n/a",
    "description": "Fuss-free, fast-paced, fast-tracked.\n\nShopee Singapore welcomes challenge-lovers to participate in our fast-tracked single-day interviews and accelerate your career with us!\n\nPositions Available:\n1) Platform Engineering - Server Developer:\n- Fresh Grad: https://careers.shopee.sg/job-detail/2263/\n- Experienced: https://careers.shopee.sg/job-detail/1248/\n2) Software Engineer - Backend/Server:\n- Fresh Grad: https://careers.shopee.sg/job-detail/2935/\n- Experienced: https://careers.shopee.sg/job-detail/2934/\n\nApplication Process:\n- Choose your preferred role &gt; Submit Resume &gt; Screening Round &gt; Single-day Interviews &gt; Receive offer\n- Shortlisted candidates will be notified via email within 1 week's time\n\nRegistration Deadline: 9 Aug 2020",
    "type": "5",
    "event_id": "0fekjch2bsn97gu0m4lb7pvd04"
  },
  "https://cmu.joinhandshake.com/events/524477": {
    "name": "Intelligent Systems Presentation on Robotics, Unmanned Systems, and related tech",
    "dates": [
      {
        "start_date": "2020-09-09",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "https://swri.webex.com/swri/j.php?MTID=m5056609b6da86c98f3b562ef8e69ee92",
    "description": "Hear from the Intelligent Systems Vice President on SwRI's tech capabilities and the internal research we pursue to benefit humanity. Southwest Research Institute, founded in 1947, is an independent, nonprofit, applied research and development organization dedicated to pursuing innovation while benefiting humanity.  We pursue over 4,000 projects a year including our own internal research and development. Our SA, Texas campus has 1500 acres of state-of-the-art facilities and lab space to create and design in.  The SwRI family consists of more than 2600 staff members, within 9 different technical divisions. We pursue projects in deep sea to deep space, and everything in between! \nSwRI is a leader in machine learning methods development, assessment, and systems integration using the following methods, among others:\nDeep learning &amp; Neural Networks – Development of complex, memory intensive neural networks.\nComputer vision – Visual data are used to identify images and categorize individual characteristics and spectra features down to the pixel.\nMachine Learning Applications\nOur machine learning applications are as diverse as the clients we serve. Visit Client Services for a comprehensive list of industry solutions or these specific machine learning applications:\nBiomedical &amp; Healthcare\nHuman Performance Solutions\nBioinformatics &amp; Computer-aided Diagnostics\nMachine Vision &amp; Autonomous Robotics\nAutomation Solutions\nAutomated Driving Systems &amp; UGVs\nIndustrial Robotics &amp; Automation\nPerception Technologies for Dynamic Environments\nEnergy &amp; Environment\nMethane Leak Detection\nMass Spec Data Analysis\nData Analytics\nComplex Data Analysis\nScience Operations &amp; Data Analysis\nData Analytics &amp; Machine Learning\n\nWe streamline maintenance processes and implement new designs and software and provide custom training technology for government and industry clients in the aerospace industry. We specialize in modernizing, overhauling, and rejuvenating aging electronic and aerospace systems, particularly for the U.S. military. We work with U.S. and foreign government agencies and commercial clients.\nFor more than three decades, Southwest Research Institute (SwRI) has been a recognized leader in space science research as well as in the development of spacecraft instrumentation, avionics and electronics for both government and industry. A traditional strength of the Space Science Department is the design and fabrication of instruments for the in-situ measurement of space plasmas, the dilute ionized gases that populate the immediate space environments of the Earth and other solar system bodies as well as interplanetary space.",
    "type": "1",
    "event_id": "j197or8ile6pdhuq6pvr5kkjug"
  },
  "https://cmu.joinhandshake.com/events/476377?ref=events-search": {
    "name": "Diversity & Inclusion Webinar Series",
    "dates": [
      {
        "start_date": "2020-04-06",
        "end_date": "2020-08-26",
        "start_time": "12:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "The McKinsey Black Network and Hispanic &amp; Latino Network are hosting a series of webinars to provide virtual opportunities to learn more about who we are as a firm and what we do. You will have the opportunity to get to know consultants and recruiters in each of our regions and our practices. Follow the link below to register for a session!\"\n\nRegister for our upcoming webinar series here - https://www.surveys.online/jfe/form/SV_cCHsmIwtymzeSFv",
    "type": "1",
    "event_id": "fd8jhup90tonk806nmr663f8bc"
  },
  "https://cmu.joinhandshake.com/events/521591?ref=events-search": {
    "name": "GSA Artificial Intelligence and Machine Learning End-User License Agreement Challenge 2020",
    "dates": [
      {
        "start_date": "2020-07-06",
        "end_date": "2020-08-20",
        "start_time": "10:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "No location",
    "description": "GSA Artificial Intelligence and Machine Learning End-User License Agreement Challenge 2020\n\n\n TOTAL CASH PRIZES OFFERED: $20,000\n TYPE OF CHALLENGE: Software and apps\n SUBMISSION START: 07/06/2020 10:00 AM ET\n SUBMISSION END: 08/20/2020 05:00 PM ET\n\nDescription\n\nThe goal of this challenge is to develop an artificial intelligence (AI), or machine learning (ML) solution that will review end-user license agreements (EULA) for terms and conditions that are unacceptable to the government. On average it takes all parties involved approximately 7-14 days to review an EULA and ensure that all unacceptable terms and conditions are identified.\n\nA EULA details the rights and restrictions which apply to the use of software or services. It can also be known as a software license agreement or acceptable use policy. As part of the acquisition process of software or services, GSA reviews the associated EULAs. This review must be completed prior to awarding new contracts or modifying existing contracts. A GSA contracting officer (CO) reviews applicable EULAs for terms and conditions that are not in accordance with Federal law and regulations. The CO may also coordinate a legal review with the Office of General Counsel if they feel it is warranted. Should EULAs contain language that would conflict with Federal law and regulations, the CO must negotiate changes to the EULA to remove the problematic language.\n\nWe are looking for a solution that will use AI and/or ML to improve this manual process. The solution will include a user interface that GSA will use to process the documents and identify unacceptable clauses/terms in the EULAs. Watch our AI / ML challenge video to learn more about the desired solution.\n\nThis solution will decrease the time spent manually reviewing EULAs and free resources to focus on other aspects of the acquisition process. It will also improve the accuracy and consistency of the review process.\n\n\nYoutube video announcing GSA ML/AI Challenge - https://youtu.be/uOBFIqoOJ8k\n\nWebsite with complete details - https://www.challenge.gov/challenge/GSA-artificial-intelligence-AI-machine-learning-ML-challenge/\n\nKey Facts:\n·      Registration begins: 10 a.m. ET, July 6, 2020\n·      Submit solutions before: 5 p.m. ET, August 20, 2020\n·      Semi-finalists announced: 10 a.m. ET, September 4, 2020\n·      Winner announced: 10 a.m. ET, September 11, 2020\n·      Each challenge solver (individual, team, or legal entity) is required to register by sending an email to challenge2020@gsa.gov with the subject line stating ‘Challenge 2020 Registration’.\n\n·      Cash prizes for winning teams:\no  1st place team: $15,000.00\no  2nd place team: $2,500.00\no  3rd place team: $2,500.00\n\n·      Questions? emailchallenge2020@gsa.gov for more information.",
    "type": "5",
    "event_id": "g43rttj731dmirajgvn9qsvmng"
  },
  "https://cmu.joinhandshake.com/events/533600?ref=events-search": {
    "name": "Campus to Camera Series",
    "dates": [
      {
        "start_date": "2020-08-06",
        "end_date": "2020-08-27",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Join a panel of PNC representatives for a series of virtual sessions to learn more about our culture and how to navigate through our current economy. Each session will build upon a case scenario that explores recommendations to set yourself up for success. Sessions are presented through WebEx and registration is required.\n\nAvailable Sessions:\n•\tThursday, August 6 – A Brand Called You\n•\tThursday, August 13 – Recovery from Viral Recession\n•\tThursday, August 20 – Our Community\n•\tThursday, August 27 – Your Financial Success\n\nAll sessions will take place from 1:00 - 2:00 p.m. est\n\nQualifications\n•\tCurrently a Freshman, Sophomore or Junior\n•\t3.0 GPA or higher\n•\tInterest in the Financial Services Industry\n\nTo register, please visit: http://www.cvent.com/events/campus-to-camera-series-fall-edition-/event-summary-a2cc1edfaa0d41a0b40ded01541f3c1d.aspx",
    "type": "2",
    "event_id": "nvdbjbue8d04sm1mcoik40sk9s"
  },
  "https://cmu.joinhandshake.com/events/528407?ref=events-search": {
    "name": "JPMC Commercial Banking Northeast Information Session",
    "dates": [
      {
        "start_date": "2020-08-10",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "On Monday, August 10th, JPMorgan Chase &amp; Co.’s Commercial Banking Sector will be hosting an Information Session for students interested in 2021 summer internship opportunities in the Northeast! This event is for students who are interested in opportunities in New York City or Boston.\n\nAt the Commercial Banking Northeast Information Session you will, \nVirtually “meet” and talk with local JPMorgan Chase &amp; Co. employees and regional leaders about their experiences \nDiscover what it’s like to work with us\nLearn about the 2021 summer application process through a Q&amp;A Session with Commercial Banking Campus Recruiters\n\n\nEvent: JPMC Commercial Banking Northeast Information Session\nDate: Monday, August 10th\nTime: 12:00pm-2:00pm ET\nRegistration: http://tinyurl.com/y3hnkm3o\n*In order to be considered, you must register using the link above*\n \nConfirmation with Zoom details will be sent to eligible students by August 6th. \t\n\nWe look forward to meeting you VIRTUALLY!",
    "type": "2",
    "event_id": "ao2qsk46pd76a6bkthdpudmgt4"
  },
  "https://cmu.joinhandshake.com/events/532862?ref=events-search": {
    "name": "RBI Speaker Series: Playing with Fire – A Masterclass in Modern Marketing and Creativity",
    "dates": [
      {
        "start_date": "2020-08-10",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "JOIN US FOR A MASTERCLASS IN MODERN MARKETING AND CREATIVITY WITH ONE OF THE MOST AWARDED CMOS IN THE WORLD.\n\no\tSpeaker: Fernando Machado (Chief Marketing Officer, RBI)\no\tDate/Time:Aug 10th, 2020 at 6:00 p.m. EDT\no\tPlatform: Microsoft Teams Presentation (we will host internally and share the link with all students who register).\n\nHungry for more? Learn from our Talent Acquisition team &amp; alumni on how to stay competitive in the interview process on August 25 at 5:00 PM EDT.",
    "type": "3",
    "event_id": "abl3fvcsv4io7bp60dfnsq71q8"
  },
  "https://cmu.joinhandshake.com/events/530410?ref=events-search": {
    "name": "AlphaSights Virtual Open House Week Presents: Learning Sales & Negotiation",
    "dates": [
      {
        "start_date": "2020-08-10",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "What are you looking for in your next role? \n\nWork in a high-growth, commercial role at AlphaSights! \n\nAlphaSights connects leading professionals to industry experts with the knowledge they need to make the best decisions in today’s competitive markets. We’re a global team with unrivaled career progression, extensive professional development, and a fast-paced, collaborative environment. Join us for one of our \"Virtual Open Houses\" to hear from recruiters, current associates, and managers. Additionally- all attendees will be eligible for an expedited interview process and the opportunity to start the semester with an offer in hand!\n\nIn this session- we will not only be chatting about AlphaSights opportunities- but how to foster sales and negotiation skills that will be helpful as you embark on your job search and beyond!\n\nWe will be actively recruiting for our Full-Time Associate Program and Summer Associate Program 2021- application links to follow Webinar! \n\nIMPORTANT NOTE: This is just one of our virtual open house sessions happening this week! Please view the below links to register for the other ones that may be of interest to you:\n\n\n\nTips for Virtual Interview Success with AlphaSights (August 11, 6:00-7:00 PM EST): \n\nhttps://ripplematch.com/event/alphasights/ceae5fc9/\n\n\n\nHow to Pick a Career Outside Your Major (August 12, 6:00-7:00 PM EST): \n\nhttps://ripplematch.com/event/alphasights/17eb4407/\n\n\n\nHow to Leverage Your Athletic Experience in the Hiring Process (August 13, 6:00-7:00 PM EST): \n\nhttps://ripplematch.com/event/alphasights/d8f65d84/",
    "type": "2",
    "event_id": "u8hr9hjputoigh2d9h0jtlghnc"
  },
  "https://cmu.joinhandshake.com/events/531808?ref=events-search": {
    "name": "*Virtual Career Fair Prep Workshop",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Are you looking for ways to make a good impression on employers and “work the room” during virtual fairs?  Get ready for the upcoming “Technical Opportunities Conference + Encompass + Converge” virtual job fair, which will take place over three days Sept 14-16.  \n\nThe CPDC will share tips and ideas for how you can prepare to meet recruiters virtually.  We will also make sure that you are familiar with CareerEco, the virtual fair platform we will be using. \n\nJoin Career Consultants Kristin Staunton and Matthew Seeley to learn more.\n\nRegistration is required: \nhttps://cmu.zoom.us/meeting/register/tJEpf-qgqjsuGtJCaPs-5j2ZfKRtSu_51oRv\n\nLink to join the event: \nhttps://cmu.zoom.us/j/95483840406?pwd=Z2U3MlRFSXREdHhHcXNHYnZuQ2QxUT09\nPasscode: 568770\n\nThe workshop will be recorded and posted in the Career Launch Online Learning modules in Canvas.\n\nTHIS EVENT IS FOR UNDERGRADUATES ONLY",
    "type": "1",
    "event_id": "v4a2s3eemdd881fflbl2aqiuf0"
  },
  "https://cmu.joinhandshake.com/events/529565?ref=events-search": {
    "name": "LIVE from the Keyot Cafe: Thinking Inside the Box. Keyot Investigates the Virtual You.",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "n/a",
        "start_time": "11:30:00",
        "end_time": "13:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Are you ready for fall recruitment season... conducted virtually? Whether you want to learn the basics or dive into some deep questions, join Keyot for an informative session on demonstrating the most professional version of the virtual YOU! We'll discuss tips for networking events, career fairs, webinars, and more all in a fun, fast-paced style. We hope to see you on August 11th!",
    "type": "1",
    "event_id": "3i5n9tsqmdsfjofp3jvpg0sd40"
  },
  "https://cmu.joinhandshake.com/events/529807?ref=events-search": {
    "name": "JPMC Commercial Banking South Information Session",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "14:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "n/a",
    "description": "On Tuesday, August 11th, JPMorgan Chase &amp; Co.’s Commercial Banking Sector will be hosting an Information Session for students interested in 2021 summer internship opportunities in the South! This event is targeted towards students who are interested in opportunities in Dallas or Houston.\n\nAt the Commercial Banking South Information Session you will, \nVirtually “meet” and talk with local JPMorgan Chase &amp; Co. employees and regional leaders about their experiences \nDiscover what it’s like to work with us\nLearn about the 2021 summer application process through a Q&amp;A Session with Commercial Banking Campus Recruiters\n\nEvent: JPMC Commercial Banking South Information Session\nDate: August 11, 2020\nTime: 12:00pm-2:00pm CT\nRegistration Link: http://tinyurl.com/y2w2murt\n\nConfirmation with Zoom details will be sent to eligible students by August 7th. \n\n*In order to be considered, you must register using the link above*",
    "type": "2",
    "event_id": "191sqamsb1aaa4gv914di3sgn8"
  },
  "https://cmu.joinhandshake.com/events/531577?ref=events-search": {
    "name": "AlphaSights Virtual Open House Week Presents: Tips for Virtual Interview Success",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "What are you looking for in your next role?\n\nWork in a high-growth, commercial role at AlphaSights!\n\nAlphaSights connects leading professionals to industry experts with the knowledge they need to make the best decisions in today’s competitive markets. We’re a global team with unrivaled career progression, extensive professional development, and a fast-paced, collaborative environment. Join us for one of our \"Virtual Open Houses\" to hear from recruiters, current associates, and managers. Additionally- all attendees will be eligible for an expedited interview process and the opportunity to start the semester with an offer in hand!\n\nIn this session- we will not only be chatting about AlphaSights opportunities- but how to set yourself up for success in any virtual interview process!\n\nWe will be actively recruiting for our Full-Time Associate Program and Summer Associate Program 2021- application links to follow Webinar! \n\n-------------------------\n\nIMPORTANT NOTE: This is just one of our virtual open house sessions happening this week! Please view the below links to register for the other ones that may be of interest to you:\n\n\n\nLearning Sales &amp; Negotiation with AlphaSights (August 10, 6:00-7:00 PM EST): https://attendee.gotowebinar.com/register/2837554045018579214\n\n\n\nHow to Pick a Career Outside Your Major (August 12, 6:00-7:00 PM EST): https://attendee.gotowebinar.com/register/2713598403833443598\n\n\n\nHow to Leverage Your Athletic Experience in the Hiring Process (August 13, 6:00-7:00 PM EST): https://attendee.gotowebinar.com/register/66217396218582542",
    "type": "1",
    "event_id": "tnkt542thvh6avmn98g14ae8rs"
  },
  "https://cmu.joinhandshake.com/events/535721?ref=events-search": {
    "name": "Google Presents: A Day in the Life- Intern Panels",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "16:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "A Day in the Life: Intern Panels\n\nInterns at Google discuss how they have grown in their current internship as well as their pathways to get there - including tips/preparation for the tech interview process, and guidance on navigating the virtual experience.\n\nRegister here: http://goo.gle/hs20-coainterns",
    "type": "1",
    "event_id": "nsblgo0d0o7unueg2dn9luss9s"
  },
  "https://cmu.joinhandshake.com/events/534610?ref=events-search": {
    "name": "2021 Virtual Career Information Session –  Asia",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "2020-08-19",
        "start_time": "21:00:00",
        "end_time": "06:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "2021 Virtual Career Information Session –  Asia\n\nWe are excited to invite you to our virtual information session to learn about our 2021 summer and full-time opportunities in Asia Pacific.  We will cover the value propositions of our offices in the region and share stories of what it is like to work in Goldman Sachs.  \n\nEvent details \nSession 1\n•\tDate:  August 12, 2020\n•\tTime: 9:00 a.m. – 10:30 a.m. HKT\n\nSession 2\n•\tDate: August 20, 2020\n•\tTime: 5:00 p.m. – 6:00 p.m. HKT\n\nNote: We will deliver the same content for both firm-wide virtual sessions so please apply to either of the event.\n\nRegistration details\n1. Visit our events portal at www.gs.com/careers/events and search \"2021 Virtual Career Information Session - Asia\".\n2. Register for either of the sessions.\n3. Once you've registered, you will be notified if you are selected to attend the virtual event and session details will be shared closer to the event.  \n\nWe plan to host multiple events through August and September so please check back on My GS Events page for the latest information.",
    "type": "1",
    "event_id": "goq99k3nlp48jmlgm340u59qog"
  },
  "https://cmu.joinhandshake.com/events/534361?ref=events-search": {
    "name": "Lockheed Martin Connect!",
    "dates": [
      {
        "start_date": "2020-08-12",
        "end_date": "n/a",
        "start_time": "10:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "This event is focused on these majors:  Aerospace, Computer, Electrical, Industrial &amp; Mechanical Engineering; Finance/Accounting and Supply Chain.\n\nJumpstart your connection with Lockheed Martin by joining to meet with our representatives between to learn about our company as we kickoff our fall recruiting.  For the past 100 years, the talented members of Lockheed Martin have been developing groundbreaking technology to keep our world secure. We're ready to take on the next 100 years and are looking for talent like you to help us get there.  If you are interested in a career with Lockheed Martin, but unable to attend, you are also welcome to pre-register for this event.  We are excited to connect with you!  \n\nNote:  This event is in addition to the LM Connect event scheduled on August 5th – attend the event which best suits your schedule!",
    "type": "1",
    "event_id": "8o178c4n5k0cdl0jf4aca024lo"
  },
  "https://cmu.joinhandshake.com/career_fairs/17360?ref=events-search": {
    "name": "VIRTUAL EVENT: Carnegie Mellon University Alumni Virtual Career Fair 2020 Part 2",
    "dates": [
      {
        "start_date": "2020-08-12",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Are you still looking for a full-time job? Not to worry! Back by popular demand, The Carnegie Mellon University Alumni Virtual Career Fair2020 Part 2 is an opportunity to connect with employers who are hiring for all roles.  This is the second time we are holding a virtual career fair for the CMU Alumni population so you will not want to miss out! If you are a current student you may attend this fair if you are graduating in August 2020.\nThe CMU Alumni Virtual Career Fair occurs on August 12th from 1:00pm - 3:00pm EDT.  Please note the following reminders and instructions for the event. \nWe will be using Handshake for the virtual fair and it will allow you to browse 1:1 and group meetings with ​numerous employers:  \nWe know this is likely your first ever virtual fair experience and you might be unsure how to  prepare. Here are some resources to help you get started:   ● How to register for virtual career fair sessions in Handshake ● Handshake’s Guide to Success at Virtual Career Fairs   If you’re looking for more guidance on navigating a virtual career search, we are here for you!  The ​CMU CPDC and the Alumni Association is available to help you before, during, and after the fair.  Don’t hesitate to email us any questions. We are looking forward to seeing you virtually at the fair! \ncareer@andrew.cmu.edualumni-email@andrew.cmu.edu",
    "type": "1",
    "event_id": "4tdd9ue9maurfk4qpt3p6l251g"
  },
  "https://cmu.joinhandshake.com/events/534653?ref=events-search": {
    "name": "Venture For America 101",
    "dates": [
      {
        "start_date": "2020-08-12",
        "end_date": "n/a",
        "start_time": "17:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Venture For America is creating economic opportunity in American cities by mobilizing the next generation of entrepreneurs and equipping them with the skills and resources they need to create jobs.\n\nSign up to hear an overview of VFA, including how you find your job, Training Camp, and resources to launch your business or become a leader at a startup.",
    "type": "1",
    "event_id": "ng74vp49n8hf5nicqo81f7aif0"
  },
  "https://cmu.joinhandshake.com/events/534199?ref=events-search": {
    "name": "Amazon North America Software Development Engineer – Virtual Event Series, Fall 2020",
    "dates": [
      {
        "start_date": "2020-08-12",
        "end_date": "2020-10-21",
        "start_time": "14:00:00",
        "end_time": "14:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "n/a",
    "description": "Amazon Student Programs has kicked off the 2020-2021 hiring season for internship and full-time opportunities. Connect with us at one of our upcoming virtual events to learn about Amazon, the Software Development Engineer role, and how we innovate on behalf of our customers. \nTo register, visit the https://amazonstudentevents.splashthat.com/ , select Americas as your region, and go to Tech events to find the North America Software Development Engineer upcoming Fall 2020 Events Calendar:\n\n•\tAugust 12, 2020 - North America Software Development Engineer Info Session \n•\tSeptember 2, 2020 - North America Ace Your SDE Interview and Online Assessment Workshop \n•\tOctober 7, 2020 - North America Software Development Engineer Tech Talk  \n•\tOctober 21, 2020 – North America Software Development Engineer Diversity Panel\n\nPre-submit your questions using the questions and comments field. We will answer a few during the webinar. You can join our session by using a Mac, PC, or a mobile device.\n\nApply to either the intern or full-time role using the links below:\nIntern: https://www.amazon.jobs/en/jobs/1204415/ \nFull-time: https://www.amazon.jobs/en/jobs/1204412/\n\nCome chart your own path at Amazon!",
    "type": "5",
    "event_id": "tfnogf2hfqpfgi69808hsd5c8s"
  },
  "https://cmu.joinhandshake.com/events/531578?ref=events-search": {
    "name": "AlphaSights Virtual Open House Week Presents: How to Pick a Career Outside of Your Major",
    "dates": [
      {
        "start_date": "2020-08-12",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "What are you looking for in your next role? \n\nWork in a high-growth, commercial role at AlphaSights! \n\nAlphaSights connects leading professionals to industry experts with the knowledge they need to make the best decisions in today’s competitive markets. We’re a global team with unrivaled career progression, extensive professional development, and a fast-paced, collaborative environment. Join us for one of our \"Virtual Open Houses\" to hear from recruiters, current associates, and managers. Additionally- all attendees will be eligible for an expedited interview process and the opportunity to start the semester with an offer in hand!\n\nIn this session- we will not only be chatting about AlphaSights opportunities- but how to pick a career outside your major and make yourself marketable to recruiters!\n\nWe will be actively recruiting for our Full-Time Associate Program and Summer Associate Program 2021- application links to follow Webinar! \n\n------------------------\n\nIMPORTANT NOTE: This is just one of our virtual open house sessions happening this week! Please view the below links to register for the other ones that may be of interest to you:\n\n\n\nLearning Sales &amp; Negotiation with AlphaSights (August 10, 6:00-7:00 PM EST): https://attendee.gotowebinar.com/register/2837554045018579214\n\n\n\nTips for Virtual Interview Success with AlphaSights (August 11, 6:00-7:00 PM EST): https://attendee.gotowebinar.com/register/1938723081716433934\n\n\n\nHow to Leverage Your Athletic Experience in the Hiring Process (August 13, 6:00-7:00 PM EST): https://attendee.gotowebinar.com/register/66217396218582542",
    "type": "1",
    "event_id": "rl3ugqk20pfq7l2uqv4cpf034s"
  },
  "https://cmu.joinhandshake.com/events/536196?ref=events-search": {
    "name": "PPG Information Session for PhD Candidates",
    "dates": [
      {
        "start_date": "2020-08-13",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "12:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Please join us for an information session about exciting employment opportunities for PhD Candidates in the field of Chemistry, Chemical Engineering, Materials Science, Physics, and Data Science.",
    "type": "4",
    "event_id": "3emv0i00b7ngbgunh6qt7q2ehs"
  },
  "https://cmu.joinhandshake.com/events/526846?ref=events-search": {
    "name": "*Career Fair Prep and Recruiting in the Current Landscape:  Returning/Continuing Engineering Graduate Students",
    "dates": [
      {
        "start_date": "2020-08-13",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "This workshop is for returning/continuing College of Engineering graduate students and will be led by the College of Engineering Graduate Student Career Consultant team.\n\nREGISTRATION IS REQUIRED: https://cmu.zoom.us/meeting/register/tJIkdu2vrTIvHNYya9qlo_1eBcyO1GILEEER\n\nLearn how to prepare for Fall virtual career fairs (TOC + Encompass) and online recruiting activities. \n\n•\tGain an in-depth understanding of the virtual career fair platform that will be used for CMU’s fall fairs. \n•\tRefresh your memory on how to introduce yourself to employers, utilize Handshake to effectively identify events and job/internship opportunities, and understand how to successfully navigate the current career landscape.\n•\tWalk away with a pre-career fair checklist to properly prepare, best practices and a strategic plan for your job/internship search, and a better understanding of CMU’s fall recruitment season.",
    "type": "4",
    "event_id": "k48m5jteder3vj95ldk3cs26u0"
  },
  "https://cmu.joinhandshake.com/events/534746?ref=events-search": {
    "name": "Intelligence Community 2020 Virtual Career Fair",
    "dates": [
      {
        "start_date": "2020-08-13",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "The Intelligence Community is hosting their 2020 Virtual Career Fair on Thursday, August 13th from 1-7 PM (Eastern).   \n\nFor many agencies, they are only accepting applications through this program, so it’s important to participate.  If you are looking for an internship or full-time job within the intelligence community, you should attend this event!  \n\nDuring the fair, you can:\n•\tVisit agency booths to explore available job opportunities\n•\tChat with recruiters and subject matter experts\n•\tLearn about internships and other student opportunities\n\nWho will be there?\n•\tOffice of the Director of National Intelligence (ODNI)\n•\tCentral Intelligence Agency (CIA)\n•\tDefense Intelligence Agency (DIA)\n•\tDepartment of Energy (DOE)\n•\tDepartment of Homeland Security Office of Intelligence and Analysis (DHS I&amp;A)\n•\tDepartment of State (DOS)/Bureau of Intelligence and Research\n•\tDepartment of the Treasury\n•\tDrug Enforcement Administration (DEA)\n•\tFederal Bureau of Investigation (FBI)\n•\tNational Geospatial-Intelligence Agency (NGA)\n•\tNational Reconnaissance Office (NRO)\n•\tNational Security Agency (NSA)\n•\tU.S. Air Force\n•\tU.S. Army\n•\tU.S. Coast Guard\n•\tU.S. Marine Corps\n•\tU.S. Navy (Naval Intelligence)\n\nYou must be a US Citizen to participate.  \n\nMore information, including registration details, can be found here:  https://icvcf.6connex.com/event/ICVCF/fall2020-att/login",
    "type": "1",
    "event_id": "idu1d8oh62bmpnohb844u77768"
  },
  "https://cmu.joinhandshake.com/events/531855?ref=events-search": {
    "name": "*SCS Masters Students: Resume Lab for Returning/Continuing Students",
    "dates": [
      {
        "start_date": "2020-08-13",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Resume Lab for SCS Returning Masters Students: An interactive resume workshop and review session led by your School of Computer Science Career Consultants. You will... \n\nLEARN:\n•\tResume best practices, including formatting tips and essential versus optional sections\n•\tHow to effectively communicate your education and experience to employers\n•\tHow employers evaluate your resume \n\nRECEIVE:\n• \tAnswers to your resume-related questions and concerns \n•\tFirst-hand experience critiquing resumes alongside your Career Consultants \n\nDEVELOP:\n•\tYour own resume, actively editing and marking it during the session to get ready for the campus recruiting season\n\nPlease note, advance registration is required to attend this event. You can sign up here with your CMU email: https://cmu.zoom.us/j/91342948995?pwd=aDNxU2ZuSGR5QWkxdjMzZzFXYW1Fdz09",
    "type": "5",
    "event_id": "ri3fbkcao67o5n9kj25uigo670"
  },
  "https://cmu.joinhandshake.com/events/531579?ref=events-search": {
    "name": "AlphaSights Virtual Open House Week Presents: How to Leverage Your Athletic Experience in the Hiring Process",
    "dates": [
      {
        "start_date": "2020-08-13",
        "end_date": "n/a",
        "start_time": "18:00:00",
        "end_time": "19:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "What are you looking for in your next role? \n\nWork in a high-growth, commercial role at AlphaSights! \n\nAlphaSights connects leading professionals to industry experts with the knowledge they need to make the best decisions in today’s competitive markets. We’re a global team with unrivaled career progression, extensive professional development, and a fast-paced, collaborative environment. Join us for one of our \"Virtual Open Houses\" to hear from recruiters, current associates, and managers. Additionally- all attendees will be eligible for an expedited interview process and the opportunity to start the semester with an offer in hand!\n\nIn this session- we will not only be chatting about AlphaSights opportunities- but how to specifically talk about your student athlete experience during recruitment processes!\n\nWe will be actively recruiting for our Full-Time Associate Program and Summer Associate Program 2021- application links to follow Webinar! \n\n--------------------------\n\nIMPORTANT NOTE: This is just one of our virtual open house sessions happening this week! Please view the below links to register for the other ones that may be of interest to you:\n\n\n\nLearning Sales &amp; Negotiation with AlphaSights (August 10, 6:00-7:00 PM EST): \n\nhttps://ripplematch.com/event/alphasights/3fc6e82d/\n\n\n\nTips for Virtual Interview Success with AlphaSights (August 11, 6:00-7:00 PM EST): \n\nhttps://ripplematch.com/event/alphasights/ceae5fc9/\n\n\n\nHow to Pick a Career Outside Your Major (August 12, 6:00-7:00 PM EST): \n\nhttps://ripplematch.com/event/alphasights/17eb4407/",
    "type": "1",
    "event_id": "kad3r04kdkj4vbaccp0f08jaoc"
  },
  "https://cmu.joinhandshake.com/events/527240?ref=events-search": {
    "name": "*Career Fair Prep and Recruiting in the Current Landscape: SCS Graduate Returning/Continuing Students",
    "dates": [
      {
        "start_date": "2020-08-14",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "This workshop is for returning/continuing School of Computer Science graduate students and will be led by the School of Computer Science Graduate Student Career Consultant team.\n\nREGISTRATION IS REQUIRED with your Andrew Email:  https://cmu.zoom.us/meeting/register/tJYpduCsqjkqH9U2fgixmcJ-zfkjT9Xl77bB\n\nLearn how to prepare for Fall virtual career fairs (TOC + Encompass) and online recruiting activities. \n\n•\tGain an in-depth understanding of the virtual career fair platform that will be used for CMU’s fall fairs. \n•\tRefresh your memory on how to introduce yourself to employers, utilize Handshake to effectively identify events and job/internship opportunities, and understand how to successfully navigate the current career landscape.\n•\tWalk away with a pre-career fair checklist to properly prepare, best practices and a strategic plan for your job/internship search, and a better understanding of CMU’s fall recruitment season.",
    "type": "1",
    "event_id": "vfg13pdlhqopqu0fe2vlqrpqqc"
  },
  "https://cmu.joinhandshake.com/events/526586?ref=events-search": {
    "name": "Shopee Singapore Backend Virtual Recruitment Day",
    "dates": [
      {
        "start_date": "2020-08-15",
        "end_date": "2020-08-16",
        "start_time": "00:00:00",
        "end_time": "23:55:00",
        "timezone": "+08"
      }
    ],
    "location": "n/a",
    "description": "Fuss-free, fast-paced, fast-tracked.\n\nShopee Singapore welcomes challenge-lovers to participate in our fast-tracked single-day interviews and accelerate your career with us!\n\nPositions Available:\n1) Platform Engineering - Server Developer:\n- Fresh Grad: https://careers.shopee.sg/job-detail/2263/\n- Experienced: https://careers.shopee.sg/job-detail/1248/\n2) Software Engineer - Backend/Server:\n- Fresh Grad: https://careers.shopee.sg/job-detail/2935/\n- Experienced: https://careers.shopee.sg/job-detail/2934/\n\nApplication Process:\n- Choose your preferred role &gt; Submit Resume &gt; Screening Round &gt; Single-day Interviews &gt; Receive offer\n- Shortlisted candidates will be notified via email within 1 week's time\n\nRegistration Deadline: 9 Aug 2020",
    "type": "5",
    "event_id": "e4hkeejeokelkiuvv1lks4gfts"
  },
  "https://cmu.joinhandshake.com/events/529909?ref=events-search": {
    "name": "JPMC Commercial Banking Deep Dive Information Session",
    "dates": [
      {
        "start_date": "2020-08-14",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "15:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "JPMorgan Chase &amp; Co.'s Commercial Bank will be hosting a Virtual Information Session on August 14th!  This event is targeted towards students who are interested in opportunities in the Commercial Bank. \n\nOn Friday, August 14th, JPMorgan Chase &amp; Co.’s Commercial Banking Sector will be hosting a Deep Dive for students interested in 2021 summer internship opportunities! \n\nAt the Commercial Banking Deep Dive you will, \n-Virtually “meet” and talk with JPMorgan Chase &amp; Co. employees and leaders about their experiences \n-Hear about Corporate Client Banking, Middle Market Banking and Commercial Real Estate\n-Discover what it’s like to work with us\n-Learn about the 2021 summer application process through a Q&amp;A Session with Commercial Banking Campus Recruiters\n\nEvent: JPMC Commercial Banking Deep Dive Session\nDate: August 14, 2020\nTime: 12:00pm-3:00pm ET\nRegistration: http://tinyurl.com/yyec8jl5\n\n*In order to be considered, you must register using the link above*",
    "type": "2",
    "event_id": "u4104g1vs0mhta8j109dhssg7k"
  },
  "https://cmu.joinhandshake.com/career_fairs/17781?ref=events-search": {
    "name": "Heinz College Public Service Fair 2020",
    "dates": [
      {
        "start_date": "2020-09-2",
        "end_date": "n/a",
        "start_time": "11:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Heinz College Public Service Fair\nThe Public Service Fair is an opportunity for Heinz students to find local non-profit and government organizations to find remote intern, work study, or volunteer positions during the fall and spring semesters. Many organizations in attendance hire through the paid Federal Community Service Work Study program. Others provide excellent volunteer opportunities. This is a great opportunity to find meaningful practical experience that you can add to your resume.\n*Federal Community Service Work Study program is only open to US Citizens*\nA representative from each organization will be available to discuss internship and volunteer opportunities with their organization. It is possible to find a position, or at the very least network with organizations you find interesting. Even though all these organizations are in the non-profit/government sectors, they need a wide range of Heinz talent including: project management, marketing, outreach, development, IT and policy analysts.\nPlease note the following reminders and instructions for the event.We will be using Handshake for the virtual fair and it will allow you to browse 1:1 and group meetings with over ​numerous employers. \nHere are some resources to help you get started:   ● How to register for virtual career fair sessions in Handshake  ● Handshake’s Guide to Success at Virtual Career Fairs \n\n\n",
    "type": "5",
    "event_id": "jndhsh5q7ug5fip2m62hj8bnb4"
  },
  "https://cmu.joinhandshake.com/career_fairs/16126?ref=events-search": {
    "name": "Technical Opportunities Conference + Encompass + Converge Virtual Career Fair 2020",
    "dates": [
      {
        "start_date": "2020-09-14",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "21:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "REGISTRATION IS AVAILABLE USING THE CAREERECO PLATFORM - SEE THE LINKS BELOW\nThe Technical Opportunities Conference + Encompass + Converge Virtual Career Fair 2020 will take place from Monday, September 14th through Wednesday, September 16th from 1:00 pm - 9:00pm EDT.  \nThe fall 2020 virtual career fair is open to all Carnegie Mellon University undergraduate and graduate students of all majors and locations, who are pursuing full-time opportunities and internships. The virtual fair will also be open to recent alumni who have graduated from December 2019-August 2020. \nThe Virtual Career Fair will be hosted on the platform, \"CareerEco\" please create an account using your Andrew email and register for each day of the virtual fair using the links below:\nRegister Here:Day 1: https://www.careereco.com/Events/CMU-Sept14\nDay 2: https://www.careereco.com/Events/CMU-Sept15\nDay 3: https://www.careereco.com/Events/CMU-Sept16\nWe understand that participating in a virtual recruiting environment will be different than participating in person, but this joint virtual career fair will also present our students with new opportunities, such as:\n● Uploading resumes into the virtual platform in advance to give employers more time to review your qualifications, which increases your opportunity to stand out.● Checking the CareerEco platform ahead of time to more efficiently and effectively identify the employers that are the best fit for you, which allows you to easily identify the most important details you need to know.● Accessing more companies than could traditionally be accommodated in-person, which means more opportunities will be available to you in a broader array of majors.● No waiting in line, which gives you the ability to talk to more employers and provides more flexibility to easily come and go.Lastly, the CPDC will be providingmoreinformationonhowtoprepforthevirtualcareerfair aswell asotherhelpful information asitgetsclosertotheevent.We are excited about this fall’s recruiting and look forward to your participation!Learn more about CareerEco (Virtual Fair Platform):Virtual Event Tutorial PDFVirtual Event Tutorial VideoQuestions?\nPittsburgh Campus Students/Recent Alumni: career@andrew.cmu.eduSilicon Valley Campus Students/Recent Alumni: lauren.schachar@sv.cmu.edu",
    "type": "1",
    "event_id": "4ohuugge7pdp2mbtgt4da0utq0"
  },
  "https://cmu.joinhandshake.com/career_fairs/15153?ref=events-search": {
    "name": "VIRTUAL EVENT: Tepper Meetup 2020 - A Networking Event for Employers and Tepper Undergraduates",
    "dates": [
      {
        "start_date": "2020-09-21",
        "end_date": "n/a",
        "start_time": "17:30:00",
        "end_time": "19:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Tepper Meetup 2020A Virtual Networking Event for Employers and Tepper Undergraduates Tepper Meetup is open to employers who are interested in networking with business administration and economics sophomores, juniors and seniors in a virtual setting. The event will take place on September 21 from 5:30 p.m. to 7:30 p.m.",
    "type": "2",
    "event_id": "veim8i2n644v0alcn159o9oivk"
  },
  "https://cmu.joinhandshake.com/career_fairs/15181?ref=events-search": {
    "name": "VIRTUAL EVENT:  Spark - Startups and Emerging Companies 2020",
    "dates": [
      {
        "start_date": "2020-10-21",
        "end_date": "n/a",
        "start_time": "12:30:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Virtual Event: SPARK 2020\nWednesday, October 2112:30 p.m. - 4:00 p.m.\n",
    "type": "1",
    "event_id": "fkl9bv8enep8m7275uapaapfds"
  },
  "https://cmu.joinhandshake.com/events/534110?ref=events-search": {
    "name": "McKinsey Digital Information Sessions",
    "dates": [
      {
        "start_date": "2020-08-11",
        "end_date": "2020-09-08",
        "start_time": "18:00:00",
        "end_time": "19:15:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "We’re looking for both digital business consultants and technologists[data scientists, software engineers, data engineers, and designers] that are excited to blend analytics, design, and engineering thinking with our McKinsey teams and experts to help our clients solve their top challenges. From day one, you’ll be part of a multi-disciplinary McKinsey team that applies technology to help clients shape their strategy, transform their organizations, and build new businesses to create positive change. We hope you will consider starting your journey with us, so you can be at your best at McKinsey Digital. \n\nIf you are a student with a STEM background and anticipate completing your program or degree in 2021 or 2022, please join us for one of our upcoming virtual info sessions to learn more about McKinsey’s 2021 full-time and internship opportunities for university students.  \n\nInterested in learning more? \nPlease join one of our upcoming virtual info sessions to learn more about our digital, tech, and analytics roles.  We ask that you register in advance to confirm your attendance and receive the event logistics:\n\n\n• August 25th at 7pm ET / 4pm PT.  \nRegister Here:\nhttps://jobs.mckinsey.com/events/Rsvp?folderId=41878&amp;rid=&amp;appsource=&amp;app2source=\n\n• September 8th at 6pm ET / 3pm PT.  \nRegister Here:\nhttps://jobs.mckinsey.com/events/Rsvp?folderId=41879&amp;rid=&amp;appsource=&amp;app2source=\n\nWant to apply? \nLearn more about roles available, application timelines, and our interview process here: https://www.mckinsey.com/careers/students/North-America-Technical-Opportunities",
    "type": "2",
    "event_id": "fuv4l2k467772i7l48l5obk618"
  },
  "https://cmu.joinhandshake.com/events/532397?ref=events-search": {
    "name": "*Ask Me Anything: Career Consultants (for UNDERGRADUATES only)",
    "dates": [
      {
        "start_date": "2020-08-17",
        "end_date": "2020-10-02",
        "start_time": "00:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Formerly known as “Drop-In Hours,” these virtual sessions with a Career Consultant will occur one hour every day starting August 17, 2020 through October 2, 2020. Open to all undergrads in all colleges, this 10-minute brief conversation is a quick, easy way to ask whatever career-related topic is on your mind. Advanced registration is not required, however, please be patient in the Zoom waiting room as other students may be ahead of you in the queue. \n\nSESSION LINK: https://cmu.zoom.us/s/3719501566\n\nAsk me Anything (AMA) Sessions with Career Consultants will be held per the following schedule:\nMondays, 7:00-8:00pm ET\nTuesdays, 12:30-1:30pm ET\nWednesdays, 11:30-12:30pm ET\nThursdays, 12:30-1:30pm ET\nFridays, 8:00-9:00am ET",
    "type": "1",
    "event_id": "6lf5ft0303703f8kfmldhjdd2g"
  },
  "https://cmu.joinhandshake.com/events/523609?ref=events-search": {
    "name": "*Daily Group Appointments (Undergraduates)",
    "dates": [
      {
        "start_date": "2020-08-17",
        "end_date": "2020-10-02",
        "start_time": "00:00:00",
        "end_time": "17:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "http://maps.google.com/?q=Pittsburgh,%20Pennsylvania,%20United%20States%20of%20America",
    "description": "Beginning August 17 until October 2, CPDC Career Consultants will be available for group appointments every day during the times listed below for UNDERGRADUATE students only.  Appointments are 45-minutes long, but you may leave the appointment at any time.  \n\nUse the zoom link below at the listed time to discuss your career-related questions.  These appointments are driven by your questions and NOT intended to be formal presentations; resources and guidance will be shared based on your questions.  1-on-1 appointments are still available and can be scheduled via Handshake as normal, but group appointments are a great option if you cannot find an available appointment time with your college career consultant. There is no limit on the number of students who can attend a group appointment, and pre-registration is not required.\n\nGROUP APPOINTMENT LINK: https://cmu.zoom.us/s/3719501566\n\nGroup Appointment Schedule (Undergraduates only): \n   Mondays, 11:00am-12:00pm Eastern (TOPIC: Virtual Career Fair Prep)\n   Tuesdays, 6:00pm-7:00pm Eastern (TOPIC: Applying &amp; Following-Up on Applications)\n   Wednesdays, 9:00am-10:00am Eastern (TOPIC: Tailoring Resumes/Cover Letters to Job Descriptions)\n   Thursdays, 7:00pm-8:00pm Eastern (TOPIC: Interviewing Skills &amp; Practice)\n   Fridays, 3:00pm-4:00pm Eastern (TOPIC: Job/Internship Search Process)",
    "type": "1",
    "event_id": "tt2o4i4acnenlugg6vljj8t2mg"
  },
  "https://cmu.joinhandshake.com/events/535764?ref=events-search": {
    "name": "Google Presents: Make the Most of your Conference Experience",
    "dates": [
      {
        "start_date": "2020-08-17",
        "end_date": "n/a",
        "start_time": "16:00:00",
        "end_time": "16:30:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Make the Most of your Conference Experience\n\nAttending the National Society of Black Engineers Convention, Grace Hopper, or another conference this year? If so, join us for a conversation with Google recruiters where we’ll  talk through how to build your online brand, how to best connect virtually with recruiters, and receive general advice to help you make the most of your time at a virtual conference.\n\nRegister here: http://goo.gle/hs20-coaconferences",
    "type": "1",
    "event_id": "m8m0sbnph9lphdqq6hv1237kng"
  },
  "https://cmu.joinhandshake.com/events/534475?ref=events-search": {
    "name": "Peace Corps Information Session & Office Hours: Western PA & WV",
    "dates": [
      {
        "start_date": "2020-08-18",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Serving in the Peace Corps is a great way to immerse yourself in a new culture, learn a new language, and have the experience of a lifetime. Join us at this information session to learn about Volunteer experiences, ask questions about service, and gain tips to guide you through the application process. We will be holding this event on a virtual platform instead of in-person. Please register to ensure that you receive access to join the event.",
    "type": "1",
    "event_id": "p6eldic8au6cib3rq8s4s9jb54"
  },
  "https://cmu.joinhandshake.com/events/539012?ref=events-search": {
    "name": "JPMorgan Chase & Co. Webinar: Securities Services Leadership Program (SSLP)",
    "dates": [
      {
        "start_date": "2020-08-18",
        "end_date": "n/a",
        "start_time": "12:30:00",
        "end_time": "13:30:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Securities Services is the engine of the trade life-cycle, serving the industry’s largest institutional investors and their investment strategies.  An end to end service model offers clients dedicated coverage and access to subject matter experts to address their evolving needs.  Securities Services bring a unique combination of complementary business that, while distinct, work together to provide a seamless experience for institutional investors. \n\nDuring this 1 hour webinar, you will learn more about the opportunities available in our Securities Services Leadership Program (SSLP) and hear insights from Campus Recruitment, Program Management, Securities Services Managers and current SSLP Analysts.\n\nIf you have a question that you would like answered, please submit it before the event via Menti (https://www.menti.com/ojxoikvk2n). You are also able to like/vote any of the questions that have been submitted by others. \n\nNote: This event is focused towards students with an expected graduation date of December 2021 - June 2022",
    "type": "2",
    "event_id": "c60rnbb85rfrj1uma4k6pnahio"
  },
  "https://cmu.joinhandshake.com/events/534850?ref=events-search": {
    "name": "KP Summer Speaker Series: Candidate Conversation on Equity, Inclusion & Diversity",
    "dates": [
      {
        "start_date": "2020-08-18",
        "end_date": "n/a",
        "start_time": "12:00:00",
        "end_time": "13:00:00",
        "timezone": "PDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Tune into a candid conversation with KP Leaders around Equity, Inclusion &amp; Diversity. \n\nAt KP, EID goes beyond culturally competent care – it infuses our workforce and energizes us to do more and do better for ourselves and the communities we serve. \n \nWe look forward to connecting with you on this important topic!",
    "type": "1",
    "event_id": "3f3hcvmcq8ps2i9rnetoovd27k"
  },
  "https://cmu.joinhandshake.com/events/533933?ref=events-search": {
    "name": "RBI Speaker Series: The Popeyes Case Study",
    "dates": [
      {
        "start_date": "2020-08-18",
        "end_date": "n/a",
        "start_time": "17:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "LEARN ABOUT THE MANY TRANSFORMATIONS THAT MADE POPEYES\nONE OF THE MOST PROFITABLE AND FASTEST-GROWING QSR BRANDS AROUND THE WORLD.",
    "type": "2",
    "event_id": "0shbf5e4ufcni8u2o5k6l73tkg"
  },
  "https://cmu.joinhandshake.com/events/540875?ref=events-search": {
    "name": "Meet McKinsey’s Hispanic + Latino Network",
    "dates": [
      {
        "start_date": "2020-08-18",
        "end_date": "n/a",
        "start_time": "19:00:00",
        "end_time": "20:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Our Hispanic and Latino Network is a catalyst for creating connections and mentoring relationships for consultants across all tenure levels, that aims to provide a platform and space for people within the Hispanic and Latinx community to advance their professional development, and create a welcoming environment within the HLN community for coaching, mentorship, and connection. Join us for a discussion with leaders and consultants in the Hispanic Latino Network for a short presentation and discussion of experiences.\n\nWe encourage students who identify as Hispanic and/or Latinx to join, but all are welcome. \n\n\nMeet McKinsey’s Hispanic + Latino Network \nAugust 18th at 7pm ET\nSign up here: https://jobs.mckinsey.com/events/Rsvp?folderId=42004",
    "type": "2",
    "event_id": "905p6mr8hho5rsmlj4meeftli4"
  },
  "https://cmu.joinhandshake.com/events/534478?ref=events-search": {
    "name": "Peace Corps Application Workshop: Western PA & WV",
    "dates": [
      {
        "start_date": "2020-08-19",
        "end_date": "n/a",
        "start_time": "14:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Make your application stand out from the rest. Attend this workshop to learn how to browse Volunteer openings, find the right program, and strengthen your application. You will have an opportunity to ask questions about service, learn steps you can take to improve your chances, and gain valuable tips to guide you through the application process. We will be holding this event on a virtual platform instead of in-person. Please register to make sure you have access to the event.",
    "type": "1",
    "event_id": "8c5ili9h8o8en1aih6bde17ovc"
  },
  "https://cmu.joinhandshake.com/events/537727?ref=events-search": {
    "name": "Day in the Life of AmeriCorps Service",
    "dates": [
      {
        "start_date": "2020-08-19",
        "end_date": "n/a",
        "start_time": "15:00:00",
        "end_time": "16:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Are you interested in learning more about Habitat for Humanity’s AmeriCorps Program? Join us to explore the AmeriCorps Program through a Day in the Life, an interactive webinar featuring staff and current AmeriCorps members.",
    "type": "1",
    "event_id": "a2lua7h1ha8formvg9iupmfse4"
  },
  "https://cmu.joinhandshake.com/events/534713?ref=events-search": {
    "name": "Landing a Startup Job with VFA!",
    "dates": [
      {
        "start_date": "2020-08-19",
        "end_date": "n/a",
        "start_time": "17:00:00",
        "end_time": "18:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Venture For America is creating economic opportunity in American cities by mobilizing the next generation of entrepreneurs and equipping them with the skills and resources they need to create jobs or become leaders at startups.\n\nSign up to hear an overview of VFA, how you can find a startup job through our Fellowship, the type of companies that partner with us, and more information regarding salary.",
    "type": "1",
    "event_id": "ljakhtqim92tnf72jnfbgstlg8"
  },
  "https://cmu.joinhandshake.com/events/540836?ref=events-search": {
    "name": "Get to Know GE - Option 1",
    "dates": [
      {
        "start_date": "2020-08-19",
        "end_date": "n/a",
        "start_time": "17:30:00",
        "end_time": "18:15:00",
        "timezone": "EDT"
      }
    ],
    "location": "n/a",
    "description": "Please join us for our upcoming webinar, Get to Know GE, during which you’ll get a helpful overview of who we are and how we’re creating innovations that make a better world.  Did you know GE is the largest infrastructure company in the world, and we have four core businesses – GE Aviation, GE Power, GE Renewable Energy, and GE Healthcare.  During either of the events, you will be introduced to actual employees who share their experiences through a series of Employee Spotlights, giving you a chance to really get to know GE.\n\nWe’ve scheduled two sessions – 5:30 pm (EDT) on August 19, and 5:30 pm (EDT) on September 3.\n\nRSVP for Get to Know GE Session 1, https://invent.ge/3fCnIx7, at 5:30 pm (EDT) on August 19 \n\nRSVP for Get to Know GE Session 2, https://invent.ge/30BF6xT, at 5:30 pm (EDT) on September 3 \n\nAs a sneak peek into what is upcoming, here are additional opportunities for you to learn more about GE:\n\nLife at GE: A Panel Discussion\nDuring the webinar, you’ll get to explore GE culture, including our world-class benefits and social impact, as well as our strong commitments to the environment and diversity and inclusion. GE employees will share their candid views and insights.\n\nRSVP for Life at GE, https://invent.ge/2E1k8zj, at 5:30 pm (EDT) on September 22\n\nLeadership and Lean Transformation at GE\nDuring this webinar, you’ll discover how GE’s Lean philosophy drives company culture and fosters three crucial leadership behaviors: acting with humility, leading with transparency, and delivering with focus and integrity.\n\nRSVP for Leadership and Lean Transformation at GE, https://invent.ge/33STxiT, at 5:30 pm (EDT) on October 7\n\nAttending these online information sessions also is a great opportunity to learn more about the exciting opportunities to intern at GE or join them upon graduation.\n\nWe encourage you to RSVP for the upcoming webinars today!\n\nSincerely,\n\nTony Denhart\nUniversity Relations Leader\nwww.ge.com/university",
    "type": "4",
    "event_id": "b9c8gbjd7uf8qt5n336c67impo"
  },
  "https://cmu.joinhandshake.com/events/534952?ref=events-search": {
    "name": "NSBE 2020",
    "dates": [
      {
        "start_date": "2020-08-20",
        "end_date": "2020-08-21",
        "start_time": "09:00:00",
        "end_time": "16:00:00",
        "timezone": "CDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Please join Dow at the upcoming Virtual NSBE Conference on August 20 &amp; 21, 2020 to learn more about emerging career opportunities.  You'll have the opportunity to engage directly with Dow staff to hear their stories and learn about specific roles.  \n\nOur very own Eunice Heath, Corporate EH&amp;S and Sustainability Director, will present as a keynote speaker talking about Dow's 2025 Sustainability Goals.",
    "type": "4",
    "event_id": "8t4c748lq7cocaprfv7e4thgqs"
  },
  "https://cmu.joinhandshake.com/events/499582?ref=events-search": {
    "name": "STPF Live Chat: The Perks of Being a Fellow: Networking, Influence and Impact",
    "dates": [
      {
        "start_date": "2020-08-20",
        "end_date": "n/a",
        "start_time": "13:00:00",
        "end_time": "14:00:00",
        "timezone": "EDT"
      }
    ],
    "location": "Any Handshake student with a link to this event can view and RSVP",
    "description": "Join us on August 20 at 1-2 p.m. ET for the fourth of a six-part live chat series with fellows. Get answers to your questions from current fellows and staff!\n\nThe AAAS Science &amp; Technology Policy Fellowships is a paid, yearlong opportunity for professional development and public service for outstanding scientists, social scientists and engineers. Fellows come from a wide range of disciplines, sectors and career stages. Fellows are postdocs, faculty on sabbatical, and other scientists and engineers looking to develop new skills as they grow in their careers.\n\nThe AAAS S&amp;T Policy Fellowships (STPF) are open to U.S. citizens who hold doctoral-level degrees in any of the following:\n\n• Biological, Physical or Earth Sciences.\n• Medical and Health Sciences.\n• Social and Behavioral Sciences.\n• Computational, Information &amp; Data Sciences.\n• Mathematics &amp; Statistics.\n\nIndividuals with a MS in Engineering plus three years of professional experience are also eligible for this program.",
    "type": "4",
    "event_id": "e1hl45nre0fgfs9n467lth08no"
  }
}