{
  "0hsp6aoole963gr1eq20uq1t7r": {
    "name": "Adobe Tech Talk",
    "description": "At Adobe, we’re changing the world. How? We give people the tools to bring their ideas to life and create content that makes life more fun and work more meaningful. We also give businesses and organizations the power to truly engage their customers!\n\nLearn more about Adobe by registering for the Adobe Tech Talk at Carnegie Mellon University and hear from one of our own Adobe Data Scientists who also happens to be a CMU alum!\n\nArvind Narayanamurthy is a Data Scientist on the Adobe Digital Insights team where he works closely with the Digital Strategy Group (DSG) to scientifically build and deliver business insights to Adobe's enterprise customers on their digital performance relative to similar businesses. On a daily basis he helps the team ingest new data sets, stitch and calibrate data across various sources and build prescriptive analysis or predictive models.\n\nWant to learn more about internships or university grad opportunities at Adobe? Be sure to RSVP to this event and apply to the opportunities posted on Handshake!\n\n**Food will be served",
    "location": "Posner Hall, Room 153",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-16T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-16T18:30:00-04:00"
    }
  },
  "177pl2f74nshmi7hq88ddq9iue": {
    "name": "CapitalOne Resume Writing Essentials Virtual Workshop",
    "description": "First impressions matter. Many times your resume is the first time an employer will get to know you. This session will help guide you in crafting a resume that showcases your personal brand while highlighting your experiences and accomplishments. \n\nRegister today at http://bit.ly/Cap1ResumeWritingWorkshop\n\nOnce registered, you will receive a confirmation email containing information about how to join the meeting. We recommend logging in with your computer as we will be presenting information through our zoom platform.\n\nhttps://cmu.joinhandshake.com/events/348545",
    "location": "http://bit.ly/Cap1ResumeWritingWorkshop",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-09T13:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-09T14:00:00-04:00"
    }
  },
  "12g22k14n8svlbcambr2tu5h0j": {
    "name": "Unisys Information Session",
    "description": "“Unisys is a global information technology company that builds high performance, security-centric solutions for the most digitally demanding businesses and governments on Earth. Unisys offerings include security software and services; digital transformation and workplace services; industry applications and services; and innovative software operating environments for high-intensity enterprise computing. We build better outcomes securely for our clients across the Government, Financial Services, and Commercial markets. By the end of this session, you will “know U”, understand our products and services, have the ability to learn about our technical and non-technical internship and coop and full time career openings and will have heard myself and others from the business. We are looking forward to seeing you and your friends at this event!”\n\nhttps://cmu.joinhandshake.com/events/330208",
    "location": "Posner Hall, Room 153",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-09T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-09T19:00:00-04:00"
    }
  },
  "2r36vn8ddisan10gldnm41jbgk": {
    "name": "Unisys On-Site Campus Tabling",
    "description": "n/a",
    "location": "Cohon University Center, Table - Wean Commons",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-09T09:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-09T14:00:00-04:00"
    }
  },
  "57n3ccv863ef9ccpv49s2gnhns": {
    "name": "SAE International Student Membership Information Session",
    "description": "FREE event for engineering students and faculty: includes a technical presentation, food, prizes, and more!\n\nJoin SAE International (an association focused on mobility engineering in the automotive, aerospace, and commercial vehicle industries) to discover student and professional member benefits, plus presentations by industry experts. \n\nPresentations:\n•\t“Things You Never Heard In Engineering Class: Leveraging SAE Involvement for Career Advancement” with SAE Member Dean Case, Consultant, Motivo Engineering/Grassroots Motorsports\n\n•\tStudent member benefits such as our student technical paper competition, mentor community, free Career Counselor video series to build soft skills, discounts on engineering products, and more: Amanda Hildabrand, SAE Membership Manager \n\n•\tInformation on MOBILUS, our online database of technical papers and standards: Michael Ferketic, SAE International \n\nThe cost of a student membership is $30. You can join onsite at the event, or join now online at sae.org/join. \n\nGraduating? We’re giving you a graduation gift: one year of SAE professional membership for free! Find out more at this event, or email membershipteam@sae.org.",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-09T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-09T20:00:00-04:00"
    }
  },
  "51osqqq94alrhmeicnciaa88qd": {
    "name": "Embark Trucks - Building Self Driving Trucks as a Robotics Startup, Lessons from the Open Road",
    "description": "Embark Trucks is an SF based startup building self-driving trucks for highways. We have raised 47.5 million, driven 300,000+ autonomous miles and move freight between LA and Phoenix. \n\nCome out to hear from a current member of our Perception team (and CMU alumni) about the work we are doing and what an internship or full-time work is like here. \n\n2 hours of Bay Area highway driving with 0 interventions: https://www.youtube.com/watch?v=5pYWhBQ7N4E\n\nhttps://cmu.joinhandshake.com/events/336134\n\nMoving freight between Texas and California: https://www.youtube.com/watch?v=3yPMxV11KaA",
    "location": "Porter Hall, Room 226C",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-09T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-09T20:00:00-04:00"
    }
  },
  "3mgjs61l7je8p18gsbtmckqjq5": {
    "name": "Uber Info Session",
    "description": "n/a",
    "location": "GSIA Building, Room 160, CMU",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-10T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-10T21:00:00-04:00"
    }
  },
  "7ml6eijvk4htvdka6uamqpb9k5": {
    "name": "Facebook Open House",
    "description": "Connect with Facebook at Open House instead of waiting in line at the TOC! We'll be showcasing a variety of open technical opportunities exclusively to CMU students on September 10th and will have representation from multiple areas. Don't forget to RSVP at the link below!<br><br><a href=\"https://facebookatcmu2019.splashthat.com/\">https://facebookatcmu2019.splashthat.com/</a>",
    "location": "Cohon University Center, Rangos 2&3",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-10T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-10T21:00:00-04:00"
    }
  },
  "2gpshmbbqcn1gggfjoqq9ugmo2": {
    "name": " Boeing Break Out Info Sessions",
    "description": "The Boeing Team will look to host break out sessions for Q&A and information exchange with students interested in our internships & full-time opportunities.\n\nhttps://cmu.joinhandshake.com/events/321331",
    "location": "Tepper Quad, Room 5001 & 5003",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-10T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-10T21:00:00-04:00"
    }
  },
  "4s18hvvjimoe6p2lglv99i9a9c": {
    "name": "Boeing Day",
    "description": "Boeing Day - Boeing Team members will meet and greet students interested in being considered for summer internship and full-time opportunities within our college programs. The team will accept resumes and screen candidates to be interviewed later in the week. \n\nIn working with Sean McGowan, he has recommended Tepper Building (Tepper 2001-2002-2003)",
    "location": "Tepper Quad, Room 2001, 2002, 2003",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-10T13:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-10T20:00:00-04:00"
    }
  },
  "5dtlob52bbe5a2ejji5rc56l3o": {
    "name": "Facebook Network Engineering Talk",
    "description": "RSVP: https://facebookatcmu2019.splashthat.com/",
    "location": "UC, Connan",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T16:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T17:15:00-04:00"
    }
  },
  "54eh6d0ngegotr6ic5qanh5arl": {
    "name": "Facebook Data Analytics Talk",
    "description": "RSVP: https://facebookatcmu2019.splashthat.com/",
    "location": "UC, Connan",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T18:15:00-04:00"
    }
  },
  "60efa5bkca3in59s3kc00840e2": {
    "name": "Facebook Security Talk",
    "description": "RSVP: https://facebookatcmu2019.splashthat.com/",
    "location": "UC, Connan",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T18:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T19:15:00-04:00"
    }
  },
  "31tma9epsgf2gp8k4rgs3495ao": {
    "name": "Facebook Production Engineering Talk",
    "description": "RSVP: https://facebookatcmu2019.splashthat.com/",
    "location": "UC, Connan",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T20:15:00-04:00"
    }
  },
  "1sk0h7s9c8mqt8ug94l63ku527": {
    "name": "Facebook AR/VR Talk",
    "description": "RSVP: https://facebookatcmu2019.splashthat.com/",
    "location": "UC, Connan",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T20:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T21:15:00-04:00"
    }
  },
  "1smoih8tl8dblaovgqvpai0gas": {
    "name": "Facebook Software Engineering Talk",
    "description": "RSVP: https://facebookatcmu2019.splashthat.com/",
    "location": "UC, Connan",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T21:15:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T22:00:00-04:00"
    }
  },
  "2sa5ppda0i704ltii4dmrng4jh": {
    "name": "Caterpillar Information Session",
    "description": "Join us for this presentation on the complex and fascinating work done by Caterpillar in the areas of electrification, hybrid, and autonomous systems. You will learn about Caterpillar’s business, career opportunities, and technologies. The presenters, former CMU students, will cover technical projects related to remote control and autonomy, hybrid energy storage, dual fuel engines and power systems. \n\nCaterpillar is the largest manufacturer of construction equipment, mining equipment, diesel and natural gas engine systems in the world. Cat is a Fortune 100 company with annual revenue of $55B and one of 30 in the Dow Jones Industrial Average. Cat invests heavily in research and development of new technologies. Electronics, advanced controls, and autonomous systems are key areas of investment for Caterpillar. Cat employs over 2000 electronics and software engineers worldwide and was ranked #1 as “top employer in electronics” by Electronic Design magazine. \n\nToday, Caterpillar’s autonomous machines operate on numerous mine sites around the world. They can negotiate complex haul roads, maneuver through high traffic areas, and work with other autonomous machines to perform complex tasks. Join us for this presentation and take a look under the hood at the technology that drives “Big Cat.” ",
    "location": "Margaret Morrison, Room A14",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-12T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-12T19:30:00-04:00"
    }
  },
  "78nh6797jhej9t6vpae1v13de7": {
    "name": "CMU + Salesforce Tech Talk",
    "description": "Our Salesforce Technology team is defining the future of cloud computing and we're looking for the next generation of bright, ambitious, curious minds to join us as we continue to blaze new trails. Join us for a Tech Talk with our Principal Architect, Pat Helland, as he discusses how to build and maintain Web Scale Infrastructure. In his talk, \"Too Big NOT to Fail\" Pat considers the challenges of running a large datacenter with perhaps 50,000 servers. It turns out that servers fail regularly and when you have a lot of them, this becomes a routine and everyday occurrence. We will discuss hardware, software, datacenter, storage, operations, and software rollout as we consider what happens when stuff is constantly breaking and you are too big to NOT fail.\"\n\nAfterward, you’ll get the chance to hear from a panel of former Salesforce tech interns to discuss their experience working at one of Fortune's Best Companies to Work For\" and answer all of your questions about the kind of impactful internship experiences that could be in your future with Salesforce! Oh, and don’t worry, we know attending an evening event can mean skipping dinner - so we’re providing free food for all attendees! We can’t wait to see you there.",
    "location": "GSIA Building, Room 160, CMU",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-12T18:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-12T19:30:00-04:00"
    }
  },
  "4v0qrvt14ttgnj6nje2ohct4es": {
    "name": " Vatic Labs Tech Talk",
    "description": "At Vatic Labs, traders, AI researchers, and technologists collaborate to develop autonomous trading agents and develop cutting-edge technology and apply it to the financial markets. The nature of the problems we work on are challenging, hence we hire some of the world's top computer scientists and researchers to develop novel AI methods and trading strategies. We are passionate about hiring the best and the brightest, empowering them with the tools and mentorship needed to be successful. Our environment is highly collaborative, fostering innovation and growth.\n\nAs a Quantitative Researcher: You will focus on researching, developing, and applying cutting edge AI/ML and statistical models that interact directly with the financial markets, collaborate with a diverse team of academic researchers that have several thousand citations in their fields of study, as well as many team members who have won medals at IMO (gold), IOI, AMC ICPC, and others.\nAs an Algo Trader: You will collaborate with a team of highly successful traders in the quantitative trading sector to build algorithmic trading systems that trade across global markets, develop and optimize trading models that have direct P&L impact for the firm.\nAs a Software Engineer: You will build innovative technology at the forefront of low latency and distributed computing systems, have the opportunity to work on technology at all levels of the stack including everything from low level system/network development to algorithmic development (C/C++ & Python on Linux) \n\nIf this sounds exciting to you please visit our website www.vaticlabs.ai or come by and see us on campus!",
    "location": "Baker Hall, Room 235B",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-12T18:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-12T20:30:00-04:00"
    }
  },
  "57thg9vnj3hu4a7200tg04pcpo": {
    "name": "Industry Secrets w/ Swipe to Unlock",
    "description": "\nRSVP: tinyurl.com/swipetounlock\nCMU Business Technology Group is pleased to host Neel Mehta and Adi Agashe, influential Product Managers from Google and Microsoft, for an interactive presentation based on their #1 Amazon Bestseller Swipe to Unlock.\n\nNeel and Adi will break down emerging technology trends and dissect novel business strategies used in the industry. They're looking forward to equipping you with an effective framework for evaluating when and how to successfully enter new markets.\n\nFollowing the talk, our speakers will stay for a Meet and Greet. You'll be able to speak with them one-on-one and enter our raffle for a chance to win a free copy of Swipe to Unlock!  ",
    "location": "TBA",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-13T16:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-13T18:00:00-04:00"
    }
  },
  "_74s30ha160r44ba36kqjab9k8d1kcba26oo32b9m6gqj0e9m75242gpm6s": {
    "name": "Facebook - Crush Your Coding Interview Workshop stream",
    "description": "n/a",
    "location": "n/a",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-13T14:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-13T15:00:00-04:00"
    }
  },
  "1qop3sii8822v19o76ssifdvim": {
    "name": "Information Systems Networking Event 2019",
    "description": "A Networking Event for Employers and Information Systems Undergraduates is opened to employers who are interested in networking with undergraduate infromation systems Freshmen through Seniors in a casual and informal setting. \n\nLight refreshments will be served.\n\nhttps://cmu.joinhandshake.com/career_fairs/12615/employers_list",
    "location": "Hamburg Hall Rotunda at the entrance of HBH",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T16:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T18:00:00-04:00"
    }
  },
  "77ohkmaglidqpgnuin29acjmhb": {
    "name": "Tartan 2 Professional: A Networking Event for Student-Athletes 2019 (formerly - Student Athlete & Employer Networking Reception)",
    "description": "Only student athletes are able to attend this event.\n\n\nEmployers attending: \nFrom Accenture, American Eagle Outfitters, to UPMC\n\nFull list:\nhttps://cmu.joinhandshake.com/career_fairs/9864/employers_list",
    "location": "Legacy Plaza adjacent to the West Wing",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-09T20:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-09T21:30:00-04:00"
    }
  },
  "666c8q5gi3oic2re6q70o9he9b": {
    "name": "Deloitte Consulting - InsightStudio's Studio Jam",
    "description": "Join us for Deloitte InsightStudio's Studio Jam, a collaborative exercise to help design a solution to solve a business issue. This event is open to those interested in the Developer, Designer, or Data Scientist positions with the InsightStudio.\n\nCome prepared for a fun team activity and to network with current InsightStudio employees. \n\nPizza will be served.\n\nSpeaking at This Event:\nTim Schuster\nSpecialist Master\nAs a Specialist Master in Deloitte’s InsightStudio, Timothy has 9+ years of professional experience supporting clients across both commercial and federal sectors. Timothy’s area of expertise includes business intelligence architecture and development, analytics & data visualization, and information management. Timothy leads the business intelligence development capabilities for S&O Analytics - InsightStudio.",
    "location": "Tepper Quad, Simmons Auditorium A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-11T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-11T21:30:00-04:00"
    }
  },
  "6jmncc2n7ggbtheokhipobnkv0": {
    "name": "Getting Started (Google & CPDC) - freshmen&sophomores only",
    "description": "Career Express is a series of recruiter-led workshops designed to give students valuable job search insights and advice as seen from an employer's perspective. Attend more than one workshop if you’d like. \n\nThis particular workshop, \"Getting Started\", is tailored for 1st and 2nd year undergraduates and will teach you how to maximize each year of school to ensure that you're industry-ready for internships and full-time opportunities. Join Google representatives as they provide detailed tips on updating your resume, preparing for technical interviews, and communicating effectively with your recruiter. \n\nSpeakers:\nJoe Battelline, Career Consultant, CPDC\n\nhttps://cmu.joinhandshake.com/events/346494\nTerri Mohler, University Programs Specialist, Google\nAndrew Benson, Software Engineer/SCS Alum, Google\n\nRSVP for Career Express workshops on Handshake (workshops are listed under ‘Events’—search term ‘Career Express 2019’)\nAll CMU students are welcome to attend. Dress is business casual-- please bring your CMU Student ID.",
    "location": "Cohon University Center, Rangos 1",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-15T09:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-15T10:50:00-04:00"
    }
  },
  "5s1270oid449g8a9pf5dolmp2r": {
    "name": "Working in the FinTech Industry (Grant & CPDC)",
    "description": "https://cmu.joinhandshake.com/events/352666",
    "location": "Cohon University Center, Rangos 3",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-15T09:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-15T10:00:00-04:00"
    }
  },
  "0m015l768qc12hlrc4v0hu3bj7": {
    "name": "TOC 1 - Undergrad students",
    "description": "<b>Wiegand Gym</b> – companies seeking the following majors will be attending: Biology, Biomedical Engineering, Chemical Engineering, Chemistry, Civil &amp; Environmental Engineering, Engineering &amp; Public Policy, Materials Science &amp; Engineering, Mathematics, Mechanical Engineering and Physics. In addition, companies seeking these majors as well as students with backgrounds in any computer/IT/software or related major will be attending.  <br><br><b>Rangos Ballroom</b> – large <b>tech</b> companies seeking Computer Science, Cybersecurity, Electrical &amp; Computer Engineering, Engineering &amp; Public Policy, Entertainment Technology, Information Systems, Information Technology, Mathematics, Physics, Software Engineering, Statistics and related majors will be attending.<br><br><a href=\"https://cmu.joinhandshake.com/career_fairs/10227\" target=\"_blank\">https://cmu.joinhandshake.com/career_fairs/10227</a>",
    "location": "Wiegand Gym - CIT, Rangos Ballroom - Tech",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-16T14:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-16T17:00:00-04:00"
    }
  },
  "5atse6avpkd5vcssvf6nvnq7co": {
    "name": "TOC 2 - Undergrad students",
    "description": "companies seeking the following  programs will be attending: Computer Science, Cybersecurity, Electrical & Computer Engineering, Engineering & Public Policy, Entertainment Technology, Information Systems, Information Technology, Mathematics, Physics, Software Engineering, Statistics and related majors.\n\nhttps://cmu.joinhandshake.com/career_fairs/10227",
    "location": "Wiegand Gymnasium, 5032 Forbes Ave, Pittsburgh, PA 15213, USA",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T14:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T17:00:00-04:00"
    }
  },
  "3pm77nhp349he5uulmapevt7ln": {
    "name": "TOC 3 - Undergrad students",
    "description": "companies seeking the following  programs will be attending: Computer Science, Cybersecurity, Electrical & Computer Engineering, Engineering & Public Policy, Entertainment Technology, Information Systems, Information Technology, Mathematics, Physics, Software Engineering, Statistics and related majors.\n\nhttps://cmu.joinhandshake.com/career_fairs/10227",
    "location": "Wiegand Gymnasium, 5032 Forbes Ave, Pittsburgh, PA 15213, USA",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T14:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T17:00:00-04:00"
    }
  },
  "3t4m5amack6iv9kidvoadop69r": {
    "name": "Lutron - Powering Smart Homes at Scale – Developing a Highly Responsive IoT Systems from Devices to Cloud",
    "description": "n/a",
    "location": "Newell-Simon Hall 3002",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-12T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-12T19:00:00-04:00"
    }
  },
  "0u12mcrn5rtdb72o8mfnte7eb6": {
    "name": "Lutron - tabling & demo 1",
    "description": "Lutron is the worldwide leader in lighting, automated shade and temperature controls, with headquarters in Lehigh Valley, Pennsylvania and engineering offices in Boston, Philadelphia, South Florida and Austin. We are a privately held manufacturing company with over 4000 design and product patents. We are at the forefront of innovating IoT products for smart homes and connected buildings. We provide solutions for residences that span from 500 sq. ft apartments to 10,000 sq. ft homes and commercial solutions for small office spaces to entire building complexes such as the New York Times Building, Lincoln Financial Field in Philadelphia, Empire State Building and the Guggenheim Museum.",
    "location": "Newell-Simon Hall entrance area",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-12T14:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-12T17:00:00-04:00"
    }
  },
  "5uqc1hnk0rn5q1umaspn9v42nk": {
    "name": "Lutron - tabling & demo 2",
    "description": "Lutron is the worldwide leader in lighting, automated shade and temperature controls, with headquarters in Lehigh Valley, Pennsylvania and engineering offices in Boston, Philadelphia, South Florida and Austin. We are a privately held manufacturing company with over 4000 design and product patents. We are at the forefront of innovating IoT products for smart homes and connected buildings. We provide solutions for residences that span from 500 sq. ft apartments to 10,000 sq. ft homes and commercial solutions for small office spaces to entire building complexes such as the New York Times Building, Lincoln Financial Field in Philadelphia, Empire State Building and the Guggenheim Museum.",
    "location": "Newell-Simon Hall entrance area",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-13T10:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-13T14:00:00-04:00"
    }
  },
  "5gd05e95ghkh5k0t8jrf8f7f1t": {
    "name": "Samsara Tech Talk",
    "description": "Samsara is the leader in Industrial IoT. Our mission is to increase the efficiency, safety, and sustainability of the operations that power our economy.\nSamsara’s portfolio of complete Internet of Things (“IoT”) solutions combine hardware, software, and cloud to bring real-time visibility, analytics, and AI to operations. We serve over 10,000 customers across diverse sizes and industries, from transportation and logistics to field services, food production, energy, construction, local governments, and manufacturing.\nFrom mechanical engineering to hardware to software, we take pride in building an end-to-end experience that our customers love. Some highlights:\n• Established leadership (previously led $1.2 billion acquisition of Meraki to Cisco)\n• CEO Sanjit Biswas named 2018 Top CEO by Glassdoor\n• VP Aidan Madigan-Curtis named a 2019 Top 50 Women in Technology\n• #3 on LinkedIn's Top Startups of 2019\n• Series F, $6.3B valuation\n• Modern software stack (Go, React, Typescript, GraphQL)\n• 100 billion data points collected annually\n• 1000+ boba teas consumed monthly\nAbout the tech talk\nEvery year, more than 4 million car accidents are caused by driver distraction. In this talk, we'll look at how computer vision and machine learning can be applied on vehicle dash cameras to prevent such accidents by augmenting drivers' ability to stay attentive.\nFor more information, check out samsara.com/careers. If you have any questions, please email campus-recruiting@samsara.com.\nWe look forward to meeting you!",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-16T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-16T19:00:00-04:00"
    }
  },
  "2aqo7tcdncgc0cqsepencbn09e": {
    "name": "M.C.DEAN. Info Session",
    "description": "M.C. Dean, Inc. is the nation’s premier electrical design-build and systems integration firm for complex, mission-critical organizations. M.C. Dean’s capabilities include electrical, electronic security, telecommunications, life-safety, instrumentation and control, and command and control systems. M.C. Dean serves a diverse group of markets including Fortune 1000 corporations; universities; high tech and biotech firms; Federal; state, and local government clients; and other organizations with large scale, complex, and mission-critical infrastructure needs. Established in 1949, M.C. Dean has earned a reputation as an innovator and pioneer. Headquartered in Dulles, Virginia, M.C. Dean employs more than 3,000 professionals in offices throughout the United States, Europe and the Middle East.\n\nM.C. Dean offers an excellent benefits package including a competitive salary; medical, dental, vision, life and disability insurance; paid-time off; tuition reimbursement; 401k Retirement Plan and Military Reserve pay offset.\n\nApplicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nFor more information about our company, you can visit www.mcdean.com.",
    "location": "Posner Hall, Room 153",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-16T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-16T21:30:00-04:00"
    }
  },
  "6tjkd7r6gklgvlu2q67p550aft": {
    "name": "Amazon Robotics Tech Talk Fall",
    "description": "Come join us to learn more about Amazon Robotics and to mix and mingle with members of our Software Engineering and Leadership Teams",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-16T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-16T20:30:00-04:00"
    }
  },
  "7s3tqfhklu9lsqjoriooipprnu": {
    "name": "GoDaddy Tech Talk",
    "description": "Deep Learning for Predicting Domain Prices\n\nLearn how GoDaddy uses neural networks to predict the price of domain names in the aftermarket. GoDaddy Domain Appraisals (GoValue) is available to millions of GoDaddy customers and provides estimated values to help both buyers and sellers more effectively price domains names. GoValue is 1.25x better at predicting past domain name sale prices than human experts.\n\nThis talk will explain the hybrid recurrent neural networks behind GoValue. We will discuss some of the practical aspects of scaling and deploying a sophisticated machine learning system. Finally, we will dive into recent research at GoDaddy that created a new neural network structure for outputting tighter prediction intervals than existing techniques.\n\nTry GoDaddy Domain Appraisals for yourself:\nhttps://www.godaddy.com/domain-value-appraisal\n\nSpeaker: Jason Ansel\n\nJason Ansel is Senior Principal Engineer at GoDaddy. He is a leader in the GoDaddy Machine Learning Team that uses deep neural networks to help our small business customers.\n\nJason received his PhD from MIT in 2013.\n\nHis dissertation focused on the boundary between machine learning, programming languages, and compilers.",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T19:00:00-04:00"
    }
  },
  "0ku9u71n62u31lucej6dc135qs": {
    "name": "Comcast Info Session (Tech)",
    "description": "Comcast Info Session (Technology Majors)",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T19:00:00-04:00"
    }
  },
  "5thbf2hk0b3fhh3dv40c17trj4": {
    "name": "Marvell Semiconductor Info Session",
    "description": "n/a",
    "location": "Porter Hall, Room A18B",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T20:00:00-04:00"
    }
  },
  "38f86i76l0kjsn6o8bdhd47rh5": {
    "name": "Appian Info Session",
    "description": "Appian makes building complex software simple. We’ve built our low-code platform from the ground up with the power to address some of the world’s toughest business problems. It’s exciting and challenging work with exciting and fulfilling rewards. It takes the right person…is that you? Meet our Campus Recruiting team and learn more about opportunities at Appian!",
    "location": "Baker Hall, Room 235B",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T20:30:00-04:00"
    }
  },
  "263uvm49a0p6pf4qp4nlllaetr": {
    "name": "84.51˚ Information Session",
    "description": "84.51˚ information session to learn more about our company, our culture, and details about our full-time and internship data scientist and data engineer opportunities.",
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T21:00:00-04:00"
    }
  },
  "12u5rgdbv8c5e5jejqjdenm10u": {
    "name": "Data Science at Root",
    "description": "Car insurance based on how people drive, not who they are. Powered by data science.\n\nRoot is a car insurance company founded on the belief that people who drive well are less likely to get into accidents, and that those people should pay less for insurance. With that in mind, Root set out to reinvent a broken industry — an industry that was still assigning rates based primarily on demographics and had an archaic agent structure.\n\nRoot's core data science challenge is understanding driving behavior from smartphone sensor data. We have logged billions of miles and our datasets are growing at an exponential rate. Computational and statistical challenges abound.\n\nWe believe a large part of the insurance challenge can be solved with a principled quantitative framework, and we are committed to developing and deploying methods that draw upon modern tools from the statistical machine learning community. In addition to telematics risk-scoring, the data science team works on core problems in pricing, reserving, marketing, and elasticity modeling. The team applies rigorous data-driven methods to making decisions across the entire business.\n\nCome and meet Matt Bonakdarpour (SCS 2009), our VP of Data Science, to hear how Root is using data to shape the future of car insurance.",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-17T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-17T20:30:00-04:00"
    }
  },
  "1mu8r4to1t31pso7ai3d0pmsml": {
    "name": "IBM Services - US Federal Info Session",
    "description": "HEINZ COLLEGE:\n\n~ OPPORTUNITIES FOR US CITIZENS ONLY~\n\nIBM Services is a team of business, strategy and technology consultants enabling enterprises to make smarter decisions and providing unparalleled client and consumer experiences via Cognitive data analytics, cloud technology and mobile app development. With global reach, outcome-focused methodologies and deep industry expertise, IBM Services empowers clients to digitally reinvent their business and get the competitive edge in the cognitive era in over 170 countries.\n\nIBM’s US Federal Sector is a division within IBM Services that offers consultative approaches for federal, state and local governments and agencies. Our clients range from defense and intelligence, healthcare, homeland security and foreign affairs. Our practice areas include: Advanced Analytics, Watson Artificial Intelligence, IoT/Supply Chain Management, Digital Business Strategy, Talent & Engagement. At this information session, Managing Consultants and Data Scientists will provide consulting experiences from their careers at IBM and share more insight into our recruitment process for incoming Senior Consultants.",
    "location": "Hamburg Hall, (HBH) 1206",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T13:00:00-04:00"
    }
  },
  "3ubson84mbujn9h1eiuuaum3dg": {
    "name": "Bank of America - Ask a Recruiter (Session 3)",
    "description": "Join our webcast to learn how to navigate the Bank of America recruiting process. You will have the opportunity to ask your own questions too!",
    "location": "https://bankcampuscareers.tal.net/vx/lang-en-GB/candidate/postings/3461",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T13:00:00-04:00"
    }
  },
  "1jmdpk39ichom65r2lb1ohp21f": {
    "name": "ASML Tech Talk",
    "description": "ASML is a leading global technology company that invents, designs, manufactures and services the lithography machines that makes microchips. There is an 85% chance that the chips in your smart devices, cell phones, computers, cars are made on our machines. Our vision is to enable affordable microelectronics that improve the quality of life from USB sticks to healthcare equipment to self-driving vehicles. Our guiding principle is continuing making ever smaller, cheaper, more powerful and energy-efficient chips.\n\nPlease join us for a Tech Talk to learn about all of the exciting career and internship opportunities available. Refreshments will be provided!",
    "location": "Posner Hall, Room 153",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T19:00:00-04:00"
    }
  },
  "471ljin4cdufeapd27iqd2q35m": {
    "name": "Mastercard - Technical Roles Information Session",
    "description": "Join us for our Technical Information Session to learn more about roles such as Software Engineering, User Experience Designer, Product Manager, and more.",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T18:30:00-04:00"
    }
  },
  "3bmqns7ioo7h859j98v9kmcbqa": {
    "name": "Bank of America Coding Challenge w/ NSBE & SWS",
    "description": "n/a",
    "location": "Margaret Morrison, Room 103",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T18:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T20:00:00-04:00"
    }
  },
  "2ogps0n5k0ujeocj8smkstou29": {
    "name": " Pluralsight Information Session",
    "description": "n/a",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T20:00:00-04:00"
    }
  },
  "0o5ic4mojlvjeahso6jijk5eif": {
    "name": "Key Tech Info Session",
    "description": "Key Tech is looking for engineers who crave fun, challenging and creative design work. We’re hiring MEs, EEs and CEs who enjoy designing from scratch and seeing their designs come to life. Custom mechanisms, cutting edge printed circuit board design and fully embedded firmware combine into the custom medical devices that we design. Key Tech is a company built from the smartest and most interesting people you can work with. We all love to learn. Our company culture can’t be beat: we work in a 100 year old theater, we are a dog friendly office and nerf darts are often seen arcing through our space. Monthly social hangouts, quarterly events and daily silliness are the perfect complement to the satisfying and challenging design work that is the basis of our company. www.keytechinc.com",
    "location": "Porter Hall, Room 226C",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T20:00:00-04:00"
    }
  },
  "69k6qb3dk3nsniq2bjgoqoj3uu": {
    "name": " Sorbet: A fast, powerful type checker for Ruby - Hosted by Stripe",
    "description": "Join us to meet Stripe engineers and learn more about our mission to increase the GDP of the internet.\n\nStripe is a technology company that builds economic infrastructure for the internet. Businesses of every size—from new startups to public companies like Salesforce and Facebook—use the company’s software to accept online payments and run technically sophisticated financial operations in more than 100 countries. Stripe helps new companies get started and grow their revenues, and established businesses accelerate into new markets and launch new business models.",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T21:30:00-04:00"
    }
  },
  "6j30vrpb9clvicktkp79p8v620": {
    "name": "Tech Talk by John Deere - Physical meets Digital: Automation and Data Journey in Agriculture",
    "description": "Topic: Physical meets Digital: Automation and Data Journey in Agriculture\n\nAbstract :\nAgriculture is undergoing a new revolution, using information and automation to improve the productivity of farms and help feed the world’s growing population. This talk will look at how John Deere is using concepts from computer vision, machine learning, robotics and data informatics to improve productivity and provide value to our customers. We will also talk about the employment and internship opportunities available at Deere and how you can work in this exciting area.\n\n\nSpeaker :\nStewart Moorehead is the Enterprise Perception System Architect working at John Deere’s Global Technology Innovation Network. His work looks at how computer vision and machine learning can be used in Deere’s products to improve performance and increase safety of highly automated and autonomous vehicle systems. He has worked on autonomous tractors for orchards, robotic lawn mowers and the R Gator a robotic utility vehicle. He has a Ph.D. in Robotics from Carnegie Mellon’s Robotics Institute.\n\nFood and refreshments will be provided.",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-18T20:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-18T21:30:00-04:00"
    }
  },
  "0l6u65atb2qnsmlvlhu5pjnpbt": {
    "name": "Mastercard Database Analyst Information Session",
    "description": "HEINZ COLLEGE:\n\nJoin us to learn more about the Database Analyst role.",
    "location": "Hamburg Hall, (HBH) 1206",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T13:00:00-04:00"
    }
  },
  "21bpponul67tvdse0l8qlfj8ud": {
    "name": "Rakuten Info Session",
    "description": "Rakuten would like to extend an invite to any CMU student interested in an internship at Rakuten.\n\nThe info session will be on September 19th from 5:30 – 6:30 PM EST.\n\nThis info session is a way for prospective interns in the area and gives them a peek into what it's like to work here at Rakuten. This event is invite-only and will include pizza and some refreshments. Besides hearing from me, we will also be showcasing our past Software Engineering intern, Arthur Micha, who will speak about his summer internship experience at Rakuten Intelligence as well.",
    "location": "Margaret Morrison, Room A14",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T18:30:00-04:00"
    }
  },
  "6894bqfnaa0033scr2evvl2pkt": {
    "name": "C3.ai Infosession",
    "description": "You Are Invited!\n\nPlease join us on Thursday, September 19th at the C3.ai Information Session. At this event, you will learn more about our company, C3.ai career opportunities, and the meaningful work we do. Food will be served.\n\nAbout C3.ai\nC3.ai is a leading enterprise AI software provider for accelerating digital transformation. The comprehensive and proven C3 AI Suite uses a model-driven abstraction layer to enable organizations to develop, deploy, and operate enterprise scale AI applications 40x to 100x faster than alternative approaches. www.c3.ai\n\nWant to learn more? Watch our video: https://vimeo.com/342132447",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T19:00:00-04:00"
    }
  },
  "1csa3lnkdk9tddsr54jghl8d76": {
    "name": "Riot Games Info Session | Technical Internships",
    "description": "If you're looking to combine your interest in games with your passion for tech, join Riot Engineers and Recruiters in this informational session about our Summer 2020 internship opportunities! We will cover our program, application tips and tricks, and wrap up with group speaking sessions with SMEs.\n\nWe are looking for undergraduate and graduate students interested in:\nSoftware Engineering\nSystems Engineering\nSecurity Engineering\nData Science\nData Engineering\nDatabase Engineering",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T19:00:00-04:00"
    }
  },
  "26ks8kttbkeqekisani0qs3jo8": {
    "name": "Mercari tech talk & career opportunity in Tokyo",
    "description": "Students in all discipline are welcome to attend.\n~~~~\nShopping Marketplace to Buy & Sell Stuff\n\nMercari is a Japanese start-up that provides a hassle-free and secure way to buy and sell new and used items such as electronics, jewelry, clothes, shoes, and more, straight from your mobile device. With our corporate mission \"Create value in a global marketplace where anyone can buy & sell\", Mercari has grown to become a leading community-powered marketplace that brings together millions of people every day.\n\nWe were Japan's first unicorn that went public in 2018, and currently focuses on 3 businesses: Mercari in Japan, Mercari in the United States that we started in 2014, and Merpay, our fin-tech group company that provides financial service within Mercari.\n\nMercari US : https://www.mercari.com/\nMerpay : https://jp.merpay.com/ (available in Japanese only)\n\nThis time we are visiting CMU for the 1st time and are excited to meet students. If you are looking for an internship/full-time job opportunities in Tokyo, come and join us!\n\nAttendee :\nKen Wakasa (Director, Mobile and Frontend)\nRika Watanabe (Talent Acquisition)\n\nWe will also attend TOC Day3 on Sep 18th, and have interview rooms for the 19th and 20th.",
    "location": "Baker Hall, Room 235B",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T19:00:00-04:00"
    }
  },
  "49gcdine46ko43niks3ei0b4vv": {
    "name": "Technical Interviewing (Facebook & CPDC)",
    "description": "Career Express is a series of recruiter-led workshops designed to give students valuable job search insights and advice as seen from an employer's perspective. Attend more than one workshop if you’d like. \n\nRSVP for Career Express workshops on Handshake (workshops are listed under ‘Events’—search term ‘Career Express 2019’)\nAll CMU students are welcome to attend. Dress is business casual-- please bring your CMU Student ID.\n\nhttps://cmu.joinhandshake.com/events/346497",
    "location": "Cohon University Center, McConomy",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKPsi Professional - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-15T09:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-15T10:00:00-04:00"
    }
  },
  "2ot1dles8sefu05274nkuodhmo": {
    "name": "Tech Career Fair",
    "description": "\"Let's Talk\"\nA more exclusive tech career fair for ECE & CS students. But as long as you are trying to do tech related, just go, trust me. I've went before as IS major and they didn't give a shit. If you're not ECE/CS maybe don't go in the beginning to avoid getting checked in, and go through the side doors of gates.",
    "location": "Gates 6th floor common (and 7th floor)",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-15T15:10:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-15T18:30:00-04:00"
    }
  },
  "_64p44da66kr38b9p70qj2b9k8crj4ba26kpk4ba48krjad9m88rkce9m88": {
    "name": "Jane Street Tech Talk",
    "description": "Running Into a (Memory) Wall\n\nPresented by: Brian Nigito\nIn this talk we'll discuss the idea of a \"Memory Wall\", where memory latency completely\ndictates program performance. We explore the tools and techniques we use at Jane\nStreet to measure this, and see what it looks like for both a simple program and a real\napplication. While Jane Street has a strong focus on functional programming, we hope\nthis talk shows how we also dive deep into low-level systems.",
    "location": "GHC 6115",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T17:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T18:00:00-04:00"
    }
  },
  "3culrjs021umbp4ugqg5d5f1p3": {
    "name": "DiDi Chuxing Information Session",
    "description": "The info session is to introduce DiDi Chuxing's mission and future plan as well as global job opportunities for students.",
    "location": "Baker Hall, Room A53",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T21:00:00-04:00"
    }
  },
  "1vtolgggjquudvoec6tufv87ok": {
    "name": "Splunk Tech Talk",
    "description": "Come join Splunk for a Tech Talk with our engineering teams! We'll have demos and dinner. A chance for you to learn about Splunk, what we do, and meet our many different team members!",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T21:00:00-04:00"
    }
  },
  "5rpddnr04tq1j61cv69a3v8m7f": {
    "name": "Alibaba Info Session 2019",
    "description": "n/a",
    "location": "Doherty Hall, Room A302",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-19T19:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-19T21:00:00-04:00"
    }
  },
  "6e5jo3m199t688sljhmd7v7tfq": {
    "name": "Deloitte Consulting: Technology Case Interview Workshop",
    "description": "Heinz College Students:\n\nPlease join Deloitte Consulting for a Case Interview Workshop\n\nhttps://cmu.joinhandshake.com/events/341579",
    "location": "Hamburg Hall, (HBH) 1206",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-20T08:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-20T10:00:00-04:00"
    }
  },
  "28pi43qrvslgd1h90ff2lbu9r6": {
    "name": "Zillow AI Forum",
    "description": "Registration to livestream the Zillow 2019 AI Forum is now available! If you are unable to attend the forum in person select the livestream option when registering and you will be sent a link closer to the event for you to watch remotely.\n\nInterested in learning how the biggest names in tech and academia are implementing AI to solve some of the world’s toughest challenges? Join us for the 2019 Zillow AI Forum – a day of learning and getting to know leading talent from Harvard, Microsoft, Samsung, Unity, Zillow and more! Together we’ll explore what’s new in the field of AI, covering topics like computer vision & image recognition, human-in-the-loop, conversational AI & search, and how video games are driving advancements in AI.\n\nThe Zillow AI Forum 2019 is a free event, but space is limited. Please register today! https://zlw.re/AIForum2019",
    "location": "https://zlw.re/AIForum2019",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-20T08:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-20T17:00:00-04:00"
    }
  },
  "44ueoa672o70fdhhi7983skaln": {
    "name": "A Day in the Life of a Capital One Designer, Engineer, & Product Manager",
    "description": "Join a Capital One designer, engineer, & product manager to learn what a day in the life of these unique, but interconnected roles is like.\n\nDuring this interactive info session and associate panel, you'll learn more about working in digital design, technology, and product management at Capital One. This is a great chance to learn more about our exciting rotation and intern programs, as well as our company, culture, and more.\n\nRegister here: https://bit.ly/2k04SJE\n\nFood, refreshments, & swag provided!",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-23T20:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-23T21:30:00-04:00"
    }
  },
  "7j1135r6kqvqg61239jrn32hm9": {
    "name": "Accenture Cyber Security Penetration Testing Workshop",
    "description": "Cyber security threats are growing. Attack them.\nAccenture Security helps organizations prepare, protect, detect, respond and recover along all points of the security life-cycle.\n\nCome joins us during our Penetration Testing workshop where you'll learn hands on skills in physical security review and social engineering testing from CMU alumni and industry leaders in our Security practice.\n\nFood and beverages will be served.\n\nTo learn more visit: https://www.accenture.com/us-en/about/security-index",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-23T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-23T19:00:00-04:00"
    }
  },
  "62puuvgo9mf5l06gm7r3g9udlj": {
    "name": " Capital One - Data Science Internship Lunch Information Session",
    "description": "HEINZ COLLEGE:\n\nCapital One invites you to a lunch information session where you can learn about our 10 week Data Science summer internship program. You'll hear from Data Scientist's about their experience at Capital One, what tools they use and how they make a positive impact our customer's on a daily basis. We look forward to seeing you!",
    "location": "Hamburg Hall, (HBH) 1202",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-23T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-23T13:15:00-04:00"
    }
  },
  "7s1qhmtss1udsvrhesdhrd50ce": {
    "name": "Encompass - internship opportunities",
    "description": "*Coat and backpack check is located in the Activities Room - Second Level of Cohon University Center from 9:30 a.m. - 5:30 p.m.\n  Backpacks are NOT permitted in the fair\n\n*You must have your CMU student ID to enter the fair\n*Alumni can check-in at the gym entrance\n\nhttps://cmu.joinhandshake.com/career_fairs/9866/employers_list",
    "location": "UC",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-24T10:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-24T12:45:00-04:00"
    }
  },
  "674cji5crfo1bfj07abd8svo3q": {
    "name": "Apple Women in Engineering Luncheon",
    "description": "Will Update Before Facing Students: This will be an invite-only event. An opportunity for women in engineering and Grace Hopper Conference Attendees to connect with other female engineers over lunch.",
    "location": "Cohon University Center, Rangos 1&2",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-25T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-25T14:00:00-04:00"
    }
  },
  "2gbnhsusphjmu72dhcof3s1cpm": {
    "name": "Apple Hardware Technologies Tech Talk",
    "description": "Opportunity to hear from a leader within Apple's Hardware Technologies organization and learn about opportunities on this team.",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-25T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-25T20:30:00-04:00"
    }
  },
  "594r7v9hh4uui9bheqqr7bqn05": {
    "name": "Apple Hardware and Operations Networking Day",
    "description": "Don’t know where your major fits within Apple? Meet employees from hardware, hardware technologies, and operations engineering. Bring multiple copies of your resume and we’ll help you connect the dots. Casual attire.",
    "location": "Cohon University Center, Rangos Ballroom 1, 2, 3",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-26T09:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-26T12:30:00-04:00"
    }
  },
  "3phljkrp1t11ivbq0but7vkfid": {
    "name": "Procter & Gamble Tech Talk: Information Security and Data Science",
    "description": "Tech Talk #1 (by Sharmila Arcot): P&G's approach to security in the modern world - The presentation will focus P&G's digital transformation to secure our enterprise in this new borderless era. We will elaborate our shift towards Identity defined security and our vision towards secure access for all employees, customers and partners.\n\nTech Talk #2 (by Ankita Mangal): Data Science at Procter & Gamble:\nData Science at P&G is solving billion dollar problems with the speed of a startup and is backed by the scale of the largest consumer packaged goods company in the world. Our goal is to win the consumers through the application of advanced machine learning and statistical algorithms to create superior products and optimize our marketing, sales, supply chain and business operations. Come learn how we are making this all happen using state of the art computing, big data and machine learning algorithms applied at the industrial scale.\n\nSharmila Arcot\nIT Security Engineer\nSharmila Arcot is the IT Security Engineer at P&G Information Security Architecture and Engineering team. She is responsible for implementing consistent secure authentication and authorization across all enterprise applications in the company. She has 15+ years of experience in software development and architecture in telecommunications, aviation and IT security. Sharmila graduated from Wright State University in Dayton with a Masters in Computer Science.\nA\nAnkita Mangal\nData Scientist\nAnkita Mangal graduated with a PhD in Materials Science & Engineering from Carnegie Mellon in 2018. She is now a Data Scientist at P&G, where she uses machine learning to solve a wide range of retail business problems.",
    "location": "Hamburg Hall, (HBH) A301",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-26T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-26T13:30:00-04:00"
    }
  },
  "76aso3hmvbi2j9jgpoi9tg31j8": {
    "name": "Apple GPU Software Tech Talk and Networking Event",
    "description": "Tech Talk and Networking Event to hear directly from Apple's GPU Software team and learn about opportunities within this organization.",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-26T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-26T20:30:00-04:00"
    }
  },
  "719vujt9srcrm77m7tej6ra4k5": {
    "name": "DeepMind Engineering Talk",
    "description": "\"At DeepMind we've built a unique culture and work environment where long-term ambitious research can flourish. Our special interdisciplinary team combines the best techniques from deep learning, reinforcement learning and systems neuroscience to build general-purpose learning algorithms. We have already made a number of high profile breakthroughs towards building artificial general intelligence and we have all the ingredients in place to make further significant progress over the coming years.\n\nThese talks will give you an insight into what it looks like to be an Engineer and Tech Artist at DeepMind. You will learn about the collaborative ways the teams work together to help accelerate AI research. You will get the chance to ask any questions and learn more about DeepMind as a whole. We look forward to seeing you there!\"",
    "location": "Margaret Morrison, Room A14",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-26T18:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-26T20:30:00-04:00"
    }
  },
  "0vn0utrpc81h52sstnogliohtk": {
    "name": "Google Information Session at Heinz",
    "description": "n/a",
    "location": "Hamburg Hall, (HBH) A301",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-27T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-27T13:00:00-04:00"
    }
  },
  "47s5ks2rnql64ll3qsd03fmmhu": {
    "name": "Google @ Heinz Technical Interview Prep Workshop",
    "description": "HEINZ COLLEGE:\n\nAre you gearing up for technical interviews this fall? Whether you’re interested in our Software Engineering Internship or our full-time SWE roles, you may want to brush up on those interview skills. Join us for mock questions and tips!",
    "location": "Hamburg Hall, (HBH) 1204",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-27T13:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-27T15:00:00-04:00"
    }
  },
  "0l5fu2ea4s1sk0rjvgand47ogp": {
    "name": "Intuit Data Science and Analytics Info Session",
    "description": "HEINZ COLLEGE STUDENTS:\n\nJoin us to learn more about our opportunities in data science and analytics on the Quickbooks team at Intuit from CMU BIDA alums Emilio Esposito, Dylan Connor, and Jonathan Seppi as well as our Head of Data Science and Analytics for Quickbooks Online Platform, John Humphrey.",
    "location": "Hamburg Hall, (HBH) 1206",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-30T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-30T13:00:00-04:00"
    }
  },
  "0aigjunghsedvd2nv6o4js47e9": {
    "name": "Uber - Ace the Technical Interview",
    "description": "n/a",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-30T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-30T19:00:00-04:00"
    }
  },
  "3npna56499fu00n3ras15pjkak": {
    "name": "Accenture Tacos and Tech Information Session",
    "description": "You're invited to learn more about Accenture Technology and explore opportunities in Tech, Data Analytics, Block-chain, Architecture, Mobile Applications and all things tech! Come network with industry leaders and CMU alumni to learn more about a day in the life.\n\nTacos included..",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-09-30T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-09-30T19:30:00-04:00"
    }
  },
  "1ub40dhrrt0l4s23vst95d5g7d": {
    "name": "Clearwater - Healthcare Cyber Risk Management",
    "description": "Heinz College Students:\n\nDigital transformation in healthcare is rapidly driving adoption of new technology and information systems to support key business initiatives. As a result healthcare data has been growing at 48% per year and the number of points from where that data can be accessed is growing exponentially.\n\nThese trends are creating demands such as:\n\n• A greater need to secure the confidentiality, integrity, and availability of protected health information\n\n• The need for a comprehensive, enterprise wide Risk Analysis and Risk Management program that complies with OCR’s guidance\n\n• And also, the need for a scalable cyber risk management system that adapts to the organization’s needs as they change\n\nUnfortunately, there are challenges in meeting these market demands that put many organizations and their patients at unnecessary risk.\n\nThis presentation will discuss how Clearwater is helping leading healthcare organizations in adopting an ongoing programmatic approach to managing cyber risk.\n\nIn addition we will discuss what its like to be part of the Clearwater team going out and meeting these customers where they are, helping them understand and manage their cyber risk, as well as developing new and innovative solutions to address the ever changing threats they face.",
    "location": "Hamburg Hall, (HBH) 1206",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-02T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-02T13:00:00-04:00"
    }
  },
  "5elsi1fun1q1r9kani471q1q95": {
    "name": "Two Sigma Quant Talk",
    "description": "Interested in learning how to apply your passion for math, science, technology, and desire to do impactful work?\nCome and join Two Sigma's quant researchers, where you can learn about the internship and full-time research opportunities that we offer. At this talk, you can discover how Two Sigma can help you to translate your academic background into the world of quant finance. We look forward to discussing some of the challenges we encounter and the solutions we create to find value in the world’s data.\n\nFood will be provided. Please register for a spot by clicking on \"Apply Now\" if you’re interested in joining us. We hope to see you there!",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-02T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-02T19:00:00-04:00"
    }
  },
  "53856pusg75pe14bt89kias4gf": {
    "name": "Determined AI Info Session",
    "description": "Join us to discuss the future of deep learning and the underlying AutoML research driving our product vision. Learn more about distributed systems and machine learning opportunities at Determined AI!\n\nCo-founder/Chief Scientist and CMU MLD Professor Ameet Talwalkar will be joined by Determined AI engineers (and CMU PhDs) Aaron Harlap and Danny Zhu for an interactive discussion and Q&A.\n\n\nAbout Determined AI\n\nFounded in June 2017, Determined AI is an early-stage, venture-backed company at the forefront of machine learning technology. Deep learning has enormous promise, but developing practical applications powered by deep learning is extremely complex and expensive. We are making it faster, cheaper, and easier for companies to build intelligent applications. Our software provides workflow and infrastructure automation tools covering the entire model development lifecycle, with a specific focus on deep learning. Our customers are highly skilled ML engineers and domain experts working on exciting problems in biotech, hardware design, adtech, and more.\n\nOur team\n\nOur founders, Evan Sparks, Neil Conway, and Ameet Talwalkar, met at UC Berkeley's AmpLab, where they contributed to the Apache Spark, MLlib, and PostgreSQL open source projects. Ameet is also an organizer of the Conference on Systems and Machine Learning (SysML). Our engineering team includes PhDs from Carnegie Mellon University, UC Berkeley, University of Chicago, and University of Texas Austin; they have published extensively at top machine learning and systems conferences including NeurIPS, ICML, SysML, and SOSP.",
    "location": "Baker Hall, Room 235B",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-03T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-03T19:00:00-04:00"
    }
  },
  "1mpcqlbtk9nv6lo032c4mooqtr": {
    "name": "Partnership for Public Service - Cybersecurity Talent Initiative Information Session",
    "description": "The Partnership for Public Service is looking for motivated and mission-driven aspiring cybersecurity leaders to join the Cybersecurity Talent Initiative in the summer of 2020. This information session will serve as a chance for students to learn more about this program and connect with representatives from the Partnership for Public Service, corporate partners, and participating federal agencies.\n\nThe Cybersecurity Talent Initiative is the first-of-its-kind public-private partnership aimed at recruiting and training a world-class cybersecurity workforce. The program is a selective opportunity for students in cybersecurity-related fields to gain vital public and private sector work experience and even receive up to $75,000 in student loan assistance.\n\nThe fellowship entails a two-year placement within a federal agency during which participants will receive mentorship, professional development and leadership training from public and private cybersecurity leaders, while making a meaningful impact on the country’s digital security. Before the end of their federal service, participants will be invited to apply for in-demand positions with the program’s corporate partners. Participants hired by these companies will also receive student loan assistance.",
    "location": "Doherty Hall, Room 1212",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-07T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-07T18:30:00-04:00"
    }
  },
  "7ccrmdusi7v1d3ale3pgr6dsui": {
    "name": "Intuit - How to Land the Job",
    "description": "This event is to help you navigate through the recruiting and hiring process. Your will learn how to approach a company to how to the offer process. Come learn from an industry expert on \" How To Land the Job\" Come learn and from a Hiring expert in early career hiring. Charles Martin\n\n\nSpeaking at This Event\nCharles Martin\nCharles Martin\nSr University Recruiter\nBefore his career as University Recruiter industry, Charles was a former Sr. Systems Engineer and served his country in United States Air National Guard. With an extensive background in technology and recruiting, he also known to have a healthy Social Media addiction with an appetite for new information and giving insights to the art of interviewing. Best known for his story telling & helping students through their new journey. Also know as @InternGuy on Snapchat",
    "location": "Posner Hall, Room 153",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-07T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-07T19:00:00-04:00"
    }
  },
  "30rhskdso2v01vs13ldlh8vqob": {
    "name": "KPMG Ignition Tokyo: Information Session",
    "description": "Dear CMU Students.\n\nKPMG Ignition Tokyo will be looking for new Interns from February 2020!\n\nWe are holding Information Session on October 8th from 18:00 at Carnegie Mellon University.\n\nA Partner, Director, and Manager from KPMG Ignition Tokyo will be there to explain about our Internship program.\n\nPlease feel free to RSVP for joining the event!\n\n< Internship Details >\n1) Internship will be in KPMG Ignition’s office in Tokyo and the terms are either 6 or 8 months.\n2) Internship will be fully paid with a housing allowance.\n3) Employment visa application support also available.\n4) Chance to receive a full time job offer after the internship.\n5) Internship start date negotiable.\n\n＜Position 1＞Engineer:\nIntern students are expected to catch up with knowledge collateral for bleeding edge technologies and participate in programming activities for innovation. Each developer will have a chance to work in a wide range of projects experiencing the use of different technologies (AI and blockchain as the main). All projects worked on are for client delivery.\n\n＜Position 2＞Business and Consulting Research:\nOur analysts are responsible for designing and executing the qualitative and quantitative research approach across a wide range of industries and topic areas from consumer insights to disruptive technology trends.\n\nInterns are expected to get involved in the entire innovation process and participate actively from initial visioning all the way through idea generation and follow up activities. Intern students will assist in project management, identifying stakeholder and client needs and bridging them with digital strategy. For this role being able to speak Japanese at a native level is must.\n\n＜Position 3＞Blockchain / Secure Computing Engineering :\nAs a software developer you will work in a dynamic and evolving environment following the strategic direction of KPMG Japan. You will develop, maintain and improve systems to meet particular needs, often as advised by systems architect. You will also do testing, test automation and bug fixing. Our team develops digital solutions which involve cutting edge technology such as NLP, Machine Learning, OCR, Blockchain, IoT etc. We are particularly looking for blockchain specialized software developer.\n\n＜What is KPMG Ignition Tokyo?＞\nKPMG is a professional firm, providing audit, tax and advisory services in Japan. KPMG has more than 162,000 professionals in 155 countries and offers value-added services to address the management issues of our clients all over the world.\n\nKPMG Ignition Tokyo will be the centerpiece of our firm’s digital strategy, merging our professional insights in audit, tax and advisory with the knowledge of our digital experts and the latest digital technology. It will support the digitalization of our own services as well as the digital transformation of our clients, and will be a center for developing the solutions necessary to succeed in an increasingly competitive global landscape.\n\nShould you have any questions, please free to contact us.\n\nKPMG Ignition Tokyo",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-08T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-08T20:00:00-04:00"
    }
  },
  "_84q32e9g88pkaba68krj6b9k68pj8b9p751k4b9i8ks38hi36ook2e1j8g": {
    "name": "Google - full time career fair",
    "description": "If you’re interested in full time roles at Google, this is your chance to\nchat with Googlers and get all of your questions answered! We’ll\nhave representatives from a variety of roles including SWE, UX,\nSecurity, gTech, Hardware, and more. \n\nRSVP: goo.gle/googleday",
    "location": "UC - rangos",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T13:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T15:45:00-04:00"
    }
  },
  "_8p13ec9k8d1k2b9g6p23eb9k84r3eba270q30b9k8opjegi164qjgg9m8k": {
    "name": "Google - Product inclusion talk",
    "description": "At Google we are working hard to ensure that our differences aren’t\nsimply acknowledged, but celebrated. Join us and learn about why\nthis is so important to Google, and how this ultimately drives\ninnovation with a keynote by Annie Jean-Baptiste, Google’s Head of\nProduct Inclusion, Research & Activation. Lunch will be served! \n\nRSVP: goo.gle/googleday",
    "location": "UC - rangos",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T13:00:00-04:00"
    }
  },
  "_8l13ac9n88pj6b9k60o46b9k64oj0b9o7123eba36grj2e1j712jadpi74": {
    "name": "Google Intern career fair",
    "description": "Calling all intern-eligible candidates! Join us in Rangos and chat with\nGooglers from a variety of roles including SWE, UX, Security, gTech,\nHardware, and more about life at Google.\n\nRSVP: goo.gle/googleday\n",
    "location": "UC - rangos",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T09:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T11:30:00-04:00"
    }
  },
  "2pf2il26ur8gevftb97j80uago": {
    "name": "Praetorian team - Cyber security talk with IS Alum",
    "description": "Dealing with network hacking to software hacking to hardware hacking, CMU IS alumnus Donovan Powers will share how Praetorian engineers help secure everything from cryptocurrency exchanges and space telescopes to autonomous vehicles and the electric grid.  If you are interested in learning more about cybersecurity, this is a talk you will not want to miss.  Afterwards there will be an opportunity to interact with Donovan and the Praetorian team and discuss employment and internship opportunities.  Food will be provided.",
    "location": "Hamburg Hall Room 1002",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-01T16:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-01T18:00:00-04:00"
    }
  },
  "13plus8u1f69ismj0kr8l6nuit": {
    "name": "Oracle Cloud Infrastructure - Why techs need humanities majors",
    "description": "Why Techs Needs Humanities Majors-A Talk With Leslie Robertson, VP User and Developer Experience with Oracle Cloud Infrastructure (OCI)\n\nThe tech industry suffers from a diversity problem. If we want technology that can successfully anticipate the needs of a diverse set of users, the people who build those products must also be diverse. Code is not the only path to contribution, and tech startups need more than just computer science majors. How do you build the diverse team you need, whether you are a small startup or a Fortune 100 company? By looking beyond the obvious majors and recognizing that potential comes in all sorts of forms.",
    "location": "Tepper 3700, Swartz Center forEntrepreneurship",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-24T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-24T13:00:00-04:00"
    }
  },
  "21rbmldnhnesardc01qb0rcsi5": {
    "name": "Intuit Intern Info-Session",
    "description": "Join us to learn more about all our Intern Opportunities in Intuit Largest engineering Departments (Small Business Self Employed Group) this organization is the heart beat of Intuits technologies Platform and we are looking for you to join be our next Intern or Possible New College grad. Come learn how to become an Intuit Engineer and hear from current college grads, former interns and alumni..",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-08T18:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-08T20:00:00-04:00"
    }
  },
  "2nqsk2ga6gmnee0stvbaslliab": {
    "name": "Technical Interviewing for Cyber Security Roles",
    "description": "HEINZ COLLEGE STUDENTS:\n\nTechnical Interviewing for Cyber Security Roles\n\nHeinz Alumnus Daniel Spaniel of ICIT will be presenting on how to prepare for a technical round interviews related to cyber security roles, sharing insights from their industry experience as well as best practices to be success during the interview. He will speak to:\nWhat are the most valuable skills they look for in candidates?\nWhat skills/ proficiencies do they wish new talent had?\nWhat sets candidates out from the pack?\nWhat kind of questions might they ask in interviews?\nWhat does the interview process look like within their organization?\n\n\nRSVP IN ADVANCE.\nLunch will be served.",
    "location": "Hamburg Hall, (HBH) 1007",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T13:00:00-04:00"
    }
  },
  "419r700uouu4qojvkhnipdidun": {
    "name": "Credit Suisse Chalk Talk and Interview Tips Session",
    "description": "Join us for the Chalk Talk & Interview Tips session where you will be able to meet Credit Suisse employees and learn about our Technology division and internship.",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-10T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-10T19:30:00-04:00"
    }
  },
  "0mn5mak9eal080iec10r8n5qi7": {
    "name": "Waymo Information Session",
    "description": "Google self driving car heh",
    "location": "GSIA Building, Posner Hall, Room 160",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-10T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-10T21:00:00-04:00"
    }
  },
  "_74sk4dhh6orjgba168ok8b9k68s42b9o68oj4b9l6gp30c9g6l0j6ha36g": {
    "name": "Zillow SDE Tech Talk",
    "description": "n/a",
    "location": "UC Rangos 2",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-08T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-08T19:30:00-04:00"
    }
  },
  "_64qjee248d1k4b9k6ko38b9k8orkcb9o8gqjcb9o8p33eh1i8ks3ahhm6g": {
    "name": "CVS Aetna Data Science Clinical Products Lunch and Learn",
    "description": "Heinz College:\n\nHealthcare in America is ineffective and expensive. At Aetna, a CVS Company, we are using data science on primarily claims data to develop new products and innovative services to positively reshape chronic disease management. Our transformative models and cutting edge analytics have national outcomes that are benefiting the health of countless Americans.\n\nFor example, CVS’s new home dialysis program was incepted on our team and validated with analytics on Aetna’s claims data. This project is designed to delay the onset of end state renal disease, reduce hospitalizations, eliminate unnecessary emergency room visits, and lower patient healthcare costs. It’s working. We currently have patients on home dialysis due to our work.\n\nMany more projects are in development. Some of the chronic conditions that we are currently working to mitigate are chronic kidney disease, diabetes, congestive heart failure, and chronic obstructive pulmonary disease.\n\nWe are differentiated from other teams in CVS because we use claims data to underpin our modeling and analytics. The petabytes of data we leverage allow our neural nets, random forests, shap force plots, regressions, and other models to be more predictive and more externally valid than the models of our peers. Coupled with CVS’s national footprint our individualized models are fundamentally improving treatment outcomes and creating new ways to access healthcare. We are obsessed with making our members healthier.\nWe have a great team. Our data scientists are unparalleled. Our data engineers move mountains to productionalize models and incorporate nettlesome internet of things third-party data. We collaborate with our support team of nephrologists, endocrinologists, cardiologists, physicians, pharmacists, nurses, and more to ground our data science in the latest medical findings.\nWhy should you come to work at Aetna? CVS Health’s enterprise assets empower our team to make a health impact on the caliber of the federal government (and we move much faster). Our claims records combined with CVS’s data enables us to solve previously unanswerable questions; we have access to everything from candy bars purchases to electronic medical records. We have unrivaled data. Finally, we have a passionate team who is laser focused on making people healthier. We are changing how American’s manage their chronic diseases.\n\nIf you have the data scientist tool kit, coupled with either a passion for healthcare or the business expertise to execute cutting edge innovations, you want to be on our team.\n\nData Scientist and Senior Data Scientist roles are based out of New York City-NY, Hartford -CT, and Wellesley-MA. All roles are on the Consumer Health and Services - Analytics and Behavior Change - Advanced Product team of Aetna, a CVS Company.",
    "location": "n/a",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-08T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-08T13:00:00-04:00"
    }
  },
  "_8kqj2d1i69244b9o8gq4ab9k851jeba26kpk6ba66l14aha56kpkcdpm6c": {
    "name": "Jane Street - CSimathon! at CMU",
    "description": "From the creators of the Estimathon, the mindbending mixture of math and trivia, comes the CStimathon!\n\nOctober 10th @ 6pm ET\nCMU, Rashid Auditorium - Gates Hillman 4401\n\nRegister as an individual or team by Oct 8th here:\nhttps://www.janestreet.com/cstimathon-cmu.html\n\nIn teams, you'll attempt 13 problems in 30 minutes, challenging your trivial knowledge of computers, CMU, or anything at all. Be prepared to come up with the best set of confidence intervals! They are called Fermi problems, such as:\n\n- How many computers were connected to the Internet on January 1, 1989?\n- What is the bandwidth under the Atlantic Ocean?\n- How many YouTube videos have more than 1 billion views?",
    "location": "GHC 4401 Rashid",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-10T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-10T19:15:00-04:00"
    }
  },
  "12lrgnb5o2umiudjvto6v431rt": {
    "name": "Intel Tabling/drop in office hour",
    "description": "Please feel free to visit our table in the CUC lobby from 9am-11am to learn about opportunities with Intel!\n\nIntel Hires BS/MS/PhD Electrical, Computer Eng., Computer Science, Chemical Eng, Chemistry, Physics, Materials Science, Mechanical Eng.\n\n--\n*Drop-ins will be held in the CPDC office located in the lower level of the UC.\n\nDrop-in at the Career & Professional Development Center to meet with recruiters from Intel! Intel is looking for BS/MS/PhD students in CS, ECE, ChemE, MSE, MechE, Chemistry, and Physics.",
    "location": " UC/wean Commons, CPDC - Interview Center (Cohon Center, LL), Room 01",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T09:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T11:00:00-04:00"
    }
  },
  "11tksbqbudnp1skjfbkkmdkape": {
    "name": "Southwest - Summer 2020 Internship Information Session",
    "description": "We're looking for Interns with Heart, and you could be the next one we find. At this virtual information session on Oct. 9 at 12 PM CT, we'll provide you with an overview of our internship program, share tips and tricks for applying, and answer any questions you might have. You must register in advance in order to tune in to this event!",
    "location": "https://careers.southwestair.com/event/5d8e4da54cedfd00068d190a/Summer-2020-Internship-Information-Session?utm_source=Handshake&utm_campaign=CampusLivestream",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T13:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T14:00:00-04:00"
    }
  },
  "2s72eco0mbmfeuo276hqktolka": {
    "name": "Intel Drop-In Hours (PM Session)",
    "description": "*Drop-ins will be held in the CPDC office located in the lower level of the UC.\n\nDrop-in at the Career & Professional Development Center to meet with recruiters from Intel! Intel is looking for BS/MS/PhD students in CS, ECE, ChemE, MSE, MechE, Chemistry, and Physics.",
    "location": "CPDC - Interview Center (Cohon Center, LL), Room 01",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T13:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T16:00:00-04:00"
    }
  },
  "0gv8co1okla5cj872qbd140oqg": {
    "name": "Intel Tech Talk",
    "description": "Please join the Intel team for a tech talk in Rashid Auditorium. We will also have recruiting representatives and CMU alumni in attendance to discuss any internship and full-time employment opportunities.\n\nIntel Hires BS/MS/PhD Electrical, Computer Eng., Computer Science, Chemical Eng, Chemistry, Physics, Materials Science, Mechanical Eng.",
    "location": "Gates/Hillman Building, 4401, Rashid Auditorium",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T16:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T18:00:00-04:00"
    }
  },
  "5lfo9s1hkvc1n6mcf57m036kep": {
    "name": "UPMC Making a Difference in Healthcare Technology - Tech Talk",
    "description": "Learn from software engineers at UPMC Enterprises how you can use your tech skills to begin to make a difference in healthcare technology.",
    "location": "Porter Hall, Room 226C",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T19:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T20:00:00-04:00"
    }
  },
  "7h5cdjbremajkd77fgphjm3lau": {
    "name": " Fosun Global Campus Recruitment",
    "description": "n/a",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-09T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-09T20:00:00-04:00"
    }
  },
  "27drk1bn4ep8a4b5otrd1q8sip": {
    "name": " Chewy - Carnegie Mellon Info Session",
    "description": "Chewy is revolutionizing the pet industry as one of the fastest growing e-commerce retailer of all time. We offer a convenient way to shop for pet supplies within a highly personalized experience that's fueled by superior customer care.\n\nWe're seeking talented, driven and analytically-minded students to join our teams as we continue to grow, scale and enter new markets. We're seeking students for the following roles:\n-Software Development Engineer I (Boston, MA)\n-Category Analyst (Dania Beach, FL)\n-Financial Analyst (Dania Beach, FL)\n-Software Development Engineer Intern (Boston, MA & Dania Beach, FL)\n-Undergraduate Business Analyst Intern (Dania Beach, FL)\n\nJoin us for our info session to learn more about our full-time and internship opportunities!",
    "location": "Porter Hall, Room A18A",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-17T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-17T19:30:00-04:00"
    }
  },
  "7senkei4cnl3l39rv6ave29jqs": {
    "name": "Gridspace: Tech Talk",
    "description": "Gridspace will be at CMU to meet world-class engineers and scientists who are passionate in machine understanding of speech and language. One of products we are going to bring into the world is like below:\nhttps://www.youtube.com/watch?v=Xu0OKD3UL_k\n\nCome join our tech talk if you have an interest in:\n\n- Computer Science / Systems Programming / Statistics and Mathematics\n- Signal Processing / Dialog Systems / Speech Synthesis\n- Speech & Language Processing / Electrical Engineering\n- Physics / Machine Learning\n\nWe are looking for talented/passionate people to join us.",
    "location": "Posner Hall, Room 152",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-24T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-24T19:30:00-04:00"
    }
  },
  "55n2kqsjj8g2pfusn0i8nrvgb8": {
    "name": "5 Ways Intuit is Empowering Employees to Bring Their Whole Selves to Work",
    "description": "At Intuit, proud maker of TurboTax, QuickBooks and Mint, we strive to create an environment where everyone is supported and can bring their whole selves to work. We want employees with a wide range of life experiences to bring new ideas and perspectives to the table, so great ideas can rise to the top.<br><br>In this live webcast, our Chief Diversity and Inclusion Officer Scott Beth, will explain the importance of bringing one’s whole self to work, share Intuit’s Diversity and Inclusion strategy, join a group of Intuit employee panelists to learn how they have brought their whole selves to work, and answer any questions you may have.<br><br>No matter who you are, what your role is, or where you reside — we hope you are able to bring your whole self to work and are valued every single day.<br><br><u>Speaking at This Event:</u><br>Scott Beth<br>Chief Diversity and Inclusion Officer, Intuit<br><br>Ann Catherine Jose<br>Mobile Engineering Leader, SBSEG, Intuit<br><br>Blaid Burgess<br>Software Engineer, Intuit<br><br>Mari Pullen<br>Senior Communications Manager, Intuit",
    "location": "http://bit.ly/wholeselves",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-25T13:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-25T14:00:00-04:00"
    }
  },
  "0dbrfeq69bphrsjujm75fc6ofi": {
    "name": "Spotify @ CMU Tech Talk + Mixer",
    "description": "Calling all CMU Tech Rockstars!\n\nThink you've got what it takes to shape the future of the audio industry as a Spotify intern?\n\nCome rock out at our Tech Talk + Mixer and meet our Band Members (aka employees)! The event playlist will consist of a discussion on what #LifeAtSpotify is like and the cool stuff our Band Members are working on! We’ll also provide info on our Summer Internship Program.\n\nJoin us at CMU on Tuesday, October, 29th at 6 PM. Space is limited so RSVP now and we will send a confirmation with location details closer to the date.\n\n#JoinTheBand",
    "location": "Margaret Morrison, Room A14",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-29T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-29T20:00:00-04:00"
    }
  },
  "3dljkp0j6k1nttj5grlovmjtib": {
    "name": "Vivo Info Session",
    "description": "vivo is a global company that specializes in the mobile Internet intelligent terminal and AI terminal technology R&D and application. Supported by its R&D centers and manufacturing bases in China (Dongguan, Shenzhen, Nanjing, Beijing, Hangzhou, and Chongqing), India, Indonesia, and the United States (San Diego), the company has progressively entered the fields of smartphones and mobile Internet with sales in China, India, Southeast Asia (Indonesia, Malaysia, Vietnam, Thailand, Myanmar, the Philippines, and Bangladesh), Russia, etc.\n\nvivo develops dynamic and stylish products for passionate, energetic young people. We focus on creating smartphones that provide customers with the ultimate experience in both mobile photography and Hi-Fi audio. Apart from smartphones, Vivo also develops various apps and internet tools which are seamlessly integrated into our products. In the future Vivo’s goal is to create a complete mobile internet ecosystem, comprehensively satisfying all user needs.",
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-21T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-21T20:00:00-04:00"
    }
  },
  "2kvl2bomvemp6f13d8nb1g4s55": {
    "name": "Activision Networking Lunch",
    "description": "Activision Networking Lunch - Tepper Quadrangle Building - 11:30am-1:30pm\n\nRooms 2002 & 2003\n\nhttps://cmu.joinhandshake.com/events/310277",
    "location": "Tepper Quad, Room 2002 & 2003",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-22T11:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-22T13:30:00-04:00"
    }
  },
  "7foukafh1hfrre30u4uokg90bj": {
    "name": "PwC Cybersecurity Lecture Series",
    "description": "Join us to hear from PwC’s Cybersecurity & Privacy leaders Gerry Stellatos and Mark Lobel for an interactive workshop through the course of a ransomware attack on a major organization, simulating plans, challenges, roadblocks, and consequences that can arise during the course of a cyber incident.\nImmediately following the lecture, PwC will be holding walk-in office hours in the HBH Rotunda. No appointment necessary:\nWalk-in session: 1:30pm-2:30pm HBH Rotunda",
    "location": "Hamburg Hall, (HBH) 1002",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-22T12:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-22T13:30:00-04:00"
    }
  },
  "51c61qbpcnp9ulq4jsf9tmueng": {
    "name": "Roundtable Q&A with Activision: Game Design",
    "description": "Join Activision for an informal roundtable discussion on what it takes to make it in game design and what it's like to work for one of the most prolific gaming companies in the world. Dress is casual, no resume required.",
    "location": "CFA 303",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-22T16:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-22T17:30:00-04:00"
    }
  },
  "4be2bi9v1ftbpdrhr7or2foq4q": {
    "name": "Signify Internship & Co-op Virtual Career Event",
    "description": "Join us October 22nd to hear about the intern experience at Signify, the new company name of Philips Lighting. Hear from a panel of current employees and interns about the program including the culture, what type of projects interns and co-ops contribute to, what hiring managers are looking for, and development opportunities. Register today!<br><br><br><u><b>Speaking at This Event</b></u><br>Adam Roth <br>Campus Recruiter<br>Adam handles the recruitment process for internships and co-ops.<br><br>Katrina Mueller<br>Recruitment Marketing Manager<br>Katrina manages recruitment marketing and employer branding for the Americas.<br><br>Smrithi Mathew<br>End User MBA Marketing Co-op<br>Smrithi is completing her co-op with Signify this year and will share her experience first hand.<br><br>Kaitlin Sullivan<br>Integrated Marketing Manager, Philips Hue<br>Kaitlin works with the brand team to create content and messaging for consumers on multiple media platforms, aiming to interact with consumers in a way that resonates with them.<br><br>Julia Pollock<br>Sales Enablement Manager",
    "location": "https://register.gotowebinar.com/register/6911131371298753549",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-21T17:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-21T18:00:00-04:00"
    }
  },
  "6qad0lgi31mf5jf3s1labhckg8": {
    "name": " OPPO 2020 Overseas Campus Recruitment",
    "description": "In 2008, OPPO launched its first mobile phone, the A103, nicknamed “Smiley Face”. This marked the beginning of a journey to explore and pioneer extraordinary technology. Today, OPPO showcases the beauty of technology to its global consumers through smart devices (with its core products being the Find and Reno series smartphones), ColorOS, and internet services such as OPPO Cloud and OPPO+.\nOPPO has a presence in over 40 different countries and regions and has set up 6 research divisions and 4 R&D centers. OPPO has also established a global design center in London. Together, over 40,000 OPPO employees join their efforts to create a better life for all.\nOPPO has established OPPO Research Institute, which incorporates 6 research divisions. OPPO also has 4 R &D centers globally.\n\nStudents can apply through link:http://job.lockinchina.com/network/1130.html\n\nThis event was jointly organized by Lockin China and OPPO to bring career opportunities to college talents. Lockin China is the largest global career development platform for young professionals in China. As of early 2018, Lockin China has more than 25,000 registered companies, providing more than 100,000 job opportunities. In the past three years, we have successfully helped over 500,000 global young talents from close to 1000 Universities to start their career in China job market.\nGo through link: http://job.lockinchina.com/network/1130.html for application details.",
    "location": "Cohon University Center, Danforth Conference Room, 2nd Floor",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-22T17:30:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-22T19:30:00-04:00"
    }
  },
  "4mbj7mif8smvrca0ovh99se6br": {
    "name": "Activision Industry Talk / Q&A",
    "description": "Industry talk with the Games Creation Society + other on-campus clubs",
    "location": "Gates/Hillman Building, 4401, Rashid Auditorium",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-22T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-22T19:30:00-04:00"
    }
  },
  "_852j8d9o70q42b9h60qjeb9k6ksjeb9p8or3eb9h8gpjicpl88o3edpk6s": {
    "name": "Capital One  - Digital Design & Product Management",
    "description": "At Capital One, we don’t only think big things—we do big things. We were the first company to develop and offer mass customization and personalization of credit card products, and we have been innovating relentlessly ever since.\n\nToday, we are a nationally recognized brand, a top 10 bank, and a scientific laboratory on a journey to become a leading high-tech company and digital innovator touching over 65 million customer accounts. Founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One has grown to $22 billion in revenue in just over 20 years.\n\nJoin Capital One digital designers and product managers for an informational session and panel on Wednesday, 10/2. This is a great chance to hear about our exciting design and product management rotation and internship programs, as well as our company, culture, and more.\n\nFood, refreshments, & swag provided!",
    "location": " Margaret Morrison , Room 103",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-10-23T18:00:00-04:00"
    },
    "end": {
      "dateTime": "2019-10-23T19:30:00-04:00"
    }
  },
  "4pbqotoks9g8saposfalaq5i2r": {
    "name": "Info Session with Qualcomm's Wireless R&D and Qualcomm Innovative Fellowship",
    "description": "n/a",
    "location": "Margaret Morrison, Room A14",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-05T17:00:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-05T19:00:00-05:00"
    }
  },
  "4dberrtd4ndk5csnsa57bnk17j": {
    "name": "PNC Security Speaker Series",
    "description": "Please join us for an evening of networking with security industry professionals and students. Please visit http://www.cvent.com/events/security-speaker-series/invitation-18a76d2f369641d4a865cfdbe331a529.aspx for more information and to RSVP.",
    "location": "300 Fifth Avenue, Pittsburgh, Pennsylvania 15222, United States of America",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-05T17:30:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-05T20:00:00-05:00"
    }
  },
  "49opg0ld8k69eir4aqsksfboc1": {
    "name": "HireUp Tech Networking Event Sponsored by the Pittsburgh Technology Council",
    "description": "*This fair is independently hosted and run by the Pittsburgh Technology Council and is open to Pitt and CMU students.\n\nThis fair is a great opportunity for Students studying information technology, engineering, traditional sciences, and more who are looking to stay in Pittsburgh. This fair is sponsored by the Pittsburgh Technology Council.\n\nLight refreshments will be available throughout the event for both recruiters and jobseekers.\n\nWHEN: Tuesday, November 12, 2019 from 4-7 pm\nWHERE: University of Pittsburgh, William Pitt Union\n\nDetails & Register:\nhttps://members.pghtech.org/ptc/MemberPortal/CoreCopy/Events/Event_Display.aspx?EventKey=FY20HIRE01&WebsiteKey=8480e7db-8b32-457b-bfae-e89410d077b6\n\nYou will need to register before attending the event.\n\nCOMPANIES EXHIBITING:\nAll Lines Technology\nAmerican Eagle Outfitters\nCarnegie Mellon University's Heinz College\nData Science Automation, Inc.\nDQE Communications, LLC\nFacebook\nFedEx Services\nGeneral Dynamics Mission Systems - Viz\nInterphase Materials\nLucas Systems, Inc.\nManagement Science Associates, Inc.\nMcKesson Pharmacy Systems\nMethod Automation Services\nNet Health\nNielsen\nRIMSYS, LLC\nRPM Industries\nSheetz, Inc.\n\n\nMore companies signing up every day. Stay Tuned!!!",
    "location": "University of Pittsburgh, William Pitt Union",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-12T16:00:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-12T19:00:00-05:00"
    }
  },
  "1cd8atonhv21g0tdvnje9d3852": {
    "name": "Pitching Yourself to Startups Webinar - November",
    "description": "Venture For America has helped over 1,000 recent grads find jobs in startups across the country. We’re excited to share our tips and tricks to land a startup job that can propel your career forward.",
    "location": "https://2019pitchingyourselftostartups.splashthat.com",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-12T16:30:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-12T17:30:00-05:00"
    }
  },
  "33lqkcaei74a0top49e5t4rv0v": {
    "name": "View - Info Sesh",
    "description": "In the great tradition of challenging the way we think about everyday essentials, the team at View has reinvented something that hasn't changed for centuries – the simple window – and in doing so, is transforming the largest industry in the world: real estate.\nWe manufacture View Dynamic Glass, a new generation of smart windows that let in natural light and views and enhance mental and physical wellbeing by significantly reducing headaches, eyestrain and drowsiness. In addition, View’s windows reduce glare and heat, improving the energy efficiency of buildings by 20 percent. View’s windows are digital, cloud connected, and can be controlled from anywhere, including your phone. We are also leveraging advances in AI to develop smart building and IoT applications that make buildings healthier, smarter and more productive than anyone ever imagined.\nView is already installed in over 50 million square feet and is growing rapidly. If you dream of changing the world to make it a better place – join us.",
    "location": "Baker Hall, Room 235B",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-12T18:00:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-12T19:30:00-05:00"
    }
  },
  "6jpk6lj25as9hhb1s1brm86l1d": {
    "name": "General Motors Tech Talk",
    "description": "Join General Motors for a tech talk about developing Super Cruise self-driving capabilities, given by Brandon Vivian, Executive Chief Engineer of Cadillac.\n\n\nSpeaking at This Event\nBrandon Vivian\nExecutive Chief Engineer",
    "location": "Posner Hall, Room 153",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-13T17:30:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-13T18:30:00-05:00"
    }
  },
  "06u2pedn93ieu0nhu6eu713tqe": {
    "name": "Intuit Office Hours",
    "description": "n/a",
    "location": "UC basement CPDC interview center",
    "organizer": {
      "email": "andrew.cmu.edu_ed8rhpcg56rjk8oqssq6envtds@group.calendar.google.com",
      "displayName": "AKProf - Tech",
      "self": true
    },
    "start": {
      "dateTime": "2019-11-20T15:00:00-05:00"
    },
    "end": {
      "dateTime": "2019-11-20T17:00:00-05:00"
    }
  }
}